description: This search looks for AWS CloudTrail events where a user successfully
  launches an abnormally high number of instances. This search is deprecated and have
  been translated to use the latest Change Datamodel.
required_fields:
- _time
- eventName
- errorCode
- src_user
rule: sourcetype=aws:cloudtrail eventName=RunInstances errorCode=success `abnormally_high_aws_instances_launched_by_user___mltk_filter`
  | bucket span=10m _time  | stats count as instances_launched by _time src_user  |
  apply ec2_excessive_runinstances_v1  | rename "IsOutlier(instances_launched)" as
  isOutlier  | where isOutlier=1
