description: This search looks for AWS CloudTrail events from Amazon Security Lake
  where a user is making successful API calls to view/update/delete the existing password
  policy in an AWS organization. It is unlikely for a regular user to conduct this
  operation. These events may potentially be malicious, adversaries often use this
  information to gain more understanding of the password defenses in place and exploit
  them to increase their attack surface when a user account is compromised.
required_fields:
- api.service.name
- api.operation
- identity.user.account_uid
- identity.user.credential_uid
- identity.user.name
- identity.user.type
- identity.user.uid
- identity.user.uuid
- http_request.user_agent
- src_endpoint.ip
rule: sourcetype=aws:cloudtrail:lake "api.service.name"="iam.amazonaws.com" "api.operation"
  IN ("UpdateAccountPasswordPolicy","GetAccountPasswordPolicy","DeleteAccountPasswordPolicy")
  "api.response.error"=null | stats count min(_time) as firstTime max(_time) as lastTime
  by identity.user.account_uid identity.user.credential_uid identity.user.name identity.user.type
  identity.user.uid identity.user.uuid http_request.user_agent src_endpoint.ip cloud.region
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `asl_aws_password_policy_changes_filter`
