description: This search looks for AWS CloudTrail events where a user logged into
  the AWS account, is making API calls and has not enabled Multi Factor authentication.
  Multi factor authentication adds a layer of security by forcing the users to type
  a unique authentication code from an approved authentication device when they access
  AWS websites or services. AWS Best Practices recommend that you enable MFA for privileged
  IAM users.
required_fields:
- _time
- userIdentity.sessionContext.attributes.mfaAuthenticated
- eventName
- userIdentity.arn
- userIdentity.type
- user
rule: sourcetype=aws:cloudtrail userIdentity.sessionContext.attributes.mfaAuthenticated=false
  | search NOT [| inputlookup aws_service_accounts | fields identity | rename identity
  as user]| stats  count min(_time) as firstTime max(_time) as lastTime values(eventName)
  as eventName by userIdentity.arn userIdentity.type user | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `detect_api_activity_from_users_without_mfa_filter`
