description: This search looks for AWS CloudTrail events wherein a console login event
  by a user was recorded within the last hour, then compares the event to a lookup
  file of previously seen users (by ARN values) who have logged into the console.
  The alert is fired if the user has logged into the console for the first time within
  the last hour. Deprecated now this search is updated to use the Authentication datamodel.
required_fields:
- _time
- eventName
- userIdentity.arn
rule: sourcetype=aws:cloudtrail eventName=ConsoleLogin | rename userIdentity.arn as
  user | stats earliest(_time) as firstTime latest(_time) as lastTime by user | inputlookup
  append=t previously_seen_users_console_logins_cloudtrail  | stats min(firstTime)
  as firstTime max(lastTime) as lastTime by user | eval userStatus=if(firstTime >=
  relative_time(now(), "-70m@m"), "First Time Logging into AWS Console","Previously
  Seen User") | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)|convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)| where userStatus ="First Time Logging into AWS Console"  | `detect_new_user_aws_console_login_filter`
