description: This search looks for EC2 instances being created by users who have not
  created them before. This search is deprecated and have been translated to use the
  latest Change Datamodel.
required_fields:
- _time
- eventName
- errorCode
- userIdentity.arn
rule: sourcetype=aws:cloudtrail eventName=RunInstances [search sourcetype=aws:cloudtrail
  eventName=RunInstances errorCode=success | stats earliest(_time) as firstTime latest(_time)
  as lastTime by userIdentity.arn | rename userIdentity.arn as arn | inputlookup append=t
  previously_seen_ec2_launches_by_user.csv | stats min(firstTime) as firstTime, max(lastTime)
  as lastTime by arn | outputlookup previously_seen_ec2_launches_by_user.csv | eval
  newUser=if(firstTime >= relative_time(now(), "-70m@m"), 1, 0) | where newUser=1
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | rename arn as userIdentity.arn | table userIdentity.arn] | rename
  requestParameters.instanceType as instanceType, responseElements.instancesSet.items{}.instanceId
  as dest, userIdentity.arn as user | table _time, user, dest, instanceType | `ec2_instance_started_with_previously_unseen_user_filter`
