description: This search looks for AWS CloudTrail events where an instance is started
  in a particular region in the last one hour and then compares it to a lookup file
  of previously seen regions where an instance was started
required_fields:
- _time
- awsRegion
rule: sourcetype=aws:cloudtrail earliest=-1h StartInstances | stats earliest(_time)
  as earliest latest(_time) as latest by awsRegion | inputlookup append=t previously_seen_aws_regions.csv
  | stats min(earliest) as earliest max(latest) as latest by awsRegion | outputlookup
  previously_seen_aws_regions.csv | eval regionStatus=if(earliest >= relative_time(now(),"-1d@d"),
  "Instance Started in a New Region","Previously Seen Region") | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | where regionStatus="Instance
  Started in a New Region" | `ec2_instance_started_in_previously_unseen_region_filter`
