description: This search looks for command-line arguments that use a `/c` parameter
  to execute a command that has not previously been seen.
required_fields:
- _time
- Processes.process_name
- Processes.process
- Processes.parent_process_name
- Processes.dest
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_name = cmd.exe Processes.process
  = "* /c *" by Processes.process Processes.process_name Processes.parent_process_name
  Processes.dest| `drop_dm_object_name(Processes)`| convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | search
  [| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` earliest(_time) as firstTime latest(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_name = cmd.exe Processes.process
  = "* /c *" by Processes.process | `drop_dm_object_name(Processes)` | inputlookup
  append=t previously_seen_cmd_line_arguments | stats min(firstTime) as firstTime,
  max(lastTime) as lastTime by process | outputlookup previously_seen_cmd_line_arguments
  | eval newCmdLineArgument=if(firstTime >= relative_time(now(), "-70m@m"), 1, 0)
  | where newCmdLineArgument=1 | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | table process] | `first_time_seen_command_line_argument_filter`'
