description: This search provides information on Kubernetes service accounts with
  failure or forbidden access status, this search can be extended by using top or
  rare operators to find trends or rarities in failure status, user agents, source
  IPs and request URI
required_fields:
- _time
rule: sourcetype="google:gcp:pubsub:message" system:serviceaccounts data.protoPayload.response.status.allowed!=*
  | table src_ip src_user http_user_agent data.protoPayload.response.spec.resourceAttributes.namespace
  data.resource.labels.cluster_name data.protoPayload.response.spec.resourceAttributes.verb  data.protoPayload.request.status.allowed
  data.protoPayload.response.status.reason data.labels.authorization.k8s.io/decision
  | dedup src_ip src_user | `kubernetes_gcp_detect_service_accounts_forbidden_failure_access_filter`
