description: This search looks for DNS requests for faux domains similar to the domains
  that you want to have monitored for abuse.
required_fields:
- _time
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` values(DNS.answer) as IPs min(_time) as firstTime
  from datamodel=Network_Resolution by DNS.src, DNS.query | `drop_dm_object_name("DNS")`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| lookup update=true brandMonitoring_lookup
  domain as query OUTPUT domain_abuse | search domain_abuse=true | `monitor_dns_for_brand_abuse_filter`'
