description: '**DEPRECATION NOTE** - This search has been deprecated and replaced
  with `Okta Multiple Users Failing To Authenticate From Ip`. This analytic identifies
  multiple failed logon attempts from a single IP in a short period of time. Use this
  analytic to identify patterns of suspicious logins from a single source and filter
  as needed or use this to drive tuning for higher fidelity analytics.'
required_fields:
- _time
- outcome.reason
- client.geographicalContext.country
- client.geographicalContext.state
- client.geographicalContext.city
- user
- src_ip
- displayMessage
- eventType
- outcome.result
rule: eventtype=okta_log OR sourcetype = "OktaIM2:log" eventType=user.session.start
  outcome.result=FAILURE | rename client.geographicalContext.country as country, client.geographicalContext.state
  as state, client.geographicalContext.city as city | stats min(_time) as firstTime
  max(_time) as lastTime dc(src_user) as distinct_users values(src_user) as users
  by src_ip, displayMessage, outcome.reason, country, state, city | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | search
  distinct_users > 5| `multiple_okta_users_with_invalid_credentials_from_the_same_ip_filter`
