description: '**DEPRECATION NOTE** - This search has been deprecated and replaced
  with `Okta Multiple Failed MFA Requests For User`. The following analytic identifies
  an account that has rejected more than 2 Push notifications in a 10 minute window.
  Modify this query for your environment by upping the count or time window.'
required_fields:
- _time
- user
- src_ip
- eventType
- status
rule: eventtype=okta_log OR sourcetype = "OktaIM2:log" outcome.reason="User rejected
  Okta push verify" OR (debugContext.debugData.factor="OKTA_VERIFY_PUSH" outcome.result=FAILURE
  legacyEventType="core.user.factor.attempt_fail" "target{}.detailEntry.methodTypeUsed"="Get
  a push notification") | bin _time as bin_time span=10m | eval user=coalesce(actor.alternateId,user),
  user=mvindex(split(user, "@"), 0), event_time = _time | stats earliest(event_time)
  as event_time, min(_time) as firsttime max(_time) as lasttime values(client.ipAddress)
  as client.ipAddress, values(outcome.reason) as outcome, values(src_ip) AS src_ip,
  values(client.userAgent.rawUserAgent) as user_agent, values(eventType) as eventType,
  values(outcome.result) as action, values(legacyEventType) as legacyEventType values(index)
  as idx, values(sourcetype) as st count by bin_time user host | rename bin_time as
  timeWindow | convert ctime(*timeWindow) ctime(firsttime) ctime(lasttime) | where
  count >= 2 | `okta_two_or_more_rejected_okta_pushes_filter`
