description: This search looks for applications on the endpoint that you have marked
  as prohibited.
required_fields:
- _times
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes by Processes.dest Processes.user Processes.process_name
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `drop_dm_object_name(Processes)` | search * | `prohibited_software_on_endpoint_filter`'
