description: The search looks for command-line arguments used to hide a file or directory
  using the reg add command.
required_fields:
- _time
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` values(Processes.process) as process min(_time)
  as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name
  = reg.exe Processes.process="*add*" Processes.process="*Hidden*" Processes.process="*REG_DWORD*"
  by Processes.process_name Processes.parent_process_name Processes.dest Processes.user|
  `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  |convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| regex process = "(/d\s+2)"
  | `reg_exe_used_to_hide_files_directories_via_registry_keys_filter`'
