description: This search looks for PowerShell processes started with a base64 encoded
  command-line passed to it, with parameters to modify the execution policy for the
  process, and those that prevent the display of an interactive prompt to the user.
  This combination of command-line options is suspicious because it overrides the
  default PowerShell execution policy, attempts to hide itself from the user, and
  passes an encoded script to be run on the command-line. Deprecated because almost
  the same as Malicious PowerShell Process - Encoded Command
required_fields:
- _time
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count values(Processes.process) as process values(Processes.parent_process)
  as parent_process min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where Processes.process_name=powershell.exe by Processes.user Processes.process_name
  Processes.parent_process_name Processes.dest  | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)| search (process=*-EncodedCommand* OR process=*-enc*) process=*-Exec*
  | `suspicious_powershell_command_line_arguments_filter`'
