description: This search looks for applications on the endpoint that you have marked
  as uncommon.
required_fields:
- _time
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes by Processes.dest Processes.user Processes.process
  Processes.process_name | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)|
  convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `drop_dm_object_name(Processes)`
  | lookup update=true lookup_uncommon_processes_default process_name as process_name
  outputnew uncommon_default,category_default,analytic_story_default,kill_chain_phase_default,mitre_attack_default
  | lookup update=true  lookup_uncommon_processes_local process_name as process_name
  outputnew uncommon_local,category_local,analytic_story_local,kill_chain_phase_local,mitre_attack_local
  | eval uncommon = coalesce(uncommon_default, uncommon_local), analytic_story = coalesce(analytic_story_default,
  analytic_story_local), category=coalesce(category_default, category_local), kill_chain_phase=coalesce(kill_chain_phase_default,
  kill_chain_phase_local), mitre_attack=coalesce(mitre_attack_default, mitre_attack_local)
  | fields - analytic_story_default, analytic_story_local, category_default, category_local,
  kill_chain_phase_default, kill_chain_phase_local, mitre_attack_default, mitre_attack_local,
  uncommon_default, uncommon_local | search uncommon=true |`uncommon_processes_on_endpoint_filter`'
