description: The following hunting analytic is an experimental query built against
  a accidental feature using the latest Sysmon TA 3.0 (https://splunkbase.splunk.com/app/5709/)
  which maps the module load (ImageLoaded) to process_name. This analytic will deprecate
  once this is fixed. This hunting analytic identifies known libraries in Windows
  that may be used in a DLL search order hijack or DLL Sideloading setting. This may
  require recompiling the DLL, moving the DLL or moving the vulnerable process. The
  query looks for any running out of system32 or syswow64. Some libraries natively
  run out of other application paths and will need to be added to the exclusion as
  needed. The lookup is comprised of Microsoft native libraries identified within
  the Hijacklibs.net project.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.process_name
- Processes.process_path
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  values(Processes.process_name) as process_name from datamodel=Endpoint.Processes
  where Processes.dest!=unknown Processes.user!=unknown NOT (Processes.process_path
  IN ("*\\system32\\*", "*\\syswow64\\*","*\\winsxs\\*","*\\wbem\\*"))  by Processes.dest
  Processes.user Processes.parent_process_name Processes.process_name Processes.process_path
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `drop_dm_object_name(Processes)` | lookup hijacklibs library AS
  process_name OUTPUT islibrary | search islibrary = True | rename parent_process_name
  as process_name , process_name AS ImageLoaded, process_path AS Module_Path | `windows_dll_search_order_hijacking_hunt_filter`'
