description: The following analytic detects unauthenticated requests made against
  the Kubernetes Pods API, indicating potential unauthorized access attempts. It leverages
  the `aws_cloudwatchlogs_eks` data source, filtering for events where `user.username`
  is "system:anonymous", `verb` is "list", and `objectRef.resource` is "pods", with
  `requestURI` set to "/api/v1/pods". This activity is significant as it may signal
  attempts to access sensitive resources or execute unauthorized commands within the
  Kubernetes environment. If confirmed malicious, such access could lead to data compromise,
  unauthorized command execution, or lateral movement within the cluster.
required_fields:
- _time
- user.username
- verb
- objectRef.resource
- requestURI
- source
- sourceIPs{}
- responseStatus.reason
- responseStatus.code
- userAgent
- src_ip
- user.groups{}
rule: sourcetype="aws:cloudwatchlogs:eks" "user.username"="system:anonymous" verb=list
  objectRef.resource=pods requestURI="/api/v1/pods" | rename source as cluster_name
  sourceIPs{} as src_ip | stats count min(_time) as firstTime max(_time) as lastTime
  values(responseStatus.reason) values(responseStatus.code) values(userAgent) values(verb)
  values(requestURI) by src_ip cluster_name user.username user.groups{} | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `amazon_eks_kubernetes_pod_scan_detection_filter`
