description: The following analytic detects the upload of new containers to AWS Elastic
  Container Service (ECR) outside of standard business hours through AWS CloudTrail
  events. It identifies this behavior by monitoring for `PutImage` events occurring
  before 8 AM or after 8 PM, as well as any uploads on weekends. This activity is
  significant for a SOC to investigate as it may indicate unauthorized access or malicious
  deployments, potentially leading to compromised services or data breaches. Identifying
  and addressing such uploads promptly can mitigate the risk of security incidents
  and their associated impacts.
required_fields:
- api.operation
- actor.user.account_uid
- actor.user.name
- actor.user.uid
- http_request.user_agent
- src_endpoint.ip
- cloud.region
rule: sourcetype=aws:cloudtrail:lake api.operation=PutImage | eval hour=strftime(time/pow(10,3),
  "%H"), weekday=strftime(time/pow(10,3), "%A") | where hour >= 20 OR hour < 8 OR
  weekday=Saturday OR weekday=Sunday | fillnull | stats count min(_time) as firstTime
  max(_time) as lastTime by api.operation actor.user.account_uid actor.user.name actor.user.uid
  http_request.user_agent cloud.region | rename actor.user.name as user, cloud.region
  as region, http_request.user_agent as user_agent, actor.user.account_uid as aws_account_id
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `asl_aws_ecr_container_upload_outside_business_hours_filter`
