description: The following analytic detects an AWS CloudTrail event where a user with
  permissions updates the login profile of another user. It leverages CloudTrail logs
  to identify instances where the user making the change is different from the user
  whose profile is being updated. This activity is significant because it can indicate
  privilege escalation attempts, where an attacker uses a compromised account to gain
  higher privileges. If confirmed malicious, this could allow the attacker to escalate
  their privileges, potentially leading to unauthorized access and control over sensitive
  resources within the AWS environment.
required_fields:
- _time
- eventName
- userAgent
- errorCode
- requestParameters.userName
rule: sourcetype=aws:cloudtrail eventName = UpdateLoginProfile userAgent !=console.amazonaws.com
  errorCode = success | eval match=if(match(userIdentity.userName,requestParameters.userName),
  1,0) | search match=0 | stats count min(_time) as firstTime max(_time) as lastTime
  by requestParameters.userName src eventName eventSource aws_account_id errorCode
  userAgent eventID awsRegion userIdentity.userName user_arn | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `aws_updateloginprofile_filter`
