description: The following analytic detects `StopLogging` events in AWS CloudTrail
  logs. It leverages CloudTrail event data to identify when logging is intentionally
  stopped, excluding console-based actions and focusing on successful attempts. This
  activity is significant because adversaries may stop logging to evade detection
  and operate stealthily within the compromised environment. If confirmed malicious,
  this action could allow attackers to perform further activities without being logged,
  hindering incident response and forensic investigations, and potentially leading
  to unauthorized access or data exfiltration.
required_fields:
- _time
- eventName
- eventSource
- requestParameters.name
- userAgent
- aws_account_id
- src
- region
rule: sourcetype=aws:cloudtrail eventName = StopLogging eventSource = cloudtrail.amazonaws.com
  userAgent !=console.amazonaws.com errorCode = success| stats count min(_time) as
  firstTime max(_time) as lastTime values(requestParameters.name) as stopped_cloudtrail_name
  by src region eventName userAgent user_arn aws_account_id | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `aws_defense_evasion_stop_logging_cloudtrail_filter`
