description: The following analytic identifies a single source IP failing to authenticate
  into the AWS Console with multiple valid users. It uses CloudTrail logs and calculates
  the standard deviation for source IP, leveraging the 3-sigma rule to detect unusual
  numbers of failed authentication attempts. This behavior is significant as it may
  indicate a Password Spraying attack, where an adversary attempts to gain initial
  access or elevate privileges. If confirmed malicious, this activity could lead to
  unauthorized access, data breaches, or further exploitation within the AWS environment.
required_fields:
- _time
- user
- action
- eventName
- src_ip
rule: sourcetype=aws:cloudtrail eventName=ConsoleLogin action=failure | bucket span=10m
  _time | stats  dc(_raw) AS distinct_attempts values(user_name) as tried_accounts
  by _time, src_ip | eventstats  avg(distinct_attempts) as avg_attempts , stdev(distinct_attempts)
  as ip_std by _time | eval  upperBound=(avg_attempts+ip_std*3) | eval  isOutlier=if(distinct_attempts
  > 10 and distinct_attempts >= upperBound, 1, 0) | where isOutlier = 1 |`aws_unusual_number_of_failed_authentications_from_ip_filter`
