description: The following analytic detects the creation of AWS Network Access Control
  Lists (ACLs) with all ports open to a specified CIDR. It leverages AWS CloudTrail
  events, specifically monitoring for `CreateNetworkAclEntry` or `ReplaceNetworkAclEntry`
  actions with rules allowing all traffic. This activity is significant because it
  can expose the network to unauthorized access, increasing the risk of data breaches
  and other malicious activities. If confirmed malicious, an attacker could exploit
  this misconfiguration to gain unrestricted access to the network, potentially leading
  to data exfiltration, service disruption, or further compromise of the AWS environment.
required_fields:
- _time
- eventName
- requestParameters.ruleAction
- requestParameters.egress
- requestParameters.aclProtocol
- requestParameters.portRange.to
- requestParameters.portRange.from
- requestParameters.cidrBlock
- userName
- userIdentity.principalId
- userAgent
rule: sourcetype=aws:cloudtrail eventName=CreateNetworkAclEntry OR eventName=ReplaceNetworkAclEntry
  requestParameters.ruleAction=allow requestParameters.egress=false requestParameters.aclProtocol=-1
  | append [search sourcetype=aws:cloudtrail eventName=CreateNetworkAclEntry OR eventName=ReplaceNetworkAclEntry
  requestParameters.ruleAction=allow requestParameters.egress=false requestParameters.aclProtocol!=-1
  | eval port_range='requestParameters.portRange.to' - 'requestParameters.portRange.from'
  | where port_range>1024] | fillnull | stats count min(_time) as firstTime max(_time)
  as lastTime by userName user_arn userIdentity.principalId eventName requestParameters.ruleAction
  requestParameters.egress requestParameters.aclProtocol requestParameters.portRange.to
  requestParameters.portRange.from src userAgent requestParameters.cidrBlock | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `aws_network_access_control_list_created_with_all_open_ports_filter`
