description: The following analytic detects the upload of a new container image to
  AWS Elastic Container Registry (ECR) outside of standard business hours. It leverages
  AWS CloudTrail logs to identify `PutImage` events occurring between 8 PM and 8 AM
  or on weekends. This activity is significant because container uploads outside business
  hours can indicate unauthorized or suspicious activity, potentially pointing to
  a compromised account or insider threat. If confirmed malicious, this could allow
  an attacker to deploy unauthorized or malicious containers, leading to potential
  data breaches or service disruptions.
required_fields:
- eventSource
- eventName
- awsRegion
- requestParameters.imageTag
- requestParameters.registryId
- requestParameters.repositoryName
- user
- userName
- src_ip
rule: sourcetype=aws:cloudtrail eventSource=ecr.amazonaws.com eventName=PutImage date_hour>=20
  OR date_hour<8 OR date_wday=saturday OR date_wday=sunday | rename requestParameters.*
  as * | rename repositoryName AS repository | eval phase="release" | eval severity="medium"
  | stats min(_time) as firstTime max(_time) as lastTime by awsRegion, eventName,
  eventSource, user, userName, src_ip, imageTag, registryId, repository, phase, severity
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `aws_ecr_container_upload_outside_business_hours_filter`
