description: The following analytic detects multiple failed attempts to assume an
  AWS IAM role, indicating a potential brute force attack. It leverages AWS CloudTrail
  logs to identify `MalformedPolicyDocumentException` errors with a status of `failure`
  and filters out legitimate AWS services. This activity is significant as repeated
  failures to assume roles can indicate an adversary attempting to guess role names,
  which is a precursor to unauthorized access. If confirmed malicious, this could
  lead to unauthorized access to AWS resources, potentially compromising sensitive
  data and services.
required_fields:
- _time
- eventName
- userAgent
- errorCode
- requestParameters.policyName
rule: sourcetype=aws:cloudtrail (errorCode=MalformedPolicyDocumentException) status=failure
  (userAgent!=*.amazonaws.com) | stats count min(_time) as firstTime max(_time) as
  lastTime values(requestParameters.policyName) as policy_name by src eventName eventSource
  aws_account_id errorCode requestParameters.policyDocument userAgent eventID awsRegion
  userIdentity.principalId user_arn | where count >= 2 | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `aws_iam_assume_role_policy_brute_force_filter`
