description: The following analytic detects successful API calls to view, update,
  or delete the password policy in an AWS organization. It leverages AWS CloudTrail
  logs to identify events such as "UpdateAccountPasswordPolicy," "GetAccountPasswordPolicy,"
  and "DeleteAccountPasswordPolicy." This activity is significant because it is uncommon
  for regular users to perform these actions, and such changes can indicate an adversary
  attempting to understand or weaken password defenses. If confirmed malicious, this
  could lead to compromised accounts and increased attack surface, potentially allowing
  unauthorized access and control over AWS resources.
required_fields:
- _time
- eventName
- userAgent
- errorCode
- requestParameters.userName
- eventSource
- user_arn
- aws_account_id
- src_ip
rule: sourcetype=aws:cloudtrail eventName IN ("UpdateAccountPasswordPolicy","GetAccountPasswordPolicy","DeleteAccountPasswordPolicy")
  errorCode=success | stats count values(eventName) as eventName values(userAgent)
  min(_time) as firstTime max(_time) as lastTime by eventSource aws_account_id errorCode  awsRegion
  userIdentity.principalId user_arn src_ip | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)  | `aws_password_policy_changes_filter`
