description: The following analytic identifies unsuccessful login attempts to the
  AWS Management Console using a specific user identity. It leverages AWS CloudTrail
  logs to detect failed authentication events associated with the AWS ConsoleLogin
  action. This activity is significant for a SOC because repeated failed login attempts
  may indicate a brute force attack or unauthorized access attempts. If confirmed
  malicious, an attacker could potentially gain access to AWS account services and
  resources, leading to data breaches, resource manipulation, or further exploitation
  within the AWS environment.
required_fields:
- _time
- app
- eventSource
- action
- signature
- dest
- user
- user_id
rule: '| tstats count earliest(_time) as firstTime, latest(_time) as lastTime from
  datamodel=Authentication where Authentication.action = failure Authentication.app=AwsConsoleSignIn
  Authentication.signature=ConsoleLogin BY Authentication.app Authentication.signature
  Authentication.dest  Authentication.user Authentication.action Authentication.user_id
  Authentication.src | `drop_dm_object_name(Authentication)`  | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)|  convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `aws_credential_access_failed_login_filter`'
