description: The following analytic detects the resetting of the master user password
  for an Amazon RDS DB instance. It leverages AWS CloudTrail logs to identify events
  where the `ModifyDBInstance` API call includes a new `masterUserPassword` parameter.
  This activity is significant because unauthorized password resets can grant attackers
  access to sensitive data stored in production databases, such as credit card information,
  PII, and healthcare data. If confirmed malicious, this could lead to data breaches,
  regulatory non-compliance, and significant reputational damage. Immediate investigation
  is required to determine the legitimacy of the password reset.
required_fields:
- _time
- eventName
- eventSource
- requestParameters.dBInstanceIdentifier
- userAgent
- sourceIPAddress
- awsRegion
rule: sourcetype=aws:cloudtrail eventSource="rds.amazonaws.com" eventName=ModifyDBInstance
  "requestParameters.masterUserPassword"=* | stats count min(_time) as firstTime max(_time)
  as lastTime values(requestParameters.dBInstanceIdentifier) as database_id by src
  awsRegion eventName userAgent user_arn| convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)|
  convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `aws_credential_access_rds_password_reset_filter`
