description: The following analytic detects suspicious modifications to AWS AMI attributes,
  such as sharing an AMI with another AWS account or making it publicly accessible.
  It leverages AWS CloudTrail logs to identify these changes by monitoring specific
  API calls. This activity is significant because adversaries can exploit these modifications
  to exfiltrate sensitive data stored in AWS resources. If confirmed malicious, this
  could lead to unauthorized access and potential data breaches, compromising the
  confidentiality and integrity of organizational information.
required_fields:
- _time
- eventName
- user_arn
- src_ip
- requestParameters.attributeType
- aws_account_id
- vendor_region
- user_agent
- userIdentity.principalId
rule: sourcetype=aws:cloudtrail eventName=ModifyImageAttribute (requestParameters.launchPermission.add.items{}.userId
  = * OR requestParameters.launchPermission.add.items{}.group = all) | rename requestParameters.launchPermission.add.items{}.group
  as group_added | rename requestParameters.launchPermission.add.items{}.userId as
  accounts_added | eval ami_status=if(match(group_added,"all") ,"Public AMI", "Not
  Public")  | stats count min(_time) as firstTime max(_time) as lastTime  values(group_added)
  values(accounts_added) as accounts_added values(ami_status) by  src_ip region eventName
  userAgent user_arn aws_account_id userIdentity.principalId |  convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `aws_ami_attribute_modification_for_exfiltration_filter`
