description: The following analytic identifies the creation of a login profile for
  one AWS user by another, followed by a console login from the same source IP. It
  uses AWS CloudTrail logs to correlate the `CreateLoginProfile` and `ConsoleLogin`
  events based on the source IP and user identity. This activity is significant as
  it may indicate privilege escalation, where an attacker creates a new login profile
  to gain unauthorized access. If confirmed malicious, this could allow the attacker
  to escalate privileges and maintain persistent access to the AWS environment.
required_fields:
- _time
- eventName
- userAgent
- errorCode
- requestParameters.userName
rule: sourcetype=aws:cloudtrail eventName = CreateLoginProfile | rename requestParameters.userName
  as new_login_profile | table src_ip eventName new_login_profile userIdentity.userName  |
  join new_login_profile src_ip [| search sourcetype=aws:cloudtrail eventName = ConsoleLogin
  | rename userIdentity.userName  as new_login_profile | stats count values(eventName)
  min(_time) as firstTime max(_time) as lastTime by eventSource aws_account_id errorCode
  userAgent eventID awsRegion userIdentity.principalId user_arn new_login_profile
  src_ip | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)] | `aws_createloginprofile_filter`
