description: The following analytic identifies specific SAML access events by a service
  provider, user, and targeted principal within AWS. It leverages AWS CloudTrail logs
  to detect the `AssumeRoleWithSAML` event, analyzing fields such as `principalArn`,
  `roleArn`, and `roleSessionName`. This activity is significant as it can indicate
  abnormal access patterns or potential credential hijacking, especially in federated
  environments using the SAML protocol. If confirmed malicious, this could allow attackers
  to assume roles and gain unauthorized access to sensitive AWS resources, leading
  to data breaches or further exploitation.
required_fields:
- _time
- eventName
- requestParameters.principalArn
- requestParameters.roleArn
- requestParameters.roleSessionName
- recipientAccountId
- responseElements.issuer
- sourceIPAddress
- userAgent
rule: sourcetype=aws:cloudtrail eventName=Assumerolewithsaml | stats count min(_time)
  as firstTime max(_time) as lastTime by eventName requestParameters.principalArn
  requestParameters.roleArn requestParameters.roleSessionName recipientAccountId responseElements.issuer
  sourceIPAddress userAgent | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)|
  convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) |`aws_saml_access_by_provider_user_and_principal_filter`
