description: The following analytic detects an AWS account experiencing more than
  20 failed authentication attempts within a 5-minute window. It leverages AWS CloudTrail
  logs to identify multiple failed ConsoleLogin events. This behavior is significant
  as it may indicate a brute force attack targeting the account. If confirmed malicious,
  the attacker could potentially gain unauthorized access, leading to data breaches
  or further exploitation of the AWS environment. Security teams should consider adjusting
  the threshold based on their specific environment to reduce false positives.
required_fields:
- _time
- eventName
- userAgent
- errorCode
- requestParameters.userName
- eventSource
- user_arn
- aws_account_id
- src_ip
rule: sourcetype=aws:cloudtrail eventName=ConsoleLogin action=failure | bucket span=10m
  _time | stats dc(_raw) AS failed_attempts values(src_ip) as src_ip values(user_agent)
  by _time, user_name, eventName, eventSource aws_account_id | where failed_attempts
  > 20 | `aws_high_number_of_failed_authentications_for_user_filter`
