description: The following analytic detects the upload of a new container image to
  AWS Elastic Container Registry (ECR) by an unknown user. It leverages AWS CloudTrail
  logs to identify `PutImage` events from the ECR service, filtering out known users.
  This activity is significant because container uploads should typically be performed
  by a limited set of authorized users. If confirmed malicious, this could indicate
  unauthorized access, potentially leading to the deployment of malicious containers,
  data exfiltration, or further compromise of the AWS environment.
required_fields:
- eventSource
- eventName
- awsRegion
- requestParameters.imageTag
- requestParameters.registryId
- requestParameters.repositoryName
- user
- userName
- src_ip
rule: sourcetype=aws:cloudtrail eventSource=ecr.amazonaws.com eventName=PutImage NOT
  userName IN (user) | rename requestParameters.* as * | rename repositoryName AS
  image | eval phase="release" | eval severity="high" | stats min(_time) as firstTime
  max(_time) as lastTime by awsRegion, eventName, eventSource, user, userName, src_ip,
  imageTag, registryId, image, phase, severity | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `aws_ecr_container_upload_unknown_user_filter`
