description: The following analytic detects an AWS account successfully authenticating
  from multiple unique IP addresses within a 5-minute window. It leverages AWS CloudTrail
  logs, specifically monitoring `ConsoleLogin` events and counting distinct source
  IPs. This behavior is significant as it may indicate compromised credentials, potentially
  from a phishing attack, being used concurrently by an adversary and a legitimate
  user. If confirmed malicious, this activity could allow unauthorized access to corporate
  resources, leading to data breaches or further exploitation within the AWS environment.
required_fields:
- _time
- eventName
- userAgent
- src_ip
- user_arn
rule: sourcetype=aws:cloudtrail eventName = ConsoleLogin | bin span=5m _time | stats
  values(userAgent) as userAgent values(eventName) as eventName values(src_ip) as
  src_ip dc(src_ip) as distinct_ip_count by _time user_arn | where distinct_ip_count>1
  | `aws_successful_console_authentication_from_multiple_ips_filter`
