description: The following analytic identifies the creation of AWS IAM access keys
  by a user for another user, which can indicate privilege escalation. It leverages
  AWS CloudTrail logs to detect instances where the user creating the access key is
  different from the user for whom the key is created. This activity is significant
  because unauthorized access key creation can allow attackers to establish persistence
  or exfiltrate data via AWS APIs. If confirmed malicious, this could lead to unauthorized
  access to AWS services, data exfiltration, and long-term persistence in the environment.
required_fields:
- _time
- eventName
- userAgent
- errorCode
- requestParameters.userName
rule: sourcetype=aws:cloudtrail eventName = CreateAccessKey userAgent !=console.amazonaws.com
  errorCode = success | eval match=if(match(userIdentity.userName,requestParameters.userName),1,0)
  | search match=0 | stats count min(_time) as firstTime max(_time) as lastTime by
  requestParameters.userName src eventName eventSource aws_account_id errorCode userAgent
  eventID awsRegion userIdentity.principalId user_arn | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) |`aws_createaccesskey_filter`
