description: The following analytic detects an IP address with 20 or more failed authentication
  attempts to the AWS Web Console within a 5-minute window. This detection leverages
  CloudTrail logs, aggregating failed login events by IP address and time span. This
  activity is significant as it may indicate a brute force attack aimed at gaining
  unauthorized access or escalating privileges within an AWS environment. If confirmed
  malicious, this could lead to unauthorized access, data breaches, or further exploitation
  of AWS resources.
required_fields:
- _time
- user
- action
- eventName
- src_ip
rule: sourcetype=aws:cloudtrail eventName=ConsoleLogin action=failure | bucket span=5m
  _time | stats dc(_raw) AS failed_attempts values(user_name) as tried_accounts values(user_agent)
  by _time, src_ip, eventName, eventSource aws_account_id | where failed_attempts
  > 20 |  `aws_high_number_of_failed_authentications_from_ip_filter`
