description: The following analytic detects an Azure AD account with concurrent sessions
  originating from multiple unique IP addresses within a 5-minute window. It leverages
  Azure Active Directory NonInteractiveUserSignInLogs to identify this behavior by
  analyzing successful authentication events and counting distinct source IPs. This
  activity is significant as it may indicate session hijacking, where an attacker
  uses stolen session cookies to access corporate resources from a different location.
  If confirmed malicious, this could lead to unauthorized access to sensitive information
  and potential data breaches.
required_fields:
- _time
- properties.status.errorCode
- category
- properties.authenticationDetails
- user
- src_ip
rule: sourcetype=azure:monitor:aad properties.authenticationDetails{}.succeeded=true
  category=NonInteractiveUserSignInLogs action=success | rename properties.* as *
  | bucket span=5m _time | stats count min(_time) as firstTime max(_time) as lastTime
  dc(src_ip) AS unique_ips dc(location.city) as dc_city values(location.city) as city
  values(src_ip) as src_ip values(appDisplayName) as appDisplayName values(location.countryOrRegion)
  by user _time | where unique_ips > 1 | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `azure_ad_concurrent_sessions_from_different_ips_filter`
