description: The following analytic detects the creation of a new Azure Automation
  Runbook within an Azure tenant. It leverages Azure Audit events, specifically the
  Azure Activity log category, to identify when a new Runbook is created or updated.
  This activity is significant because adversaries with privileged access can use
  Runbooks to maintain persistence, escalate privileges, or execute malicious code.
  If confirmed malicious, this could lead to unauthorized actions such as creating
  Global Administrators, executing code on VMs, and compromising the entire Azure
  environment.
required_fields:
- _time
- operationName.localizedValue
- status.value
- object
- caller
- claims.ipaddr
- resourceGroupName
- object_path
rule: sourcetype=mscs:azure:audit operationName.localizedValue="Create or Update an
  Azure Automation Runbook" object!=AzureAutomationTutorial* status.value=Succeeded
  | dedup object | rename claims.ipaddr as src_ip | rename caller as user | stats
  count min(_time) as firstTime max(_time) as lastTime by object user, src_ip, resourceGroupName,
  object_path | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `azure_automation_runbook_created_filter`
