description: The following analytic detects the addition of new credentials to Service
  Principals and Applications in Azure AD. It leverages Azure AD AuditLogs, specifically
  monitoring the "Update application*Certificates and secrets management" operation.
  This activity is significant as it may indicate an adversary attempting to maintain
  persistent access or escalate privileges within the Azure environment. If confirmed
  malicious, attackers could use these new credentials to log in as the service principal,
  potentially compromising sensitive accounts and resources, leading to unauthorized
  access and control over the Azure environment.
required_fields:
- _time
- category
- operationName
- user
- properties.targetResources{}.displayName
- properties.targetResources{}.modifiedProperties{}.newValue
- src_ip
rule: sourcetype=azure:monitor:aad  category=AuditLogs operationName="Update application*Certificates
  and secrets management " | rename properties.* as * | rename  targetResources{}.*
  as * | stats count min(_time) as firstTime max(_time) as lastTime values(displayName)
  as displayName by user, modifiedProperties{}.newValue, src_ip | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `azure_ad_service_principal_new_client_credentials_filter`
