description: The following analytic detects potential distributed password spraying
  attacks in an Azure AD environment. It identifies a spike in failed authentication
  attempts across various user-and-IP combinations from multiple source IPs and countries,
  using different user agents. This detection leverages Azure AD SignInLogs, focusing
  on error code 50126 for failed authentications. This activity is significant as
  it indicates an adversary's attempt to bypass security controls by distributing
  login attempts. If confirmed malicious, this could lead to unauthorized access,
  data breaches, privilege escalation, and lateral movement within the organization's
  infrastructure.
required_fields:
- _time
- category
- properties.authenticationDetails{}.succeeded
- properties.location.countryOrRegion
- user_agent
- src_ip
- user
rule: sourcetype=azure:monitor:aad category=SignInLogs properties.status.errorCode=50126
  properties.authenticationDetails{}.succeeded=false | rename properties.* as * |
  bucket span=5m _time | eval uniqueIPUserCombo = src_ip . "-" . user | stats count
  min(_time) as firstTime max(_time) as lastTime dc(uniqueIPUserCombo) as uniqueIpUserCombinations,
  dc(user) as uniqueUsers, dc(src_ip) as uniqueIPs, dc(user_agent) as uniqueUserAgents,
  dc(location.countryOrRegion) as uniqueCountries values(user) as user, values(src_ip)
  as ips, values(user_agent) as user_agents, values(location.countryOrRegion) as countries
  | where uniqueIpUserCombinations > 20 AND uniqueUsers > 20 AND uniqueIPs > 20 AND
  uniqueUserAgents = 1 | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `azure_ad_multi_source_failed_authentications_spike_filter`
