description: The following analytic identifies an Azure AD account experiencing more
  than 20 failed authentication attempts within a 10-minute window. This detection
  leverages Azure SignInLogs data, specifically monitoring for error code 50126 and
  unsuccessful authentication attempts. This behavior is significant as it may indicate
  a brute force attack targeting the account. If confirmed malicious, an attacker
  could potentially gain unauthorized access, leading to data breaches or further
  exploitation within the environment. Security teams should adjust the threshold
  based on their specific environment to reduce false positives.
required_fields:
- _time
- properties.status.errorCode
- category
- properties.authenticationDetails
- user
- properties.ipAddress
rule: sourcetype=azure:monitor:aad category= SignInLogs properties.status.errorCode=50126
  properties.authenticationDetails{}.succeeded=false | rename properties.* as * |
  bucket span=10m _time | stats count min(_time) as firstTime max(_time) as lastTime
  values(src_ip) as src_ip by user | where count > 20 | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `azure_ad_high_number_of_failed_authentications_for_user_filter`
