description: The following analytic detects a single source IP failing to authenticate
  with 30 unique valid users within 5 minutes in Azure Active Directory. It leverages
  Azure AD SignInLogs with error code 50126, indicating invalid passwords. This behavior
  is significant as it may indicate a Password Spraying attack, where an adversary
  attempts to gain initial access or elevate privileges by trying common passwords
  across many accounts. If confirmed malicious, this activity could lead to unauthorized
  access, data breaches, or privilege escalation within the Azure AD environment.
required_fields:
- _time
- properties.status.errorCode
- category
- properties.authenticationDetails
- user
- user_agent
rule: sourcetype=azure:monitor:aad  category=SignInLogs properties.status.errorCode=50126
  properties.authenticationDetails{}.succeeded=false | rename properties.* as * |
  bucket span=5m _time | stats count min(_time) as firstTime max(_time) as lastTime
  dc(user) AS unique_accounts values(user) as user by src_ip | where unique_accounts
  > 30 | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `azure_ad_multiple_users_failing_to_authenticate_from_ip_filter`
