description: The following analytic identifies authentication events of service principals
  in Azure Active Directory. It leverages the `azure_monitor_aad` data source, specifically
  targeting "Sign-in activity" within ServicePrincipalSignInLogs. This detection gathers
  details such as sign-in frequency, timing, source IPs, and accessed resources. Monitoring
  these events is significant for SOC teams to distinguish between normal application
  authentication and potential anomalies, which could indicate compromised credentials
  or malicious activities. If confirmed malicious, attackers could gain unauthorized
  access to resources, leading to data breaches or further exploitation within the
  environment.
required_fields:
- _time
- operationName
- category
- properties.resourceDisplayName
- properties.resourceId
- user
- src_ip
- user_id
rule: sourcetype=azure:monitor:aad operationName="Sign-in activity" category=ServicePrincipalSignInLogs
  | rename properties.* as * | stats count earliest(_time) as firstTime latest(_time)
  as lastTime by user, user_id, src_ip, resourceDisplayName, resourceId | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `azure_ad_service_principal_authentication_filter`
