description: The following analytic identifies Azure Device Code Phishing attacks,
  which can lead to Azure Account Take-Over (ATO). It leverages Azure AD SignInLogs
  to detect suspicious authentication requests using the device code authentication
  protocol. This activity is significant as it indicates potential bypassing of Multi-Factor
  Authentication (MFA) and Conditional Access Policies (CAPs) through phishing emails.
  If confirmed malicious, attackers could gain unauthorized access to Azure AD, Exchange
  mailboxes, and Outlook Web Application (OWA), leading to potential data breaches
  and unauthorized data access.
required_fields:
- _time
- category
- user
- properties.authenticationProtocol
- properties.ipAddress
- properties.status.additionalDetails
- properties.appDisplayName
- properties.userAgent
rule: sourcetype=azure:monitor:aad category=SignInLogs "properties.authenticationProtocol"=deviceCode
  | rename properties.* as * | stats count min(_time) as firstTime max(_time) as lastTime
  by user src_ip, appDisplayName, userAgent | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `azure_ad_device_code_authentication_filter`
