description: The following analytic identifies cloud instances being modified by users
  who have not previously modified them. It leverages data from the Change data model,
  focusing on successful modifications of EC2 instances. This activity is significant
  because it can indicate unauthorized or suspicious changes by potentially compromised
  or malicious users. If confirmed malicious, this could lead to unauthorized access,
  configuration changes, or potential disruption of cloud services, posing a significant
  risk to the organization's cloud infrastructure.
required_fields:
- _time
- All_Changes.object_id
- All_Changes.command
- All_Changes.action
- All_Changes.change_type
- All_Changes.status
- All_Changes.user
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count earliest(_time) as firstTime, latest(_time)
  as lastTime values(All_Changes.object_id) as object_id values(All_Changes.command)
  as command from datamodel=Change where All_Changes.action=modified All_Changes.change_type=EC2
  All_Changes.status=success by All_Changes.user | `drop_dm_object_name("All_Changes")`
  | lookup previously_seen_cloud_instance_modifications_by_user user as user OUTPUTNEW
  firstTimeSeen, enough_data | eventstats max(enough_data) as enough_data | where
  enough_data=1 | eval firstTimeSeenUser=min(firstTimeSeen) | where isnull(firstTimeSeenUser)
  OR firstTimeSeenUser > relative_time(now(), "-24h@h") | table firstTime user command
  object_id count | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `cloud_instance_modified_by_previously_unseen_user_filter`'
