description: The following analytic detects cloud provisioning activities originating
  from previously unseen cities. It leverages cloud infrastructure logs and compares
  the geographic location of the source IP address against a baseline of known locations.
  This activity is significant as it may indicate unauthorized access or misuse of
  cloud resources from an unexpected location. If confirmed malicious, this could
  lead to unauthorized resource creation, potential data exfiltration, or further
  compromise of cloud infrastructure.
required_fields:
- _time
- All_Changes.action
- All_Changes.status
- All_Changes.src
- All_Changes.user
- All_Changes.object
- All_Changes.command
rule: '| tstats earliest(_time) as firstTime, latest(_time) as lastTime from datamodel=Change
  where (All_Changes.action=started OR All_Changes.action=created) All_Changes.status=success
  by All_Changes.src, All_Changes.user, All_Changes.object, All_Changes.command |
  `drop_dm_object_name("All_Changes")` | iplocation src | where isnotnull(City) |
  lookup previously_seen_cloud_provisioning_activity_sources City as City OUTPUT firstTimeSeen,
  enough_data | eventstats max(enough_data) as enough_data | where enough_data=1 |
  eval firstTimeSeenCity=min(firstTimeSeen) | where isnull(firstTimeSeenCity) OR firstTimeSeenCity
  > relative_time(now(), "-70m@m") | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | table firstTime, src, City, user, object, command | `cloud_provisioning_activity_from_previously_unseen_city_filter`'
