description: The following analytic detects cloud provisioning activities originating
  from previously unseen countries. It leverages cloud infrastructure logs and compares
  the geographic location of the source IP address against a baseline of known locations.
  This activity is significant as it may indicate unauthorized access or potential
  compromise of cloud resources. If confirmed malicious, an attacker could gain control
  over cloud assets, leading to data breaches, service disruptions, or further infiltration
  into the network.
required_fields:
- _time
- All_Changes.action
- All_Changes.status
- All_Changes.src
- All_Changes.user
- All_Changes.object
- All_Changes.command
rule: '| tstats earliest(_time) as firstTime, latest(_time) as lastTime from datamodel=Change
  where (All_Changes.action=started OR All_Changes.action=created) All_Changes.status=success
  by All_Changes.src, All_Changes.user, All_Changes.object, All_Changes.command |
  `drop_dm_object_name("All_Changes")` | iplocation src | where isnotnull(Country)
  | lookup previously_seen_cloud_provisioning_activity_sources Country as Country
  OUTPUT firstTimeSeen, enough_data | eventstats max(enough_data) as enough_data |
  where enough_data=1 | eval firstTimeSeenCountry=min(firstTimeSeen) | where isnull(firstTimeSeenCountry)
  OR firstTimeSeenCountry > relative_time(now(), "-24h@h") | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | table firstTime, src, Country, user, object, command | `cloud_provisioning_activity_from_previously_unseen_country_filter`'
