description: The following analytic detects cloud provisioning activities originating
  from previously unseen regions. It leverages cloud infrastructure logs to identify
  events where resources are started or created, and cross-references these with a
  baseline of known regions. This activity is significant as it may indicate unauthorized
  access or misuse of cloud resources from unfamiliar locations. If confirmed malicious,
  this could lead to unauthorized resource creation, potential data exfiltration,
  or further compromise of cloud infrastructure.
required_fields:
- _time
- All_Changes.action
- All_Changes.status
- All_Changes.src
- All_Changes.user
- All_Changes.object
- All_Changes.command
rule: '| tstats earliest(_time) as firstTime, latest(_time) as lastTime from datamodel=Change
  where (All_Changes.action=started OR All_Changes.action=created) All_Changes.status=success
  by All_Changes.src, All_Changes.user, All_Changes.object, All_Changes.command |
  `drop_dm_object_name("All_Changes")` | iplocation src | where isnotnull(Region)
  | lookup previously_seen_cloud_provisioning_activity_sources Region as Region OUTPUT
  firstTimeSeen, enough_data | eventstats max(enough_data) as enough_data | where
  enough_data=1 | eval firstTimeSeenRegion=min(firstTimeSeen) | where isnull(firstTimeSeenRegion)
  OR firstTimeSeenRegion > relative_time(now(), "-70m@m") | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | table firstTime, src, Region, user, object, command | `cloud_provisioning_activity_from_previously_unseen_region_filter`'
