description: The following analytic detects cloud API calls executed by user roles
  that have not previously run these commands. It leverages the Change data model
  in Splunk to identify commands executed by users with the user_type of AssumedRole
  and a status of success. This activity is significant because new commands from
  different user roles can indicate potential malicious activity or unauthorized actions.
  If confirmed malicious, this behavior could lead to unauthorized access, data breaches,
  or other damaging outcomes by exploiting new or unmonitored commands within the
  cloud environment.
required_fields:
- _time
- All_Changes.user
- All_Changes.user_type
- All_Changes.status
- All_Changes.command
- All_Changes.object
rule: '| tstats earliest(_time) as firstTime, latest(_time) as lastTime from datamodel=Change
  where All_Changes.user_type=AssumedRole AND All_Changes.status=success by All_Changes.user,
  All_Changes.command All_Changes.object | `drop_dm_object_name("All_Changes")` |
  lookup previously_seen_cloud_api_calls_per_user_role user as user, command as command
  OUTPUT firstTimeSeen, enough_data | eventstats max(enough_data) as enough_data |
  where enough_data=1 | eval firstTimeSeenUserApiCall=min(firstTimeSeen) | where isnull(firstTimeSeenUserApiCall)
  OR firstTimeSeenUserApiCall > relative_time(now(),"-24h@h") | table firstTime, user,
  object, command |convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| `cloud_api_calls_from_previously_unseen_user_roles_filter`'
