description: The following analytic identifies AWS console login attempts by users
  from a new region. It leverages AWS CloudTrail events and compares current login
  regions against a baseline of previously seen regions for each user. This activity
  is significant as it may indicate unauthorized access attempts or compromised credentials.
  If confirmed malicious, an attacker could gain unauthorized access to AWS resources,
  potentially leading to data breaches, resource manipulation, or further lateral
  movement within the cloud environment.
required_fields:
- _time
- Authentication.signature
- Authentication.user
- Authentication.src
rule: '| tstats earliest(_time) as firstTime latest(_time) as lastTime from datamodel=Authentication
  where Authentication.signature=ConsoleLogin by Authentication.user Authentication.src
  | iplocation Authentication.src | `drop_dm_object_name(Authentication)` | rename
  Region as justSeenRegion | table firstTime lastTime user justSeenRegion | join user
  type=outer [| inputlookup previously_seen_users_console_logins | rename Region as
  previouslySeenRegion | stats min(firstTime) AS earliestseen by user previouslySeenRegion
  | fields earliestseen user previouslySeenRegion] | eval userRegion=if(firstTime
  >= relative_time(now(), "-24h@h"), "New Region","Previously Seen Region") | where
  userRegion= "New Region" | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | table firstTime lastTime
  user previouslySeenRegion justSeenRegion userRegion | `detect_aws_console_login_by_user_from_new_region_filter`'
