description: The following analytic identifies AWS console login events by users from
  a new city within the last hour. It leverages AWS CloudTrail events and compares
  them against a lookup file of previously seen user locations. This activity is significant
  for a SOC as it may indicate unauthorized access or credential compromise, especially
  if the login originates from an unusual location. If confirmed malicious, this could
  lead to unauthorized access to AWS resources, data exfiltration, or further exploitation
  within the cloud environment.
required_fields:
- _time
- Authentication.signature
- Authentication.user
- Authentication.src
rule: '| tstats earliest(_time) as firstTime latest(_time) as lastTime from datamodel=Authentication
  where Authentication.signature=ConsoleLogin by Authentication.user Authentication.src
  | iplocation Authentication.src | `drop_dm_object_name(Authentication)` | rename
  City as justSeenCity | table firstTime lastTime user justSeenCity | join user type=outer
  [| inputlookup previously_seen_users_console_logins | rename City as previouslySeenCity
  | stats min(firstTime) AS earliestseen by user previouslySeenCity | fields earliestseen
  user previouslySeenCity] | eval userCity=if(firstTime >= relative_time(now(), "-24h@h"),
  "New City","Previously Seen City") | where userCity = "New City" | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | table firstTime
  lastTime user previouslySeenCity justSeenCity userCity | `detect_aws_console_login_by_user_from_new_city_filter`'
