description: The following analytic detects the creation of open/public S3 buckets
  via the AWS CLI. It leverages AWS CloudTrail logs to identify events where a user
  has set bucket permissions to allow access to "AuthenticatedUsers" or "AllUsers."
  This activity is significant because open S3 buckets can expose sensitive data to
  unauthorized users, leading to data breaches. If confirmed malicious, an attacker
  could gain unauthorized access to potentially sensitive information stored in the
  S3 bucket, posing a significant security risk.
required_fields:
- _time
- eventSource
- eventName
- requestParameters.accessControlList.x-amz-grant-read-acp
- requestParameters.accessControlList.x-amz-grant-write
- requestParameters.accessControlList.x-amz-grant-write-acp
- requestParameters.accessControlList.x-amz-grant-full-control
- requestParameters.bucketName
- userIdentity.userName
- userIdentity.principalId
- userAgent
- bucketName
rule: sourcetype=aws:cloudtrail eventSource="s3.amazonaws.com" (userAgent="[aws-cli*"
  OR userAgent=aws-cli* ) eventName=PutBucketAcl OR requestParameters.accessControlList.x-amz-grant-read-acp
  IN ("*AuthenticatedUsers","*AllUsers") OR requestParameters.accessControlList.x-amz-grant-write
  IN ("*AuthenticatedUsers","*AllUsers") OR requestParameters.accessControlList.x-amz-grant-write-acp
  IN ("*AuthenticatedUsers","*AllUsers") OR requestParameters.accessControlList.x-amz-grant-full-control
  IN ("*AuthenticatedUsers","*AllUsers") | rename requestParameters.bucketName AS
  bucketName | fillnull | stats count min(_time) as firstTime max(_time) as lastTime
  by userIdentity.userName userIdentity.principalId userAgent bucketName requestParameters.accessControlList.x-amz-grant-read
  requestParameters.accessControlList.x-amz-grant-read-acp requestParameters.accessControlList.x-amz-grant-write
  requestParameters.accessControlList.x-amz-grant-write-acp requestParameters.accessControlList.x-amz-grant-full-control
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `detect_new_open_s3_buckets_over_aws_cli_filter`
