description: The following analytic identifies access to an S3 bucket from a new or
  previously unseen remote IP address. It leverages S3 bucket-access logs, specifically
  focusing on successful access events (http_status=200). This activity is significant
  because access from unfamiliar IP addresses could indicate unauthorized access or
  potential data exfiltration attempts. If confirmed malicious, this activity could
  lead to unauthorized data access, data theft, or further exploitation of the compromised
  S3 bucket, posing a significant risk to sensitive information stored within the
  bucket.
required_fields:
- _time
- http_status
- bucket_name
- remote_ip
rule: sourcetype=aws:s3:accesslogs http_status=200  [search sourcetype=aws:s3:accesslogs
  http_status=200 | stats earliest(_time) as firstTime latest(_time) as lastTime by
  bucket_name remote_ip | inputlookup append=t previously_seen_S3_access_from_remote_ip
  | stats min(firstTime) as firstTime, max(lastTime) as lastTime by bucket_name remote_ip
  | outputlookup previously_seen_S3_access_from_remote_ip| eval newIP=if(firstTime
  >= relative_time(now(), "-70m@m"), 1, 0) | where newIP=1 | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | table bucket_name
  remote_ip]| iplocation remote_ip |rename remote_ip as src_ip | table _time bucket_name
  src_ip City Country operation request_uri | `detect_s3_access_from_a_new_ip_filter`
