description: The following analytic identifies AWS console login events by users from
  a new country. It leverages AWS CloudTrail events and compares them against a lookup
  file of previously seen users and their login locations. This activity is significant
  because logins from new countries can indicate potential unauthorized access or
  compromised accounts. If confirmed malicious, this could lead to unauthorized access
  to AWS resources, data exfiltration, or further exploitation within the AWS environment.
required_fields:
- _time
- Authentication.signature
- Authentication.user
- Authentication.src
rule: '| tstats earliest(_time) as firstTime latest(_time) as lastTime from datamodel=Authentication
  where Authentication.signature=ConsoleLogin by Authentication.user Authentication.src
  | iplocation Authentication.src | `drop_dm_object_name(Authentication)` | rename
  Country as justSeenCountry | table firstTime lastTime user justSeenCountry | join
  user type=outer [| inputlookup previously_seen_users_console_logins | rename Country
  as previouslySeenCountry | stats min(firstTime) AS earliestseen by user previouslySeenCountry
  | fields earliestseen user previouslySeenCountry] | eval userCountry=if(firstTime
  >= relative_time(now(), "-24h@h"), "New Country","Previously Seen Country") | where
  userCountry = "New Country" | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | table firstTime lastTime
  user previouslySeenCountry justSeenCountry userCountry | `detect_aws_console_login_by_user_from_new_country_filter`'
