description: The following analytic detects failed authentication attempts during
  the Multi-Factor Authentication (MFA) challenge on a Google Cloud Platform (GCP)
  tenant. It uses Google Workspace login failure events to identify instances where
  MFA methods were challenged but not successfully completed. This activity is significant
  as it may indicate an adversary attempting to access an account with compromised
  credentials despite MFA protection. If confirmed malicious, this could lead to unauthorized
  access attempts, potentially compromising sensitive data and resources within the
  GCP environment.
required_fields:
- _time
- user
- src_ip
- login_challenge_method
- event.parameters{}.multiValue{}
rule: sourcetype=gws:reports:login event.name=login_failure event.parameters{}.multiValue{}
  IN ("backup_code", "google_authenticator", "google_prompt", "idv_any_phone", "idv_preregistered_phone",
  "internal_two_factor", "knowledge_employee_id", "knowledge_preregistered_email",
  "login_location", "knowledge_preregistered_phone", "offline_otp", "security_key",
  "security_key_otp") | stats count min(_time) as firstTime max(_time) as lastTime
  by user, src_ip, login_challenge_method | `gcp_authentication_failed_during_mfa_challenge_filter`
