description: The following analytic identifies a successful single-factor authentication
  event against Google Cloud Platform (GCP) for an account without Multi-Factor Authentication
  (MFA) enabled. It uses Google Workspace login event data to detect instances where
  MFA is not utilized. This activity is significant as it may indicate a misconfiguration,
  policy violation, or potential account takeover attempt. If confirmed malicious,
  an attacker could gain unauthorized access to GCP resources, potentially leading
  to data breaches, service disruptions, or further exploitation within the cloud
  environment.
required_fields:
- _time
- event.name
- event.parameters{}.multiValue{}
- user
- src_ip
- login_challenge_method
rule: sourcetype=gws:reports:login event.name=login_success NOT event.parameters{}.multiValue{}
  IN ("backup_code", "google_authenticator", "google_prompt", "idv_any_phone", "idv_preregistered_phone",
  "internal_two_factor", "knowledge_employee_id", "knowledge_preregistered_email",
  "login_location", "knowledge_preregistered_phone", "offline_otp", "security_key",
  "security_key_otp") | stats count min(_time) as firstTime max(_time) as lastTime
  by user, src_ip,  login_challenge_method, app, event.name, vendor_account, action
  |convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)| `gcp_successful_single_factor_authentication_filter`
