description: The following analytic detects multiple failed login attempts in Office365
  Azure Active Directory from a single source IP address. It leverages Office365 management
  activity logs, specifically AzureActiveDirectoryStsLogon records, aggregating these
  logs in 5-minute intervals to count failed login attempts. This activity is significant
  as it may indicate brute-force attacks or password spraying, which are critical
  to monitor. If confirmed malicious, an attacker could gain unauthorized access to
  Office365 accounts, leading to potential data breaches, lateral movement within
  the organization, or further malicious activities using the compromised account.
required_fields:
- _time
- Operation
- record_type
- app
- user
- LogonError
- authentication_method
- signature
- UserAgent
- src_ip
- record_type
rule: sourcetype=o365:management:activity Workload=AzureActiveDirectory Operation=UserLoginFailed
  record_type=AzureActiveDirectoryStsLogon | bucket span=5m _time | stats dc(_raw)
  AS failed_attempts values(user) as user values(LogonError) as LogonError values(signature)
  as signature values(UserAgent) as UserAgent by _time, src_ip | where failed_attempts
  > 10 | `high_number_of_login_failures_from_a_single_source_filter`
