description: The following analytic detects potential privilege escalation threats
  in Azure Active Directory (AD). This detection is important because it identifies
  instances where privileged roles that hold elevated permissions are assigned to
  service principals. This prevents unauthorized access or malicious activities, which
  occur when these non-human entities access Azure resources to exploit them. False
  positives might occur since administrators can legitimately assign privileged roles
  to service principals. This detection leverages the O365 Universal Audit Log data
  source.
required_fields:
- _time
- Operation
- ModifiedProperties{}.NewValue
- ModifiedProperties{}.Name
- UserId
- ObjectId
- Workload
rule: sourcetype=o365:management:activity Workload=AzureActiveDirectory Operation
  IN ("Add member to role.","Add eligible member to role.") | eval user = ObjectId,
  src_user = case(match(mvindex('Actor{}.ID',-1),"User"),mvindex('Actor{}.ID',0),match(mvindex('Actor{}.ID',-1),"ServicePrincipal"),mvindex('Actor{}.ID',3),true(),mvindex('Actor{}.ID',0)),
  object_name = mvindex('ModifiedProperties{}.NewValue', mvfind('ModifiedProperties{}.Name',"Role\.DisplayName")),
  object_id = mvindex('ModifiedProperties{}.NewValue', mvfind('ModifiedProperties{}.Name',"Role\.TemplateId")),
  signature = Operation, result = ResultStatus, category = mvindex('Target{}.ID',2)
  | stats count, min(_time) as firstTime, max(_time) as lastTime by src_user, user,
  category, result, object_name, object_id, signature | lookup privileged_azure_ad_roles
  azuretemplateid as object_id OUTPUT isprvilegedadrole | search isprvilegedadrole="TRUE"
  category!="User" | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)  | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `o365_privileged_role_assigned_to_service_principal_filter`
