description: The following analytic identifies a spike in failed authentication attempts
  within an Office 365 environment, indicative of a potential distributed password
  spraying attack. It leverages UserLoginFailed events from O365 Management Activity
  logs, focusing on ErrorNumber 50126. This detection is significant as it highlights
  attempts to bypass security controls using multiple IP addresses and user agents.
  If confirmed malicious, this activity could lead to unauthorized access, data breaches,
  privilege escalation, and lateral movement within the organization. Early detection
  is crucial to prevent account takeovers and mitigate subsequent threats.
required_fields:
- _time
- Workload
- Operation
- ErrorNumber
- user
- src_ip
- user_agent
rule: sourcetype=o365:management:activity Workload=AzureActiveDirectory Operation=UserLoginFailed
  ErrorNumber=50126 | bucket span=5m _time | eval uniqueIPUserCombo = src_ip . "-"
  . user | stats dc(uniqueIPUserCombo) as uniqueIpUserCombinations, dc(user) as uniqueUsers,
  dc(src_ip) as uniqueIPs, values(user) as user, values(src_ip) as ips, values(user_agent)
  as user_agents by _time | where uniqueIpUserCombinations > 20 AND uniqueUsers >
  20 AND uniqueIPs > 20 | `o365_multi_source_failed_authentications_spike_filter`
