description: The following analytic identifies when the allowed domain settings for
  O365 SharePoint have been changed. With Azure AD B2B collaboration, users and administrators
  can invite external users to collaborate with internal users. External guest account
  invitations may also need access to OneDrive/SharePoint resources. These changed
  should be monitored by security teams as they could potentially lead to unauthorized
  access.
required_fields:
- _time
- Workload
- Operation
- ModifiedProperties{}.Name
- CorrelationId
- ClientIP
- UserId
- ModifiedProperties{}.NewValue
- ModifiedProperties{}.OldValue
rule: sourcetype=o365:management:activity Workload=SharePoint Operation=SharingPolicyChanged
  "ModifiedProperties{}.Name"=AllowDomainList | eval signature_id = CorrelationId,
  signature=Operation, src = ClientIP, user = UserId, object_name='ModifiedProperties{}.Name',
  object_attrs_new = split(replace('ModifiedProperties{}.NewValue',"\.\.\.",""),","),
  object_attrs_old = split(replace('ModifiedProperties{}.OldValue',"\.\.\.",""),",")
  | stats values(object_attrs_new) as object_attrs_new, values(object_attrs_old) as
  object_attrs_old, values(src) as src, count, min(_time) as firstTime, max(_time)
  as lastTime by user,signature,signature_id,object_name | eval diff_add=mvmap(object_attrs_new,if(isnull(mvfind(object_attrs_old,object_attrs_new)),object_attrs_new,null))
  | eval diff_remove=mvmap(object_attrs_old,if(isnull(mvfind(object_attrs_new,object_attrs_old)),object_attrs_old,null))
  | eval result = case(isnotnull(diff_add),"Added ".mvjoin(diff_add,","),isnotnull(diff_remove),"Removed
  ".mvjoin(diff_remove,",")), action = case(isnotnull(diff_add),"created",isnotnull(diff_remove),"deleted")
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)  | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `o365_sharepoint_allowed_domains_policy_changed_filter`
