description: The following analytic identifies potential "MFA fatigue" attacks targeting
  Office 365 users by detecting more than nine Multi-Factor Authentication (MFA) prompts
  within a 10-minute timeframe. It leverages O365 management activity logs, focusing
  on Azure Active Directory events with the UserLoginFailed operation, a Success ResultStatus,
  and an ErrorNumber of 500121. This activity is significant as attackers may exploit
  MFA fatigue to gain unauthorized access by overwhelming users with repeated MFA
  requests. If confirmed malicious, this could lead to data breaches, unauthorized
  data access, or further compromise within the O365 environment. Immediate investigation
  is crucial.
required_fields:
- _time
- Workload
- Operation
- ResultStatus
- ErrorNumber
- user
- LogonError
- signature
rule: sourcetype=o365:management:activity Workload=AzureActiveDirectory Operation=UserLoginFailed
  ResultStatus=Success  ErrorNumber=500121 | bucket span=10m _time | stats  dc(_raw)
  as mfa_prompts values(LogonError) as LogonError values(signature) as signature by
  user, _time | where  mfa_prompts  > 9 | `o365_multiple_failed_mfa_requests_for_user_filter`
