description: The following analytic identifies when cross-tenant access/synchronization
  policies are changed in an Azure tenant. Adversaries have been observed altering
  victim cross-tenant policies as a method of lateral movement or maintaining persistent
  access to compromised environments. These policies should be considered sensitive
  and monitored for changes and/or loose configuration.
required_fields:
- _time
- Operation
- ModifiedProperties{}.NewValue
- ModifiedProperties{}.Name
- UserId
- Workload
rule: sourcetype=o365:management:activity Workload=AzureActiveDirectory Operation
  IN ("Add a partner to cross-tenant access setting.","Delete partner specific cross-tenant
  access setting.") | eval user = case(match(mvindex('Actor{}.ID',-1),"User"),mvindex('Actor{}.ID',0),match(mvindex('Actor{}.ID',-1),"ServicePrincipal"),mvindex('Actor{}.ID',3),true(),mvindex('Actor{}.ID',0))
  | stats values(Workload) as category, values(ClientIP) as src, values(ModifiedProperties{}.Name)
  as object_name, values(ModifiedProperties{}.NewValue) as object_attrs, count, min(_time)
  as firstTime, max(_time) as lastTime by Id,user,Operation | rename Operation as
  signature, Id as signature_id | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)  |
  convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `o365_cross_tenant_access_change_filter`
