description: The following analytic identifies instances where new IP addresses are
  added to the trusted IPs list in Office 365, potentially allowing users from these
  IPs to bypass Multi-Factor Authentication (MFA) during login. It leverages O365
  audit logs, specifically focusing on events related to the modification of trusted
  IP settings. This activity is significant because adding trusted IPs can weaken
  the security posture by bypassing MFA, which is a critical security control. If
  confirmed malicious, this could lead to unauthorized access, compromising sensitive
  information and systems. Immediate investigation is required to validate the legitimacy
  of the IP addition.
required_fields:
- _time
- signature
- ModifiedProperties{}.Name
- ModifiedProperties{}.NewValue
- ModifiedProperties{}.OldValue
- user
- vendor_account
- status
- user_id
- action
rule: sourcetype=o365:management:activity Operation="Set Company Information." ModifiedProperties{}.Name=StrongAuthenticationPolicy
  | rex max_match=100 field=ModifiedProperties{}.NewValue "(?<ip_addresses_new_added>\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}\/\d{1,2})"
  | rex max_match=100 field=ModifiedProperties{}.OldValue "(?<ip_addresses_old>\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}\/\d{1,2})"
  | eval ip_addresses_old=if(isnotnull(ip_addresses_old),ip_addresses_old,"0") | mvexpand
  ip_addresses_new_added | where isnull(mvfind(ip_addresses_old,ip_addresses_new_added))
  |stats count min(_time) as firstTime max(_time) as lastTime values(ip_addresses_old)
  as ip_addresses_old by user ip_addresses_new_added Operation Workload vendor_account
  status user_id action | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| `o365_bypass_mfa_via_trusted_ip_filter`
