description: The following analytic identifies unusual authentication activity in
  an O365 environment, where a single user account experiences more than 8 authentication
  attempts using 3 or more unique application IDs and over 5 unique user agents within
  a short timeframe. It leverages O365 audit logs, focusing on authentication events
  and applying statistical thresholds. This behavior is significant as it may indicate
  an adversary probing for multi-factor authentication weaknesses. If confirmed malicious,
  it suggests a compromised account, potentially leading to unauthorized access, privilege
  escalation, and data exfiltration. Early detection is crucial to prevent further
  exploitation.
required_fields:
- _time
- Workload
- Operation
- ApplicationId
- UserAgent
- OS
rule: sourcetype=o365:management:activity Workload=AzureActiveDirectory (Operation=UserLoggedIn
  OR Operation=UserLoginFailed) | bucket span=5m _time | stats  dc(_raw) as failed_attempts
  dc(ApplicationId) as unique_app_ids dc(UserAgent) as unique_user_agents values(ApplicationId)
  values(OS) by _time user src_ip | where failed_attempts > 5 and unique_user_agents
  > 5 and unique_app_ids > 2 | `o365_multiple_appids_and_useragents_authentication_spike_filter`
