description: The following analytic detects network traffic associated with known
  remote access software applications, such as AnyDesk, GoToMyPC, LogMeIn, and TeamViewer.
  It leverages Palo Alto traffic logs mapped to the Network_Traffic data model in
  Splunk. This activity is significant because adversaries often use remote access
  tools to maintain unauthorized access to compromised environments. If confirmed
  malicious, this activity could allow attackers to control systems remotely, exfiltrate
  data, or deploy additional malware, posing a severe threat to the organization's
  security.
required_fields:
- _time
- All_Traffic.src
- All_Traffic.dest
- All_Traffic.app
- All_Traffic.dest_port
- user
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  values(All_Traffic.dest_port) as dest_port latest(user) as user from datamodel=Network_Traffic
  by All_Traffic.src All_Traffic.dest, All_Traffic.app | `drop_dm_object_name("All_Traffic")`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | lookup remote_access_software remote_appid AS app OUTPUT isutility,
  description as signature, comment_reference as desc, category | search isutility
  = True | eval exception_asset = CASE(isnotnull(src),src,isnotnull(dest),dest) |
  lookup update=true asset_lookup_by_str asset as exception_asset OUTPUTNEW asset
  as asset_temp_field | eval asset_temp_field = CASE(isnull(asset_temp_field),exception_asset,true(),asset_temp_field
  ) | lookup remote_access_software_exceptions asset as asset_temp_field software
  as signature OUTPUT exception as rmm_exception, exception_date as rmm_exception_date,
  exception_ttl_days as rmm_exception_ttl_days, comment as rmm_exception_comment |
  eval rmm_exception = mvdedup(mvfilter(NOT match(rmm_exception,"false"))), rmm_exception_date
  = mvdedup(mvfilter(NOT match(rmm_exception_date,"false"))), rmm_exception_ttl_days
  = mvdedup(mvfilter(NOT match(rmm_exception_ttl_days,"false"))), rmm_exception_comment
  = mvdedup(mvfilter(NOT match(rmm_exception_comment,"false"))), rmm_exception_end_date
  = relative_time(strptime(rmm_exception_date, "%Y-%m-%d"), "+"+rmm_exception_ttl_days+"d"),
  rmm_exception_end = CASE((now() >= rmm_exception_end_date),"TRUE",(now() < rmm_exception_end_date),"FALSE",(match(rmm_exception,"(?i)true")
  AND isnull(rmm_exception_ttl_days)),"UNLIMITED") | search NOT (rmm_exception = TRUE
  AND rmm_exception_end IN ("FALSE","UNLIMITED")) | fields - asset_temp_field,exception_asset
  | `detect_remote_access_software_usage_traffic_filter`'
