description: The following analytic detects outbound SMB (Server Message Block) connections
  from internal hosts to external servers. It identifies this activity by monitoring
  network traffic for SMB requests directed towards the Internet, which are unusual
  for standard operations. This detection is significant for a SOC as it can indicate
  an attacker's attempt to retrieve credential hashes through compromised servers,
  a key step in lateral movement and privilege escalation. If confirmed malicious,
  this activity could lead to unauthorized access to sensitive data and potential
  full system compromise.
required_fields:
- _time
- All_Traffic.action
- All_Traffic.app
- All_Traffic.dest_ip
- All_Traffic.dest_port
- sourcetype
- All_Traffic.src_ip
- All_Traffic.direction
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` earliest(_time) as start_time latest(_time) as
  end_time values(All_Traffic.action) as action values(All_Traffic.app) as app values(sourcetype)
  as sourcetype count from datamodel=Network_Traffic where (All_Traffic.action=allowed
  All_Traffic.dest_port=139 OR All_Traffic.dest_port=445 OR All_Traffic.app="smb")
  AND All_Traffic.src_ip IN ("10.0.0.0/8","172.16.0.0/12","192.168.0.0/16") AND NOT
  All_Traffic.dest_ip IN ("10.0.0.0/8","172.16.0.0/12","192.168.0.0/16","100.64.0.0/10")
  by All_Traffic.src_ip  All_Traffic.dest_ip All_Traffic.dest_port | `drop_dm_object_name("All_Traffic")`  |
  convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)  | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)  | iplocation dest_ip | `detect_outbound_smb_traffic_filter`'
