description: The following analytic identifies outbound ICMP packets with a size larger
  than 1,000 bytes. It leverages the Network_Traffic data model to detect unusually
  large ICMP packets that are not blocked and are destined for external IP addresses.
  This activity is significant because threat actors often use ICMP for command and
  control communication, and large ICMP packets can indicate data exfiltration or
  other malicious activities. If confirmed malicious, this could allow attackers to
  maintain covert communication channels, exfiltrate sensitive data, or further compromise
  the network.
required_fields:
- _time
- All_Traffic.action
- All_Traffic.bytes
- All_Traffic.dest_category
- All_Traffic.protocol
- All_Traffic.transport
- All_Traffic.src_ip
- All_Traffic.dest_ip
rule: "| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`\
  \ fillnull_value=`fillnull_config` count earliest(_time) as firstTime\n  latest(_time)\
  \ as lastTime values(All_Traffic.action) as action values(All_Traffic.bytes) as\
  \ bytes from\n  datamodel=Network_Traffic where All_Traffic.action !=blocked  (All_Traffic.protocol=icmp\
  \ OR All_Traffic.transport=icmp) All_Traffic.bytes\n  > 1000 AND NOT All_Traffic.dest_ip\
  \ IN (\"10.0.0.0/8\",\"172.16.0.0/12\",\"192.168.0.0/16\") by All_Traffic.src_ip\
  \  All_Traffic.dest_ip All_Traffic.protocol\n| `drop_dm_object_name(\"All_Traffic\"\
  )`  | iplocation dest_ip  | convert timeformat=\"%Y-%m-%dT%H:%M:%S\" ctime($field$)\
  \  | convert timeformat=\"%Y-%m-%dT%H:%M:%S\" ctime($field$) | `detect_large_outbound_icmp_packets_filter`"
