description: 'The following analytic detects attempts to exploit the Zerologon CVE-2020-1472
  vulnerability via Zeek RPC. It leverages Zeek DCE-RPC data to identify specific
  operations: NetrServerPasswordSet2, NetrServerReqChallenge, and NetrServerAuthenticate3.
  This activity is significant because it indicates an attempt to gain unauthorized
  access to a domain controller, potentially leading to a complete takeover of an
  organization''s IT infrastructure. If confirmed malicious, the impact could be severe,
  including data theft, ransomware deployment, or other devastating outcomes. Immediate
  investigation of the identified IP addresses and RPC operations is crucial.'
required_fields:
- _time
- operation
rule: index=zeek sourcetype="zeek:rpc:json" operation IN (NetrServerPasswordSet2,NetrServerReqChallenge,NetrServerAuthenticate3)
  | bin span=5m _time | stats values(operation) dc(operation) as opscount count(eval(operation=="NetrServerReqChallenge"))
  as challenge count(eval(operation=="NetrServerAuthenticate3")) as authcount count(eval(operation=="NetrServerPasswordSet2"))
  as passcount count as totalcount by _time,src_ip,dest_ip | search opscount=3 authcount>4
  passcount>0 | search `detect_zerologon_via_zeek_filter`
