description: The following analytic identifies outbound LDAP traffic to external IP
  addresses. It leverages the Network_Traffic data model to detect connections on
  ports 389 or 636 that are not directed to private IP ranges (RFC1918). This activity
  is significant because outbound LDAP traffic can indicate potential data exfiltration
  or unauthorized access attempts. If confirmed malicious, attackers could exploit
  this to access sensitive directory information, leading to data breaches or further
  network compromise.
required_fields:
- _time
- All_Traffic.dest_ip
- All_Traffic.dest_port
- All_Traffic.src_ip
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  values(All_Traffic.dest_ip) as dest_ip from datamodel=Network_Traffic.All_Traffic
  where All_Traffic.dest_port = 389 OR All_Traffic.dest_port = 636 AND NOT (All_Traffic.dest_ip
  = 10.0.0.0/8 OR All_Traffic.dest_ip=192.168.0.0/16 OR All_Traffic.dest_ip = 172.16.0.0/12)
  by All_Traffic.src_ip All_Traffic.dest_ip |`drop_dm_object_name("All_Traffic")`
  | where src_ip != dest_ip | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)  |
  convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) |`detect_outbound_ldap_traffic_filter`'
