description: The following analytic detects DNS queries to domains associated with
  known remote access software such as AnyDesk, GoToMyPC, LogMeIn, and TeamViewer.
  This detection is crucial as adversaries often use these tools to maintain access
  and control over compromised environments. Identifying such behavior is vital for
  a Security Operations Center (SOC) because unauthorized remote access can lead to
  data breaches, ransomware attacks, and other severe impacts if these threats are
  not mitigated promptly.
required_fields:
- _time
- DNS.src
- DNS.query
- DNS.answer
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  values(DNS.answer) as answer from datamodel=Network_Resolution by DNS.src DNS.query
  | `drop_dm_object_name("DNS")` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | lookup remote_access_software
  remote_domain AS query OUTPUT isutility, description as signature, comment_reference
  as desc, category | eval dest = query | search isutility = True | eval exception_asset
  = CASE(isnotnull(src),src,isnotnull(dest),dest) | lookup update=true asset_lookup_by_str
  asset as exception_asset OUTPUTNEW asset as asset_temp_field | eval asset_temp_field
  = CASE(isnull(asset_temp_field),exception_asset,true(),asset_temp_field ) | lookup
  remote_access_software_exceptions asset as asset_temp_field software as signature
  OUTPUT exception as rmm_exception, exception_date as rmm_exception_date, exception_ttl_days
  as rmm_exception_ttl_days, comment as rmm_exception_comment | eval rmm_exception
  = mvdedup(mvfilter(NOT match(rmm_exception,"false"))), rmm_exception_date = mvdedup(mvfilter(NOT
  match(rmm_exception_date,"false"))), rmm_exception_ttl_days = mvdedup(mvfilter(NOT
  match(rmm_exception_ttl_days,"false"))), rmm_exception_comment = mvdedup(mvfilter(NOT
  match(rmm_exception_comment,"false"))), rmm_exception_end_date = relative_time(strptime(rmm_exception_date,
  "%Y-%m-%d"), "+"+rmm_exception_ttl_days+"d"), rmm_exception_end = CASE((now() >=
  rmm_exception_end_date),"TRUE",(now() < rmm_exception_end_date),"FALSE",(match(rmm_exception,"(?i)true")
  AND isnull(rmm_exception_ttl_days)),"UNLIMITED") | search NOT (rmm_exception = TRUE
  AND rmm_exception_end IN ("FALSE","UNLIMITED")) | fields - asset_temp_field,exception_asset
  | `detect_remote_access_software_usage_dns_filter`'
