description: The following analytic detects the presence of SIGRed, a critical DNS
  vulnerability, using Zeek DNS and Zeek Conn data. It identifies specific DNS query
  types (SIG and KEY) and checks for high data transfer within a flow. This detection
  is significant because SIGRed allows attackers to execute remote code on Windows
  DNS servers, potentially leading to unauthorized access and control. If confirmed
  malicious, this activity could result in data exfiltration, service disruption,
  or further network compromise. Immediate investigation and mitigation, such as patching
  or isolating the affected server, are crucial.
required_fields:
- _time
- DNS.query_type
- DNS.flow_id
- All_Traffic.bytes_in
- All_Traffic.flow_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count from datamodel=Network_Resolution where DNS.query_type
  IN (SIG,KEY) by DNS.flow_id | rename DNS.flow_id as flow_id | append [| tstats  summariesonly=`summariesonly_config`
  allow_old_summaries=`oldsummaries_config` fillnull_value=`fillnull_config` count
  from datamodel=Network_Traffic where All_Traffic.bytes_in>65000 by All_Traffic.flow_id
  | rename All_Traffic.flow_id as flow_id] | `detect_windows_dns_sigred_via_zeek_filter`
  | stats count by flow_id | where count>1 | fields - count'
