description: The following analytic identifies Domain Generation Algorithm (DGA) generated
  domains using a pre-trained deep learning model. It leverages the Network Resolution
  data model to analyze domain names and detect unusual character sequences indicative
  of DGA activity. This behavior is significant as adversaries often use DGAs to generate
  numerous domain names for command-and-control servers, making it harder to block
  malicious traffic. If confirmed malicious, this activity could enable attackers
  to maintain persistent communication with compromised systems, evade detection,
  and execute further malicious actions.
required_fields:
- IPs
- src
- domain
- firstTime
- lastTime
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` values(DNS.answer) as IPs min(_time) as firstTime  max(_time)
  as lastTime from datamodel=Network_Resolution by DNS.src, DNS.query | `drop_dm_object_name(DNS)`
  | rename query AS domain | fields IPs, src, domain, firstTime, lastTime | apply
  pretrained_dga_model_dsdl | rename pred_dga_proba AS dga_score | where dga_score>0.5
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)  | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | table src, domain, IPs, firstTime, lastTime, dga_score | `detect_dga_domains_using_pretrained_model_in_dsdl_filter`'
