description: The following analytic identifies the use of SNICat tool commands within
  the TLS SNI field, indicating potential data exfiltration attempts. It leverages
  Zeek SSL data to detect specific SNICat commands such as LIST, LS, SIZE, LD, CB,
  EX, ALIVE, EXIT, WHERE, and finito in the server_name field. This activity is significant
  as SNICat is a known tool for covert data exfiltration using TLS. If confirmed malicious,
  this could allow attackers to exfiltrate sensitive data undetected, posing a severe
  threat to data confidentiality and integrity.
required_fields:
- _time
- server_name
- src_ip
- dest_ip
rule: index=zeek sourcetype="zeek:ssl:json" | rex field=server_name "(?<snicat>(LIST|LS|SIZE|LD|CB|CD|EX|ALIVE|EXIT|WHERE|finito)-[A-Za-z0-9]{16}\.)"
  | stats count by src_ip dest_ip server_name snicat | where count>0 | table src_ip
  dest_ip server_name snicat | `detect_snicat_sni_exfiltration_filter`
