description: The following analytic identifies a large volume of DNS ANY queries,
  which may indicate a DNS amplification attack. It leverages the Network_Resolution
  data model to count DNS queries of type "ANY" directed to specific destinations.
  This activity is significant because DNS amplification attacks can overwhelm network
  resources, leading to Denial of Service (DoS) conditions. If confirmed malicious,
  this activity could disrupt services, degrade network performance, and potentially
  be part of a larger Distributed Denial of Service (DDoS) attack, impacting the availability
  of critical infrastructure.
required_fields:
- _time
- DNS.message_type
- DNS.record_type
- DNS.dest
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count from datamodel=Network_Resolution where nodename=DNS
  "DNS.message_type"="QUERY" "DNS.record_type"="ANY" by "DNS.dest" | `drop_dm_object_name("DNS")`
  | where count>200 | `large_volume_of_dns_any_queries_filter`'
