description: The following analytic detects instances where network traffic, identified
  by port and transport layer protocol as prohibited in the "lookup_interesting_ports"
  table, is allowed. It uses the Network_Traffic data model to cross-reference traffic
  data against predefined security policies. This activity is significant for a SOC
  as it highlights potential misconfigurations or policy violations that could lead
  to unauthorized access or data exfiltration. If confirmed malicious, this could
  allow attackers to bypass network defenses, leading to potential data breaches and
  compromising the organization's security posture.
required_fields:
- _time
- All_Traffic.action
- All_Traffic.src_ip
- All_Traffic.dest_ip
- All_Traffic.dest_port
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Network_Traffic where All_Traffic.action = allowed by All_Traffic.src_ip
  All_Traffic.dest_ip All_Traffic.dest_port All_Traffic.action | lookup update=true
  interesting_ports_lookup dest_port as All_Traffic.dest_port OUTPUT app is_prohibited
  note transport | search is_prohibited=true | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `drop_dm_object_name("All_Traffic")`
  | `prohibited_network_traffic_allowed_filter`'
