description: The following analytic identifies network traffic where the higher layer
  protocol does not match the expected port, such as non-HTTP traffic on TCP port
  80. It leverages data from network traffic inspection technologies like Bro or Palo
  Alto Networks firewalls. This activity is significant because it may indicate attempts
  to bypass firewall restrictions or conceal malicious communications. If confirmed
  malicious, this behavior could allow attackers to evade detection, maintain persistence,
  or exfiltrate data through commonly allowed ports, posing a significant threat to
  network security.
required_fields:
- _time
- All_Traffic.app
- All_Traffic.dest_port
- All_Traffic.src_ip
- All_Traffic.dest_ip
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Network_Traffic where (All_Traffic.app=dns NOT All_Traffic.dest_port=53)
  OR ((All_Traffic.app=web-browsing OR All_Traffic.app=http) NOT (All_Traffic.dest_port=80
  OR All_Traffic.dest_port=8080 OR All_Traffic.dest_port=8000)) OR (All_Traffic.app=ssl
  NOT (All_Traffic.dest_port=443 OR All_Traffic.dest_port=8443)) OR (All_Traffic.app=smtp
  NOT All_Traffic.dest_port=25) by All_Traffic.src_ip, All_Traffic.dest_ip, All_Traffic.app,
  All_Traffic.dest_port |convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `drop_dm_object_name("All_Traffic")`
  | `protocol_or_port_mismatch_filter`'
