description: The following analytic identifies spikes in the number of Server Message
  Block (SMB) connections using the Machine Learning Toolkit (MLTK). It leverages
  the Network_Traffic data model to monitor SMB traffic on ports 139 and 445, applying
  a machine learning model to detect anomalies. This activity is significant because
  sudden increases in SMB traffic can indicate lateral movement or data exfiltration
  attempts by attackers. If confirmed malicious, this behavior could lead to unauthorized
  access, data theft, or further compromise of the network.
required_fields:
- _time
- All_Traffic.dest_ip
- All_Traffic.dest_port
- All_Traffic.app
- All_Traffic.src
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count values(All_Traffic.dest_ip) as dest values(All_Traffic.dest_port)
  as port from datamodel=Network_Traffic where All_Traffic.dest_port=139 OR All_Traffic.dest_port=445
  OR All_Traffic.app=smb by _time span=1h, All_Traffic.src | eval HourOfDay=strftime(_time,
  "%H") | eval DayOfWeek=strftime(_time, "%A") | `drop_dm_object_name(All_Traffic)`
  | apply smb_pdfmodel threshold=0.001 | rename "IsOutlier(count)" as isOutlier |
  search isOutlier > 0 | sort -count | table _time src dest port count | `smb_traffic_spike___mltk_filter`'
