description: The following analytic detects email files (.pst or .ost) being created
  outside the standard Outlook directories. It leverages the Endpoint.Filesystem data
  model to identify file creation events and filters for email files not located in
  "C:\Users\*\My Documents\Outlook Files\*" or "C:\Users\*\AppData\Local\Microsoft\Outlook*".
  This activity is significant as it may indicate data exfiltration or unauthorized
  access to email data. If confirmed malicious, an attacker could potentially access
  sensitive email content, leading to data breaches or further exploitation within
  the network.
required_fields:
- _time
- Filesystem.file_path
- Filesystem.file_name
- Filesystem.action
- Filesystem.process_id
- Filesystem.dest
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count values(Filesystem.file_path) as file_path
  min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Filesystem
  where (Filesystem.file_name=*.pst OR Filesystem.file_name=*.ost) Filesystem.file_path
  != "C:\\Users\\*\\My Documents\\Outlook Files\\*"  Filesystem.file_path!="C:\\Users\\*\\AppData\\Local\\Microsoft\\Outlook*"
  by Filesystem.action Filesystem.process_id Filesystem.file_name Filesystem.dest
  | `drop_dm_object_name("Filesystem")` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| `email_files_written_outside_of_the_outlook_directory_filter`'
