description: The following analytic identifies emails claiming to be sent from a domain
  similar to one you are monitoring for potential abuse. It leverages email header
  data, specifically the sender's address, and cross-references it with a lookup table
  of known domain permutations generated by the "ESCU - DNSTwist Domain Names" search.
  This activity is significant as it can indicate phishing attempts or brand impersonation,
  which are common tactics used in social engineering attacks. If confirmed malicious,
  this could lead to unauthorized access, data theft, or reputational damage.
required_fields:
- _time
- All_Email.recipient
- All_Email.src_user
- All_Email.message_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` values(All_Email.recipient) as recipients, min(_time)
  as firstTime, max(_time) as lastTime from datamodel=Email by All_Email.src_user,
  All_Email.message_id | `drop_dm_object_name("All_Email")` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | eval temp=split(src_user,
  "@") | eval email_domain=mvindex(temp, 1) | lookup update=true brandMonitoring_lookup
  domain as email_domain OUTPUT domain_abuse | search domain_abuse=true | table message_id,
  src_user, email_domain, recipients, firstTime, lastTime | `monitor_email_for_brand_abuse_filter`'
