description: The following analytic identifies Windows endpoints that have not generated
  an event indicating a successful Windows update in the last 60 days. It leverages
  the 'Update' data model in Splunk, specifically looking for the latest 'Installed'
  status events from Microsoft Windows. This activity is significant for a SOC because
  endpoints that are not regularly patched are vulnerable to known exploits and security
  vulnerabilities. If confirmed malicious, this could indicate a compromised endpoint
  that is intentionally being kept unpatched, potentially allowing attackers to exploit
  unpatched vulnerabilities and gain unauthorized access or control.
required_fields:
- _time
- Updates.status
- Updates.vendor_product
- Updates.dest
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` max(_time) as lastTime from datamodel=Updates where
  Updates.status=Installed Updates.vendor_product="Microsoft Windows" by Updates.dest
  Updates.status Updates.vendor_product | rename Updates.dest as Host | rename Updates.status
  as "Update Status" | rename Updates.vendor_product as Product | eval isOutlier=if(lastTime
  <= relative_time(now(), "-60d@d"), 1, 0)  | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)  | search isOutlier=1 | rename lastTime as "Last Update Time", |
  table Host, "Update Status", Product, "Last Update Time" | `no_windows_updates_in_a_time_frame_filter`'
