description: The following correlation identifies when a user exceeds a risk threshold
  based on multiple suspicious Okta activities. It leverages the Risk Framework from
  Enterprise Security, aggregating risk events from "Suspicious Okta Activity," "Okta
  Account Takeover," and "Okta MFA Exhaustion" analytic stories. This detection is
  significant as it highlights potentially compromised user accounts exhibiting multiple
  tactics, techniques, and procedures (TTPs) within a 24-hour period. If confirmed
  malicious, this activity could indicate a serious security breach, allowing attackers
  to gain unauthorized access, escalate privileges, or persist within the environment.
required_fields:
- All_Risk.risk_object
- All_Risk.risk_object_type
- All_Risk.analyticstories
- All_Risk.calculated_risk_score
- All_Risk.annotations.mitre_attack.mitre_tactic_id
- All_Risk.annotations.mitre_attack.mitre_technique_id
- All_Risk.tag
- _time
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` values(All_Risk.analyticstories) as analyticstories  sum(All_Risk.calculated_risk_score)
  as risk_score, count(All_Risk.calculated_risk_score) as risk_event_count,values(All_Risk.annotations.mitre_attack.mitre_tactic_id)
  as annotations.mitre_attack.mitre_tactic_id, dc(All_Risk.annotations.mitre_attack.mitre_tactic_id)
  as mitre_tactic_id_count, values(All_Risk.annotations.mitre_attack.mitre_technique_id)
  as annotations.mitre_attack.mitre_technique_id, dc(All_Risk.annotations.mitre_attack.mitre_technique_id)
  as mitre_technique_id_count, values(All_Risk.tag) as tag, values(source) as source,
  dc(source) as source_count from datamodel=Risk.All_Risk  where All_Risk.risk_object_type
  = user All_Risk.analyticstories IN ("Okta Account Takeover", "Suspicious Okta Activity","Okta
  MFA Exhaustion") by All_Risk.risk_object,All_Risk.risk_object_type | `drop_dm_object_name("All_Risk")`
  |  search mitre_technique_id_count > 5 | `okta_risk_threshold_exceeded_filter`'
