description: The following analytic identifies multiple failed multi-factor authentication
  (MFA) requests for a single user within an Okta tenant. It triggers when more than
  10 MFA attempts fail within 5 minutes, using Okta event logs to detect this pattern.
  This activity is significant as it may indicate an adversary attempting to bypass
  MFA by bombarding the user with repeated authentication requests, a technique used
  by threat actors like Lapsus and APT29. If confirmed malicious, this could lead
  to unauthorized access, potentially compromising sensitive information and systems.
required_fields:
- _time
- eventType
- outcome.result
- debugContext.debugData.factor
- displayMessage
- src_user
- src_ip
rule: eventtype=okta_log OR sourcetype = "OktaIM2:log" eventType=user.authentication.auth_via_mfa
  outcome.result=FAILURE debugContext.debugData.factor!=PASSWORD_AS_FACTOR | bucket
  _time span=5m | stats count min(_time) as firstTime max(_time) as lastTime values(displayMessage)
  values(src_ip) as src_ip values(debugContext.debugData.factor) by _time src_user
  | where count >= 10 | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `okta_multiple_failed_mfa_requests_for_user_filter`
