description: The following analytic detects patterns of successful and failed Okta
  MFA push attempts to identify potential MFA exhaustion attacks. It leverages Okta
  event logs, specifically focusing on push verification events, and uses statistical
  evaluations to determine suspicious activity. This activity is significant as it
  may indicate an attacker attempting to bypass MFA by overwhelming the user with
  push notifications. If confirmed malicious, this could lead to unauthorized access,
  compromising the security of the affected accounts and potentially the entire environment.
required_fields:
- _time
- user
- src_ip
- eventType
- status
rule: eventtype=okta_log OR sourcetype = "OktaIM2:log" eventType=system.push.send_factor_verify_push
  OR ((legacyEventType=core.user.factor.attempt_success) AND (debugContext.debugData.factor=OKTA_VERIFY_PUSH))
  OR ((legacyEventType=core.user.factor.attempt_fail) AND (debugContext.debugData.factor=OKTA_VERIFY_PUSH))
  | stats count(eval(legacyEventType="core.user.factor.attempt_success"))  as successes
  count(eval(legacyEventType="core.user.factor.attempt_fail")) as failures count(eval(eventType="system.push.send_factor_verify_push"))
  as pushes by user,_time | stats latest(_time) as lasttime earliest(_time) as firsttime
  sum(successes) as successes sum(failures) as failures sum(pushes) as pushes by user
  | eval seconds=lasttime-firsttime | eval lasttime=strftime(lasttime, "%c") | search
  (pushes>1) | eval totalattempts=successes+failures | eval finding="Normal authentication
  pattern" | eval finding=if(failures==pushes AND pushes>1,"Authentication attempts
  not successful because multiple pushes denied",finding) | eval finding=if(totalattempts==0,"Multiple
  pushes sent and ignored",finding) | eval finding=if(successes>0 AND pushes>3,"Probably
  should investigate. Multiple pushes sent, eventual successful authentication!",finding)
  | `okta_mfa_exhaustion_hunt_filter`
