description: The following analytic identifies failed authentication attempts during
  the Multi-Factor Authentication (MFA) challenge in an Okta tenant. It uses the Authentication
  datamodel to detect specific failed events where the authentication signature is
  `user.authentication.auth_via_mfa`. This activity is significant as it may indicate
  an adversary attempting to authenticate with compromised credentials on an account
  with MFA enabled. If confirmed malicious, this could suggest an ongoing attempt
  to bypass MFA protections, potentially leading to unauthorized access and further
  compromise of the affected account.
required_fields:
- _time
- Authentication.app
- Authentication.action
- Authentication.user
- Authentication.reason
- Authentication.dest
- Authentication.signature
- Authentication.method
- Authentication.src
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime  values(Authentication.app)
  as app values(Authentication.reason) as reason values(Authentication.signature)
  as signature  values(Authentication.method) as method  from datamodel=Authentication
  where  Authentication.signature=user.authentication.auth_via_mfa Authentication.action
  = failure by _time Authentication.src Authentication.user Authentication.dest Authentication.action
  | `drop_dm_object_name("Authentication")` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| iplocation
  src | `okta_authentication_failed_during_mfa_challenge_filter`'
