description: The following analytic detects potential account discovery activities
  using the 'net' command, commonly employed by malware like Trickbot for reconnaissance.
  It leverages Endpoint Detection and Response (EDR) data, focusing on specific command-line
  patterns and process relationships. This activity is significant as it often precedes
  further malicious actions, such as lateral movement or privilege escalation. If
  confirmed malicious, attackers could gain valuable information about user accounts,
  enabling them to escalate privileges or move laterally within the network, posing
  a significant security risk.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` values(Processes.process) as process values(Processes.parent_process)
  as parent_process values(Processes.process_id) as process_id count min(_time) as
  firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where (Processes.process_name="net.exe"
  OR Processes.original_file_name="net.exe" OR Processes.process_name="net1.exe" OR
  Processes.original_file_name="net1.exe") AND (Processes.process="* user *" OR  Processes.process="*config*"
  OR Processes.process="*view /all*") by  Processes.process_name Processes.dest Processes.user
  Processes.parent_process_name | where count >=4 | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `account_discovery_with_net_app_filter`'
