description: The following analytic detects suspicious modifications to the Active
  Setup registry for persistence and privilege escalation. It leverages data from
  the Endpoint.Registry data model, focusing on changes to the "StubPath" value within
  the "SOFTWARE\\Microsoft\\Active Setup\\Installed Components" path. This activity
  is significant as it is commonly used by malware, adware, and APTs to maintain persistence
  on compromised machines. If confirmed malicious, this could allow attackers to execute
  code upon system startup, potentially leading to further system compromise and unauthorized
  access.
required_fields:
- _time
- Registry.dest
- Registry.registry_value_name
- Registry.registry_key_name
- Registry.registry_path
- Registry.registry_value_data
- Registry.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE (Registry.registry_value_name= "StubPath"
  Registry.registry_path = "*\\SOFTWARE\\Microsoft\\Active Setup\\Installed Components*")
  BY Registry.registry_path Registry.registry_key_name Registry.registry_value_name
  Registry.registry_value_data Registry.process_guid Registry.dest Registry.user |
  `drop_dm_object_name(Registry)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| `active_setup_registry_autostart_filter`'
