description: The following analytic detects a registry modification that allows the
  'Consent Admin' to perform operations requiring elevation without user consent or
  credentials. It leverages data from the Endpoint.Registry data model, specifically
  monitoring changes to the 'ConsentPromptBehaviorAdmin' value within the Windows
  Policies System registry path. This activity is significant as it indicates a potential
  privilege escalation attempt, which could allow an attacker to execute high-privilege
  tasks without user approval. If confirmed malicious, this could lead to unauthorized
  administrative access and control over the compromised machine, posing a severe
  security risk.
required_fields:
- _time
- Registry.dest
- Registry.registry_value_name
- Registry.registry_key_name
- Registry.registry_path
- Registry.registry_value_data
- Registry.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path= "*\\Microsoft\\Windows\\CurrentVersion\\Policies\\System*"
  Registry.registry_value_name = ConsentPromptBehaviorAdmin Registry.registry_value_data
  = "0x00000000") BY Registry.registry_path Registry.registry_key_name Registry.registry_value_name
  Registry.registry_value_data Registry.process_guid Registry.dest Registry.user |
  `drop_dm_object_name(Registry)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `allow_operation_with_consent_admin_filter`'
