description: The following analytic detects attempts to stop security-related services
  on an endpoint, which may indicate malicious activity. It leverages data from Endpoint
  Detection and Response (EDR) agents, specifically searching for processes involving
  the "sc.exe" command with the "stop" parameter. This activity is significant because
  disabling security services can undermine the organization's security posture, potentially
  leading to unauthorized access, data exfiltration, or further attacks like malware
  installation or privilege escalation. If confirmed malicious, this behavior could
  compromise the endpoint and the entire network, necessitating immediate investigation
  and response.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` values(Processes.process) as process min(_time)
  as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where (Processes.process_name="net.exe"
  OR Processes.original_file_name="net.exe" OR Processes.process_name="net1.exe" OR
  Processes.original_file_name="net1.exe") OR  Processes.process_name = sc.exe Processes.process="*
  stop *" by Processes.dest Processes.user Processes.parent_process Processes.parent_process_name
  Processes.process_name Processes.original_file_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) |lookup security_services_lookup
  service as process OUTPUTNEW category, description | search category=security |
  `attempt_to_stop_security_service_filter`'
