description: The following analytic detects a suspicious registry modification that
  enables auto admin logon on a host. It leverages data from the Endpoint.Registry
  data model, specifically looking for changes to the "AutoAdminLogon" value within
  the "SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon" registry path. This
  activity is significant because it was observed in BlackMatter ransomware attacks
  to maintain access after a safe mode reboot, facilitating further encryption. If
  confirmed malicious, this could allow attackers to automatically log in and continue
  their operations, potentially leading to widespread network encryption and data
  loss.
required_fields:
- _time
- Registry.dest
- Registry.registry_value_name
- Registry.registry_key_name
- Registry.registry_path
- Registry.registry_value_data
- Registry.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path= "*SOFTWARE\\Microsoft\\Windows
  NT\\CurrentVersion\\Winlogon*" AND Registry.registry_value_name=AutoAdminLogon AND
  Registry.registry_value_data=1) BY Registry.registry_path Registry.registry_key_name
  Registry.registry_value_name Registry.registry_value_data Registry.process_guid
  Registry.dest | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `auto_admin_logon_registry_entry_filter`'
