description: The following analytic detects the use of `bitsadmin.exe` with the `transfer`
  parameter to download a remote object. It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process and command-line telemetry. This
  activity is significant because `bitsadmin.exe` can be exploited to download and
  execute malicious files without immediate detection. If confirmed malicious, an
  attacker could use this technique to download and execute payloads, potentially
  leading to code execution, privilege escalation, or persistent access within the
  environment. Review parallel and child processes, especially `svchost.exe`, for
  associated artifacts.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=bitsadmin.exe OR
  Processes.original_file_name=bitsadmin.exe) Processes.process IN ("*transfer*",
  "*addfile*") by Processes.dest Processes.user Processes.parent_process Processes.parent_process_name
  Processes.original_file_name Processes.process_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `bitsadmin_download_file_filter`'
