description: The following analytic detects the use of `certutil.exe` to download
  files using the `-VerifyCtl` and `-split` arguments. This behavior is identified
  by monitoring command-line executions for these specific arguments via Endpoint
  Detection and Response (EDR) telemetry. This activity is significant because `certutil.exe`
  is a legitimate tool often abused by attackers to download and execute malicious
  payloads. If confirmed malicious, this could allow an attacker to download and execute
  arbitrary files, potentially leading to code execution, data exfiltration, or further
  compromise of the system.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=certutil.exe OR
  Processes.original_file_name=CertUtil.exe) (Processes.process=*verifyctl* Processes.process=*split*)
  OR Processes.process=*verifyctl* by Processes.dest Processes.user Processes.original_file_name
  Processes.parent_process Processes.parent_process_name Processes.process_name Processes.process
  Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `certutil_download_with_verifyctl_and_split_arguments_filter`'
