description: The following analytic detects the use of certutil.exe to download files
  using the `-urlcache` and `-split` arguments. It leverages Endpoint Detection and
  Response (EDR) data, focusing on command-line executions that include these specific
  arguments. This activity is significant because certutil.exe is typically used for
  certificate services, and its use to download files from remote locations is uncommon
  and potentially malicious. If confirmed, this behavior could indicate an attempt
  to download and execute malicious payloads, leading to potential system compromise
  and unauthorized data access.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=certutil.exe OR
  Processes.original_file_name=CertUtil.exe) (Processes.process=*urlcache* Processes.process=*split*)
  OR Processes.process=*urlcache* by Processes.dest Processes.user Processes.parent_process
  Processes.parent_process_name Processes.process_name Processes.process Processes.process_id
  Processes.original_file_name Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `certutil_download_with_urlcache_and_split_arguments_filter`'
