description: The following analytic detects the creation of local administrator accounts
  using the net.exe command. It leverages Endpoint Detection and Response (EDR) data
  to identify processes named net.exe or net1.exe with the "/add" parameter and keywords
  related to administrator accounts. This activity is significant as it may indicate
  an attacker attempting to gain persistent access or escalate privileges. If confirmed
  malicious, this could lead to unauthorized access, data theft, or further system
  compromise. Review the process details, user context, and related artifacts to determine
  the legitimacy of the activity.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: "| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`\
  \ fillnull_value=`fillnull_config` count values(Processes.user) as user values(Processes.parent_process)\
  \ as parent_process values(parent_process_name) as parent_process_name min(_time)\
  \ as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where (Processes.process_name=\"\
  net.exe\" OR Processes.original_file_name=\"net.exe\" OR Processes.process_name=\"\
  net1.exe\" OR Processes.original_file_name=\"net1.exe\") AND Processes.process=*/add*\
  \ AND (Processes.process=*administrators* OR Processes.process=*administratoren*\
  \ OR Processes.process=*administrateurs* OR Processes.process=*administrador* OR\
  \ Processes.process=*amministratori* OR Processes.process=*administratorer* OR Processes.process=*Rendszergazda*\
  \ OR Processes.process=*\u0410\u0434\u043C\u0438\u043D\u0438\u0441\u0442\u0440\u0430\
  \u0442\u043E\u0440* OR Processes.process=*Administrat\xF6r*) by Processes.process\
  \ Processes.process_name Processes.parent_process_name Processes.dest Processes.user|\
  \ `drop_dm_object_name(Processes)` | convert timeformat=\"%Y-%m-%dT%H:%M:%S\" ctime($field$)\
  \ | convert timeformat=\"%Y-%m-%dT%H:%M:%S\" ctime($field$) | `create_local_admin_accounts_using_net_exe_filter`"
