description: The following analytic detects the creation of shadow copies using "wmic"
  or "Powershell" commands. It leverages the Endpoint.Processes data model in Splunk
  to identify processes where the command includes "shadowcopy" and "create". This
  activity is significant because it may indicate an attacker attempting to manipulate
  or access data unauthorizedly, potentially leading to data theft or manipulation.
  If confirmed malicious, this behavior could allow attackers to backup and exfiltrate
  sensitive data or hide their tracks by restoring files to a previous state after
  an attack.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=wmic.exe OR Processes.original_file_name=wmic.exe)
  OR (Processes.process_name=pwsh.exe OR Processes.process_name=sqlps.exe OR Processes.process_name=sqltoolsps.exe
  OR Processes.process_name=powershell.exe OR Processes.process_name=powershell_ise.exe
  OR Processes.original_file_name=pwsh.dll OR Processes.original_file_name=PowerShell.EXE
  OR Processes.original_file_name=powershell_ise.EXE) Processes.process=*shadowcopy*
  Processes.process=*create* by Processes.user Processes.process_name Processes.original_file_name
  Processes.parent_process_name Processes.process Processes.dest | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `creation_of_shadow_copy_with_wmic_and_powershell_filter`'
