description: The following analytic detects the creation or deletion of Windows shares
  using the net.exe command. It leverages Endpoint Detection and Response (EDR) data
  to identify processes involving net.exe with actions related to share management.
  This activity is significant because it may indicate an attacker attempting to manipulate
  network shares for malicious purposes, such as data exfiltration, malware distribution,
  or establishing persistence. If confirmed malicious, this activity could lead to
  unauthorized access to sensitive information, service disruption, or malware introduction.
  Immediate investigation is required to determine the intent and mitigate potential
  threats.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count values(Processes.user) as user values(Processes.parent_process)
  as parent_process min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where (Processes.process_name="net.exe" OR Processes.original_file_name="net.exe"
  OR Processes.process_name="net1.exe" OR Processes.original_file_name="net1.exe")
  by Processes.process Processes.process_name  Processes.parent_process_name Processes.original_file_name
  Processes.dest | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | search process=*share*
  | `create_or_delete_windows_shares_using_net_exe_filter`'
