description: The following analytic detects the creation of a symlink to a shadow
  copy, which may indicate credential dumping attempts. It leverages the Endpoint.Processes
  data model in Splunk to identify processes executing commands containing "mklink"
  and "HarddiskVolumeShadowCopy". This activity is significant because attackers often
  use this technique to manipulate or delete shadow copies, hindering system backup
  and recovery efforts. If confirmed malicious, this could prevent data restoration,
  complicate incident response, and lead to data loss or compromise. Analysts should
  review the process details, user, parent process, and any related artifacts to identify
  the attack source.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=cmd.exe OR Processes.original_file_name=Cmd.Exe)
  Processes.process=*mklink* Processes.process=*HarddiskVolumeShadowCopy* by Processes.dest
  Processes.user Processes.process_name Processes.process  Processes.parent_process
  Processes.parent_process_name Processes.original_file_name Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `credential_dumping_via_symlink_to_shadow_copy_filter`'
