description: The following analytic identifies the execution of `outlook.exe` writing
  a `.zip` file to the disk. It leverages data from the Endpoint data model, specifically
  monitoring process and filesystem activities. This behavior is significant as it
  may indicate the use of Outlook to deliver malicious payloads or exfiltrate data
  via compressed files. If confirmed malicious, this activity could lead to unauthorized
  data access, data exfiltration, or the delivery of malware, potentially compromising
  the security of the affected system and network.
required_fields:
- _time
- Processes.process_name
- Processes.parent_process_id
- Processes.process_id
- Processes.dest
- Processes.parent_process_name
- Processes.user
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config`  min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Processes where Processes.process_name=outlook.exe by _time
  span=5m Processes.parent_process_id Processes.process_id Processes.dest Processes.process_name
  Processes.parent_process_name Processes.user | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | rename process_id as malicious_id| rename parent_process_id as
  outlook_id| join malicious_id type=inner[| tstats summariesonly=`summariesonly_config`
  allow_old_summaries=`oldsummaries_config` fillnull_value=`fillnull_config` count
  values(Filesystem.file_path) as file_path values(Filesystem.file_name) as file_name  FROM
  datamodel=Endpoint.Filesystem where (Filesystem.file_path=*.zip*   OR Filesystem.file_name=*.lnk
  ) AND (Filesystem.file_path=C:\\Users* OR Filesystem.file_path=*Local\\Temp*) by  _time
  span=5m Filesystem.process_id Filesystem.file_hash Filesystem.dest  | `drop_dm_object_name(Filesystem)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | rename process_id as malicious_id| fields malicious_id outlook_id
  dest file_path file_name file_hash count file_id] | table firstTime lastTime user
  malicious_id outlook_id process_name parent_process_name file_name  file_path |
  where file_name != "" | `detect_outlook_exe_writing_a_zip_file_filter`'
