description: The following analytic detects the execution of hh.exe (HTML Help) using
  InfoTech Storage Handlers to load Windows script code from a Compiled HTML Help
  (CHM) file. This detection leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on process names and command-line executions. This activity is
  significant because it can be used to execute malicious scripts embedded within
  CHM files, potentially leading to code execution. If confirmed malicious, this technique
  could allow an attacker to execute arbitrary code, escalate privileges, or persist
  within the environment.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=hh.exe OR Processes.original_file_name=HH.EXE)
  Processes.process IN ("*its:*", "*mk:@MSITStore:*") by Processes.dest Processes.user
  Processes.parent_process Processes.process_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `detect_html_help_using_infotech_storage_handlers_filter`'
