description: The following analytic detects the execution of rundll32.exe loading
  syssetup.dll via the LaunchINFSection function. This method is identified through
  Endpoint Detection and Response (EDR) telemetry, focusing on command-line executions
  and process details. This activity is significant as it indicates a potential application
  control bypass, allowing script code execution from a file. If confirmed malicious,
  an attacker could execute arbitrary code, potentially leading to privilege escalation,
  persistence, or further network compromise. Investigate the script content, network
  connections, and any spawned child processes for further context.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=rundll32.exe OR
  Processes.original_file_name=RUNDLL32.EXE) Processes.process=*syssetup* by Processes.dest
  Processes.user Processes.parent_process_name Processes.original_file_name Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `detect_rundll32_application_control_bypass___syssetup_filter`'
