description: The following analytic detects the use of the Certipy tool to enumerate
  Active Directory Certificate Services (AD CS) environments by identifying unique
  file modifications. It leverages endpoint process and filesystem data to spot the
  creation of files with specific names or extensions associated with Certipy's information
  gathering and exfiltration activities. This activity is significant as it indicates
  potential reconnaissance and data exfiltration efforts by an attacker. If confirmed
  malicious, this could lead to unauthorized access to sensitive AD CS information,
  enabling further attacks or privilege escalation within the network.
required_fields:
- _time
- Processes.user
- Processes.dest
- Processes.process_id
- Processes.process_name
- Processes.process
- Processes.process_path
- Processes.parent_process_name
- Processes.parent_process
- Processes.process_guid
- Processes.action
- Filesystem.file_create_time
- Filesystem.process_id
- Filesystem.process_guid
- Filesystem.file_name
- Filesystem.file_path
- Filesystem.dest
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) AS firstTime max(_time) AS lastTime
  values(Processes.process_current_directory) as process_current_directory FROM datamodel=Endpoint.Processes
  where Processes.action="allowed" BY _time span=1h Processes.user Processes.dest
  Processes.process_id Processes.process_name Processes.process Processes.process_path
  Processes.parent_process_name Processes.parent_process Processes.process_guid Processes.action
  |`drop_dm_object_name(Processes)` | join max=0 dest process_guid [| tstats summariesonly=`summariesonly_config`
  allow_old_summaries=`oldsummaries_config` fillnull_value=`fillnull_config` count
  min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Filesystem
  where Filesystem.file_name IN ("*_certipy.zip", "*_certipy.txt", "*_certipy.json",
  "*.ccache") by Filesystem.file_create_time Filesystem.process_id Filesystem.process_guid
  Filesystem.file_name Filesystem.file_path Filesystem.dest | `drop_dm_object_name(Filesystem)`
  ] | fields firstTime lastTime user dest file_create_time file_name file_path parent_process_name
  parent_process process_name process_path process_current_directory process process_guid
  process_id | where isnotnull(file_name) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `detect_certipy_file_modifications_filter`'
