description: The following analytic detects the execution of hh.exe (HTML Help) loading
  a Compiled HTML Help (CHM) file from a remote URL. This detection leverages data
  from Endpoint Detection and Response (EDR) agents, focusing on command-line executions
  containing URLs. This activity is significant as it can indicate an attempt to execute
  malicious scripts via CHM files, potentially leading to unauthorized code execution.
  If confirmed malicious, this could allow an attacker to run scripts using engines
  like JScript or VBScript, leading to further system compromise or data exfiltration.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=hh.exe OR Processes.original_file_name=HH.EXE)
  Processes.process=*http* by Processes.dest Processes.user  Processes.parent_process_name
  Processes.parent_process Processes.original_file_name Processes.process_name Processes.process
  Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `detect_html_help_url_in_command_line_filter`'
