description: The following analytic detects instances of regsvcs.exe running without
  command line arguments. This behavior typically indicates process injection, where
  another process manipulates regsvcs.exe. The detection leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process names, IDs, and command-line
  executions. This activity is significant as it may signal an attempt to evade detection
  and execute malicious code. If confirmed malicious, the attacker could achieve code
  execution, potentially leading to privilege escalation, persistence, or access to
  sensitive information.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Processes where (Processes.process_name=regsvcs.exe
  OR Processes.original_file_name=RegSvcs.exe) by _time span=1h  Processes.process_id
  Processes.process_name Processes.dest Processes.user Processes.process_path Processes.process  Processes.parent_process_name
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | regex process="(?i)(regsvcs\.exe.{0,4}$)"|
  `detect_regsvcs_with_no_command_line_arguments_filter`'
