description: The following analytic detects the execution of processes with file or
  code signing attributes from known remote access software within the environment.
  It leverages Sysmon EventCode 1 data and cross-references a lookup table of remote
  access utilities such as AnyDesk, GoToMyPC, LogMeIn, and TeamViewer. This activity
  is significant as adversaries often use these tools to maintain unauthorized remote
  access. If confirmed malicious, this could allow attackers to persist in the environment,
  potentially leading to data exfiltration or further compromise of the network.
required_fields:
- _time
- dest
- EventCode
- Company
- Product
- user
- parent_process_name
- process_name
- process
rule: sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational OR source=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
  OR source=Syslog:Linux-Sysmon/Operational EventCode=1 | stats count min(_time) as
  firstTime max(_time) as lastTime, values(Company) as Company values(Product) as
  Product by dest, user, parent_process_name, process_name, process | lookup remote_access_software
  remote_utility_fileinfo AS Product OUTPUT isutility, description as signature, comment_reference
  as desc, category | search isutility = True | eval exception_asset = CASE(isnotnull(src),src,isnotnull(dest),dest)
  | lookup update=true asset_lookup_by_str asset as exception_asset OUTPUTNEW asset
  as asset_temp_field | eval asset_temp_field = CASE(isnull(asset_temp_field),exception_asset,true(),asset_temp_field
  ) | lookup remote_access_software_exceptions asset as asset_temp_field software
  as signature OUTPUT exception as rmm_exception, exception_date as rmm_exception_date,
  exception_ttl_days as rmm_exception_ttl_days, comment as rmm_exception_comment |
  eval rmm_exception = mvdedup(mvfilter(NOT match(rmm_exception,"false"))), rmm_exception_date
  = mvdedup(mvfilter(NOT match(rmm_exception_date,"false"))), rmm_exception_ttl_days
  = mvdedup(mvfilter(NOT match(rmm_exception_ttl_days,"false"))), rmm_exception_comment
  = mvdedup(mvfilter(NOT match(rmm_exception_comment,"false"))), rmm_exception_end_date
  = relative_time(strptime(rmm_exception_date, "%Y-%m-%d"), "+"+rmm_exception_ttl_days+"d"),
  rmm_exception_end = CASE((now() >= rmm_exception_end_date),"TRUE",(now() < rmm_exception_end_date),"FALSE",(match(rmm_exception,"(?i)true")
  AND isnull(rmm_exception_ttl_days)),"UNLIMITED") | search NOT (rmm_exception = TRUE
  AND rmm_exception_end IN ("FALSE","UNLIMITED")) | fields - asset_temp_field,exception_asset
  | `detect_remote_access_software_usage_fileinfo_filter`
