description: The following analytic identifies one source failing to authenticate
  with 10 or more unique users. This behavior could represent an adversary performing
  a Password Spraying attack to obtain initial access or elevate privileges. This
  logic can be used for real time security monitoring as well as threat hunting exercises
  and works well against any number of data sources ingested into the CIM datamodel.
  Environments can be very different depending on the organization. Test and customize
  this detections thresholds if needed.
required_fields:
- _time
- Authentication.user_category
- Authentication.src_category
- Authentication.app
- Authentication.action
- Authentication.src
- Authentication.user
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` max(_time) as lastTime, min(_time) as firstTime,
  values(Authentication.user_category) as user_category values(Authentication.src_category)
  as src_category values(Authentication.app) as app count from datamodel=Authentication.Authentication
  where * by Authentication.action,Authentication.src,Authentication.user | `drop_dm_object_name("Authentication")`
  | eval user=case((match(upper(user),"[a-zA-Z0-9]{3}")),upper(user),true(),null),
  src=upper(src), success=if(action="success",count,0),success_user=if(action="success",user,null),failure=if(action="failure",count,0),
  failed_user=if(action="failure",user,null) | `detect_password_spray_attack_behavior_from_source_filter`
  | stats count min(firstTime) as firstTime max(lastTime) as lastTime values(app)
  as app values(src_category) as src_category values(success_user) as user values(failed_user)
  as failed_user dc(success_user) as success_dc dc(failed_user) as failed_dc dc(user)
  as user_dc ,sum(failure) as failure,sum(success) as success by src | fields - _time
  | where user_dc >= 10 AND .25 > (success/failure) AND failed_dc > success_dc | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)'
