description: The following analytic identifies the creation of a program executable
  in an unquoted service path, a common technique for privilege escalation. It leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on process creation
  events where the parent process is 'services.exe'. This activity is significant
  because unquoted service paths can be exploited by attackers to execute arbitrary
  code with elevated privileges. If confirmed malicious, this could allow an attacker
  to gain higher-level access, potentially leading to full system compromise and persistent
  control over the affected endpoint.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.parent_process_name=services.exe
  by Processes.user Processes.process_name Processes.parent_process_name Processes.process
  Processes.dest | `drop_dm_object_name(Processes)` | rex field=process "^.*?\\\\(?<service_process>[^\\\\]*\.(?:exe|bat|com|ps1))"
  | eval process_name = lower(process_name) | eval service_process = lower(service_process)
  | where process_name != service_process | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `detect_path_interception_by_creation_of_program_exe_filter`'
