description: The following analytic detects attempts to read LSASS memory, indicative
  of credential dumping. It leverages Sysmon EventCode 10, filtering for specific
  access permissions (0x1010 and 0x1410) on the lsass.exe process. This activity is
  significant because it suggests an attacker is trying to extract credentials from
  LSASS memory, potentially leading to unauthorized access, data breaches, and compromise
  of sensitive information. If confirmed malicious, this could enable attackers to
  escalate privileges, move laterally within the network, or exfiltrate data. Extensive
  triage is necessary to differentiate between malicious and benign activities.
required_fields:
- _time
- EventCode
- TargetImage
- GrantedAccess
- dest
- SourceImage
- SourceProcessId
- TargetImage
- TargetProcessId
rule: sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational OR source=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
  OR source=Syslog:Linux-Sysmon/Operational EventCode=10 TargetImage=*lsass.exe (GrantedAccess=0x1010
  OR GrantedAccess=0x1410) | stats count min(_time) as firstTime max(_time) as lastTime
  by dest, SourceImage, SourceProcessId, TargetImage, TargetProcessId, EventCode,
  GrantedAccess | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `detect_credential_dumping_through_lsass_access_filter`
