description: The following analytic identifies any user failing to authenticate from
  10 or more unique sources. This behavior could represent an adversary performing
  a Password Spraying attack to obtain initial access or elevate privileges. This
  logic can be used for real time security monitoring as well as threat hunting exercises.
  Environments can be very different depending on the organization. Test and customize
  this detections thresholds as needed
required_fields:
- _time
- Authentication.user_category
- Authentication.src_category
- Authentication.app
- Authentication.action
- Authentication.src
- Authentication.user
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` max(_time) as lastTime, min(_time) as firstTime,
  values(Authentication.user_category) as user_category values(Authentication.src_category)
  as src_category values(Authentication.app) as app count from datamodel=Authentication.Authentication
  where * by Authentication.action,Authentication.src,Authentication.user | `drop_dm_object_name("Authentication")`
  | eval user=case((match(upper(user),"[a-zA-Z0-9]{3}")),upper(user),true(),null),
  success=if(action="success",count,0), src=upper(src), success_src=if(action="success",src,null),
  failure=if(action="failure",count,0), failed_src=if(action="failure",src,null) |
  `detect_password_spray_attack_behavior_on_user_filter` | stats count min(firstTime)
  as firstTime max(lastTime) as lastTime values(app) as app values(src_category) as
  src_category values(success_src) as src values(failed_src) as failed_src dc(success_src)
  as success_dc dc(failed_src) as failed_dc dc(src) as src_dc, sum(failure) as failure,
  sum(success) as success by user | fields - _time | where src_dc >= 10 AND .25 >
  (success/failure) AND failed_dc > success_dc | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)'
