description: The following analytic identifies the abuse of the right-to-left override
  (RTLO) character (U+202E) in process names. It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process execution logs and command-line data.
  This activity is significant because adversaries use the RTLO character to disguise
  malicious files or commands, making them appear benign. If confirmed malicious,
  this technique can allow attackers to execute harmful code undetected, potentially
  leading to unauthorized access, data exfiltration, or further system compromise.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.process_guid
- Processes.parent_process_id
- Processes.parent_process_name
- Processes.parent_process
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process!=unknown AND Processes.action=allowed
  by Processes.dest Processes.user Processes.original_file_name Processes.parent_process_name
  Processes.parent_process Processes.process_name Processes.process Processes.process_id
  Processes.process_guid Processes.parent_process_id | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `drop_dm_object_name(Processes)`
  | regex process="\\x{202E}" | rex field=process "(?<RTLO_command_1>.+)(?<RTLO_exist_process>\\x{202E})(?<RTLO_command_2>.+)"
  | eval process_with_RTLO=process | eval process=RTLO_command_1.RTLO_command_2 |
  fields - RTLO* | `detect_rtlo_in_process_filter`'
