description: The following analytic identifies the execution of tools built by NirSoft
  by detecting specific command-line arguments such as "/stext" and "/scomma". It
  leverages data from Endpoint Detection and Response (EDR) agents, focusing on process
  names, parent processes, and command-line executions. This activity is significant
  because NirSoft tools, while legitimate, can be exploited by attackers for malicious
  purposes such as credential theft or system reconnaissance. If confirmed malicious,
  this activity could lead to unauthorized access, data exfiltration, or further compromise
  of the affected system.
required_fields:
- _time
- Processes.process
- Processes.parent_process
- Processes.process_name
- Processes.user
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) values(Processes.process) as process
  max(_time) as lastTime from datamodel=Endpoint.Processes where (Processes.process="*
  /stext *" OR Processes.process="* /scomma *" ) by Processes.parent_process Processes.process_name
  Processes.user | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) |convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `detection_of_tools_built_by_nirsoft_filter`'
