description: The following analytic identifies the abuse of Regsvr32.exe to proxy
  execution of malicious code, specifically detecting the loading of "scrobj.dll"
  by Regsvr32.exe. This detection leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process creation events and command-line executions. This
  activity is significant because Regsvr32.exe is a trusted, signed Microsoft binary,
  often used in "Squiblydoo" attacks to bypass application control mechanisms. If
  confirmed malicious, this technique could allow an attacker to execute arbitrary
  code, potentially leading to system compromise and persistent access.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=regsvr32.exe OR
  Processes.original_file_name=REGSVR32.EXE) Processes.process=*scrobj* by Processes.dest
  Processes.user Processes.parent_process Processes.process_name Processes.parent_process_name
  Processes.process Processes.original_file_name Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)|
  convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `detect_regsvr32_application_control_bypass_filter`'
