description: The following analytic identifies the creation of suspicious .aspx files
  in known drop locations for Exchange exploitation, specifically targeting paths
  associated with HAFNIUM group and vulnerabilities like ProxyShell and ProxyNotShell.
  It leverages data from the Endpoint datamodel, focusing on process and filesystem
  events. This activity is significant as it may indicate a web shell deployment,
  a common method for persistent access and remote code execution. If confirmed malicious,
  attackers could gain unauthorized access, execute arbitrary commands, and potentially
  escalate privileges within the Exchange environment.
required_fields:
- _time
- Filesystem.file_path
- Filesystem.process_id
- Filesystem.file_name
- Filesystem.file_hash
- Filesystem.user
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Processes where Processes.process_name=System  by
  _time span=1h Processes.process_id Processes.process_name Processes.dest Processes.user
  | `drop_dm_object_name(Processes)` | join process_guid, _time [| tstats summariesonly=`summariesonly_config`
  allow_old_summaries=`oldsummaries_config` fillnull_value=`fillnull_config` count
  min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Filesystem
  where Filesystem.file_path IN ("*\\HttpProxy\\owa\\auth\\*", "*\\inetpub\\wwwroot\\aspnet_client\\*",
  "*\\HttpProxy\\OAB\\*") Filesystem.file_name IN( "*.aspx", "*.ashx") by _time span=1h
  Filesystem.user Filesystem.dest Filesystem.file_create_time Filesystem.file_name
  Filesystem.file_path | `drop_dm_object_name(Filesystem)` | fields _time dest user
  file_create_time file_name file_path process_name process_path process] | dedup
  file_create_time | table dest user file_create_time, file_name, file_path, process_name
  | `detect_exchange_web_shell_filter`'
