description: The following analytic detects the disabling of Windows Defender services
  by monitoring registry modifications. It leverages registry event data to identify
  changes to specific registry paths associated with Defender services, where the
  'Start' value is set to '0x00000004'. This activity is significant because disabling
  Defender services can indicate an attempt by an adversary to evade detection and
  maintain persistence on the endpoint. If confirmed malicious, this action could
  allow attackers to execute further malicious activities undetected, leading to potential
  data breaches or system compromise.
required_fields:
- _time
- Registry.dest
- Registry.registry_value_name
- Registry.registry_key_name
- Registry.registry_path
- Registry.registry_value_data
- Registry.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path = "*\\System\\CurrentControlSet\\Services\\*"
  AND (Registry.registry_path IN("*WdBoot*", "*WdFilter*", "*WdNisDrv*", "*WdNisSvc*","*WinDefend*",
  "*SecurityHealthService*")) AND Registry.registry_value_name = Start Registry.registry_value_data
  = 0x00000004) BY Registry.dest Registry.user Registry.registry_path Registry.registry_key_name
  Registry.registry_value_name Registry.registry_value_data Registry.process_guid
  | `drop_dm_object_name(Registry)`| where isnotnull(registry_value_data) | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `disabling_defender_services_filter`'
