description: The following analytic detects the modification of the Windows registry
  to disable the Windows Defender Submit Samples Consent feature. It leverages data
  from the Endpoint.Registry data model, specifically monitoring changes to the registry
  path associated with Windows Defender SpyNet and the SubmitSamplesConsent value
  set to 0x00000000. This activity is significant as it indicates an attempt to bypass
  or evade detection by preventing Windows Defender from submitting samples for further
  analysis. If confirmed malicious, this could allow an attacker to execute malicious
  code without being detected by Windows Defender, leading to potential system compromise.
required_fields:
- _time
- Registry.dest
- Registry.registry_value_name
- Registry.registry_key_name
- Registry.registry_path
- Registry.registry_value_data
- Registry.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path = "*\\Microsoft\\Windows
  Defender\\SpyNet*" Registry.registry_value_name = SubmitSamplesConsent Registry.registry_value_data
  = 0x00000000) BY Registry.user Registry.dest Registry.registry_path Registry.registry_key_name
  Registry.registry_value_name Registry.registry_value_data Registry.process_guid
  | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data) | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `disable_defender_submit_samples_consent_feature_filter`'
