description: The following analytic identifies the disabling of the firewall using
  the netsh application. It leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on command-line executions that include keywords like "firewall,"
  "off," or "disable." This activity is significant because disabling the firewall
  can expose the system to external threats, allowing malware to communicate with
  its command and control (C2) server. If confirmed malicious, this action could lead
  to unauthorized data exfiltration, further malware downloads, and broader network
  compromise.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=netsh.exe OR Processes.original_file_name=netsh.exe)
  Processes.process= "*firewall*" (Processes.process= "*off*" OR  Processes.process=
  "*disable*") by Processes.dest Processes.user Processes.parent_process Processes.process_name
  Processes.original_file_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `disabling_firewall_with_netsh_filter`'
