description: The following analytic detects the execution of a command to disable
  an existing scheduled task using 'schtasks.exe' with the '/change' and '/disable'
  parameters. This detection leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on process names and command-line arguments. Disabling scheduled
  tasks is significant as it is a common tactic used by adversaries, including malware
  like IcedID, to disable security applications and evade detection. If confirmed
  malicious, this activity could allow attackers to persist undetected, disable critical
  security defenses, and further compromise the targeted host.
required_fields:
- _time
- Processes.user
- Processes.process_name
- Processes.parent_process_name
- Processes.dest
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count  min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_name=schtasks.exe Processes.process=*/change*  Processes.process=*/disable*
  by Processes.user Processes.process_name Processes.process Processes.parent_process_name
  Processes.parent_process Processes.dest | `drop_dm_object_name(Processes)` | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `disable_schedule_task_filter`'
