description: The following analytic detects the modification of the registry to disable
  UAC remote restriction by setting the "LocalAccountTokenFilterPolicy" value to "0x00000001".
  It leverages data from the Endpoint.Registry data model, specifically monitoring
  changes to the registry path "*\\CurrentVersion\\Policies\\System*". This activity
  is significant because disabling UAC remote restriction can allow an attacker to
  bypass User Account Control (UAC) protections, potentially leading to privilege
  escalation. If confirmed malicious, this could enable an attacker to execute unauthorized
  actions with elevated privileges, compromising the security of the affected system.
required_fields:
- _time
- Registry.dest
- Registry.registry_value_name
- Registry.registry_key_name
- Registry.registry_path
- Registry.registry_value_data
- Registry.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path="*\\CurrentVersion\\Policies\\System*"
  Registry.registry_value_name="LocalAccountTokenFilterPolicy" Registry.registry_value_data="0x00000001"  )
  BY Registry.user Registry.dest Registry.registry_path Registry.registry_key_name
  Registry.registry_value_name Registry.registry_value_data Registry.process_guid
  | `drop_dm_object_name(Registry)`| where isnotnull(registry_value_data) | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `disable_uac_remote_restriction_filter`'
