description: The following analytic detects the modification of the Windows Defender
  MpEngine registry value, specifically setting MpEnablePus to 0x00000000. This detection
  leverages endpoint registry logs, focusing on changes within the path "*\\Policies\\Microsoft\\Windows
  Defender\\MpEngine*". This activity is significant as it indicates an attempt to
  disable key Windows Defender features, potentially allowing malware to evade detection.
  If confirmed malicious, this could lead to undetected malware execution, persistence,
  and further system compromise. Immediate investigation and endpoint isolation are
  recommended.
required_fields:
- _time
- Registry.dest
- Registry.registry_value_name
- Registry.registry_key_name
- Registry.registry_path
- Registry.registry_value_data
- Registry.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path = "*\\Policies\\Microsoft\\Windows
  Defender\\MpEngine*" Registry.registry_value_name = MpEnablePus Registry.registry_value_data
  = 0x00000000) BY Registry.registry_path Registry.registry_key_name Registry.registry_value_name
  Registry.registry_value_data Registry.process_guid Registry.user Registry.dest |
  `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data) | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `disable_defender_mpengine_registry_filter`'
