description: The following analytic identifies modifications to the registry key that
  controls the enforcement of Windows User Account Control (UAC). It detects changes
  to the registry path `HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\EnableLUA`
  where the value is set to `0x00000000`. This activity is significant because disabling
  UAC can allow unauthorized changes to the system without user consent, potentially
  leading to privilege escalation. If confirmed malicious, an attacker could gain
  elevated privileges, making it easier to execute further attacks or maintain persistence
  within the environment.
required_fields:
- _time
- Registry.registry_path
- Registry.registry_value_name
- Registry.dest
- Registry.registry_key_name
- Registry.user
- Registry.action
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry where Registry.registry_path=*HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\EnableLUA*
  Registry.registry_value_data="0x00000000" by Registry.dest, Registry.registry_key_name
  Registry.user Registry.registry_path Registry.registry_value_data Registry.action
  | `drop_dm_object_name(Registry)` | `disabling_remote_user_account_control_filter`'
