description: The following analytic detects modifications to the Windows registry
  aimed at disabling the Registry Editor (regedit). It leverages data from the Endpoint.Registry
  data model, specifically monitoring changes to the registry path "*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\DisableRegistryTools"
  with a value of "0x00000001". This activity is significant because malware, such
  as RATs or trojans, often disable registry tools to prevent the removal of their
  entries, aiding in persistence and defense evasion. If confirmed malicious, this
  could hinder incident response efforts and allow the attacker to maintain control
  over the compromised system.
required_fields:
- _time
- Registry.dest
- Registry.registry_value_name
- Registry.registry_key_name
- Registry.registry_path
- Registry.registry_value_data
- Registry.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path= "*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\DisableRegistryTools"
  Registry.registry_value_data = "0x00000001") BY Registry.user Registry.dest Registry.registry_path
  Registry.registry_key_name Registry.registry_value_name Registry.registry_value_data
  Registry.process_guid | `drop_dm_object_name(Registry)`| where isnotnull(registry_value_data)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `disable_registry_tool_filter`'
