description: The following analytic detects the modification of the Windows registry
  to disable the Folder Options feature, which prevents users from showing hidden
  files and file extensions. It leverages data from the Endpoint.Registry data model,
  specifically monitoring changes to the registry path "*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\NoFolderOptions"
  with a value of "0x00000001". This activity is significant as it is commonly used
  by malware to conceal malicious files and deceive users with fake file extensions.
  If confirmed malicious, this could allow an attacker to hide their presence and
  malicious files, making detection and remediation more difficult.
required_fields:
- _time
- Registry.dest
- Registry.registry_value_name
- Registry.registry_key_name
- Registry.registry_path
- Registry.registry_value_data
- Registry.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path= "*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\NoFolderOptions"
  Registry.registry_value_data = "0x00000001") BY Registry.dest Registry.user Registry.registry_path
  Registry.registry_key_name Registry.registry_value_name Registry.registry_value_data
  Registry.process_guid | `drop_dm_object_name(Registry)`| where isnotnull(registry_value_data)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `disabling_folderoptions_windows_feature_filter`'
