description: The following analytic identifies the execution of `dsquery.exe` with
  command-line arguments used to discover domain users. It leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process names and command-line
  executions. This activity is significant as it indicates potential reconnaissance
  efforts by adversaries to map out domain users, which is a common precursor to further
  attacks. If confirmed malicious, this behavior could allow attackers to gain insights
  into user accounts, facilitating subsequent actions like privilege escalation or
  lateral movement within the network.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_id
- Processes.parent_process_name
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_name="dsquery.exe" AND
  Processes.process = "*user*" by Processes.dest Processes.user Processes.parent_process
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  Processes.parent_process_name | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `domain_account_discovery_with_dsquery_filter`'
