description: The following analytic detects the execution of `wmic.exe` with command-line
  arguments used to query for domain users. It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on specific command-line patterns indicative
  of domain account discovery. This activity is significant as it often precedes lateral
  movement or privilege escalation attempts by adversaries. If confirmed malicious,
  this behavior could allow attackers to map out user accounts within the domain,
  facilitating further attacks and potentially compromising sensitive information.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_id
- Processes.parent_process_name
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_name="wmic.exe" AND Processes.process
  = "*/NAMESPACE:\\\\root\\directory\\ldap*" AND Processes.process = "*ds_user*" AND
  Processes.process = "*GET*" AND Processes.process = "*ds_samaccountname*" by Processes.dest
  Processes.user Processes.parent_process Processes.process_name Processes.process
  Processes.process_id Processes.parent_process_id Processes.parent_process_name |
  `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `domain_account_discovery_with_wmic_filter`'
