description: The following analytic detects the behavior of dumping credentials from
  memory by exploiting the Local Security Authority Subsystem Service (LSASS) using
  the comsvcs.dll and MiniDump via rundll32. This detection leverages process information
  from Endpoint Detection and Response (EDR) logs, focusing on specific command-line
  executions. This activity is significant because it indicates potential credential
  theft, which can lead to broader system compromise, persistence, lateral movement,
  and privilege escalation. If confirmed malicious, attackers could gain unauthorized
  access to sensitive information, leading to data theft, ransomware attacks, or other
  damaging outcomes.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=rundll32.exe OR
  Processes.original_file_name=RUNDLL32.EXE) Processes.process=*comsvcs.dll* Processes.process
  IN ("*MiniDump*", "*#24*") by Processes.user Processes.parent_process_name Processes.process_name
  Processes.original_file_name Processes.process Processes.dest | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `dump_lsass_via_comsvcs_dll_filter`'
