description: The following analytic detects modifications to the registry that enable
  RDP on a machine using a non-default port number. It leverages data from the Endpoint.Registry
  data model, specifically monitoring changes to the registry path "HKLM\SYSTEM\CurrentControlSet\Control\Terminal
  Server\WinStations\RDP-Tcp" and the "PortNumber" value. This activity is significant
  as attackers often modify RDP settings to facilitate lateral movement and maintain
  remote access to compromised systems. If confirmed malicious, this could allow attackers
  to bypass network defenses, gain persistent access, and potentially control the
  compromised machine.
required_fields:
- _time
- Registry.dest
- Registry.registry_value_name
- Registry.registry_key_name
- Registry.registry_path
- Registry.registry_value_data
- Registry.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path="*HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal
  Server\\WinStations\\RDP-Tcp*" Registry.registry_value_name = "PortNumber") BY Registry.dest
  Registry.user Registry.registry_path Registry.registry_key_name Registry.registry_value_name
  Registry.registry_value_data Registry.process_guid | `drop_dm_object_name(Registry)`
  | where isnotnull(registry_value_data) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `enable_rdp_in_other_port_number_filter`'
