description: The following analytic detects a suspicious registry modification that
  enables the plain text credential feature in Windows by setting the "UseLogonCredential"
  value to 1 in the WDigest registry path. This detection leverages data from the
  Endpoint.Registry data model, focusing on specific registry paths and values. This
  activity is significant because it is commonly used by malware and tools like Mimikatz
  to dump plain text credentials, indicating a potential credential dumping attempt.
  If confirmed malicious, this could allow an attacker to obtain sensitive credentials,
  leading to further compromise and lateral movement within the network.
required_fields:
- _time
- Registry.dest
- Registry.registry_value_name
- Registry.registry_key_name
- Registry.registry_path
- Registry.registry_value_data
- Registry.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path="*\\System\\CurrentControlSet\\Control\\SecurityProviders\\WDigest\\*"
  Registry.registry_value_name = "UseLogonCredential" Registry.registry_value_data=0x00000001)
  BY Registry.dest Registry.user Registry.registry_path Registry.registry_key_name
  Registry.registry_value_name Registry.registry_value_data Registry.process_guid
  | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data) | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `enable_wdigest_uselogoncredential_registry_filter`'
