description: The following analytic identifies instances where Microsoft Excel spawns
  Windows Script Host processes (`cscript.exe` or `wscript.exe`). This behavior is
  detected using Endpoint Detection and Response (EDR) telemetry, focusing on process
  creation events where the parent process is `excel.exe`. This activity is significant
  because it is uncommon and often associated with malicious actions, such as spearphishing
  attacks. If confirmed malicious, this could allow an attacker to execute scripts,
  potentially leading to code execution, data exfiltration, or further system compromise.
  Immediate investigation and mitigation are recommended.
required_fields:
- _time
- process_name
- process_id
- parent_process_name
- dest
- user
- parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count values(Processes.process) min(_time) as firstTime
  max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name="excel.exe"
  Processes.process_name IN ("cscript.exe", "wscript.exe")  by Processes.parent_process
  Processes.parent_process_name Processes.process_name Processes.user Processes.dest
  | `drop_dm_object_name("Processes")` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)|convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `excel_spawning_windows_script_host_filter`'
