description: The following analytic detects multiple attempts to stop or delete services
  on a system using `net.exe`, `sc.exe`, or `net1.exe`. It leverages Endpoint Detection
  and Response (EDR) telemetry, focusing on process names and command-line executions
  within a one-minute window. This activity is significant as it may indicate an adversary
  attempting to disable security or critical services to evade detection and further
  their objectives. If confirmed malicious, this could lead to the attacker gaining
  persistence, escalating privileges, or disrupting essential services, thereby compromising
  the system's security posture.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` values(Processes.process) as process values(Processes.process_id)
  as process_id count min(_time) as firstTime max(_time) as lastTime  from datamodel=Endpoint.Processes
  where (Processes.process_name="net.exe" OR Processes.original_file_name="net.exe"
  OR Processes.process_name="net1.exe" OR Processes.original_file_name="net1.exe")
  OR  Processes.process_name = "sc.exe" OR  Processes.process_name = "net1.exe" AND
  Processes.process="*stop*" OR Processes.process="*delete*" by Processes.process_name
  Processes.original_file_name Processes.parent_process_name Processes.dest Processes.user
  _time span=1m | where count >=5 | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `excessive_service_stop_attempt_filter`'
