description: The following analytic identifies excessive usage of `cacls.exe`, `xcacls.exe`,
  or `icacls.exe` to change file or folder permissions. It leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process names and command-line
  executions. This activity is significant as it may indicate an adversary attempting
  to restrict access to malware components or artifacts on a compromised system. If
  confirmed malicious, this behavior could prevent users from deleting or accessing
  critical files, aiding in the persistence and concealment of malicious activities.
required_fields:
- _time
- Processes.process
- Processes.process_id
- Processes.process_name
- Processes.parent_process_name
- Processes.dest
- Processes.user
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` values(Processes.process) as process values(Processes.process_id)
  as process_id  values(Processes.process_name) as process_name count min(_time) as
  firstTime max(_time) as lastTime  from datamodel=Endpoint.Processes where Processes.process_name
  = "cacls.exe" OR Processes.process_name = "icacls.exe" OR Processes.process_name
  = "XCACLS.exe" by Processes.parent_process_name Processes.parent_process Processes.dest
  Processes.user _time span=1m | where count >=10 | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `excessive_usage_of_cacls_app_filter`'
