description: The following analytic detects file writes with extensions indicative
  of a SamSam ransomware attack. It leverages file-system activity data to identify
  file names ending in .stubbin, .berkshire, .satoshi, .sophos, or .keyxml. This activity
  is significant because SamSam ransomware is highly destructive, leading to file
  encryption and ransom demands. If confirmed malicious, the impact includes significant
  financial losses, operational disruptions, and reputational damage. Immediate actions
  should include isolating affected systems, restoring files from backups, and investigating
  the attack source to prevent further incidents.
required_fields:
- _time
- Filesystem.user
- Filesystem.dest
- Filesystem.file_path
- Filesystem.file_name
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  values(Filesystem.user) as user values(Filesystem.dest) as dest values(Filesystem.file_path)
  as file_path from datamodel=Endpoint.Filesystem by Filesystem.file_name | `drop_dm_object_name(Filesystem)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)| rex field=file_name "(?<file_extension>\.[^\.]+)$" | search file_extension=.stubbin
  OR file_extension=.berkshire OR file_extension=.satoshi OR file_extension=.sophos
  OR file_extension=.keyxml | `file_with_samsam_extension_filter`'
