description: The following analytic detects the use of the `Get-WMIObject Win32_Group`
  command executed via PowerShell to enumerate local groups on an endpoint. This detection
  leverages data from Endpoint Detection and Response (EDR) agents, focusing on process
  names and command-line executions. Identifying local groups can be a precursor to
  privilege escalation or lateral movement. If confirmed malicious, this activity
  could allow an attacker to map out group memberships, aiding in further exploitation
  or unauthorized access to sensitive resources.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=powershell.exe OR
  processes.process_name=cmd.exe) (Processes.process="*Get-WMIObject*" AND Processes.process="*Win32_Group*")
  by Processes.dest Processes.user Processes.parent_process_name Processes.process_name
  Processes.process Processes.original_file_name Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)|
  convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)  | `get_wmiobject_group_discovery_filter`'
