description: The following analytic detects the execution of the Get-ForestTrust command
  via PowerShell, commonly used by adversaries to gather domain trust information.
  This detection leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process names and command-line executions. Identifying this activity
  is crucial as it indicates potential reconnaissance efforts to map out domain trusts,
  which can inform further attacks. If confirmed malicious, this activity could allow
  attackers to understand domain relationships, aiding in lateral movement and privilege
  escalation within the network.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_name=powershell.exe OR
  Processes.process_name=cmd.exe Processes.process=*get-foresttrust* by Processes.dest
  Processes.user Processes.parent_process_name Processes.process_name Processes.process
  Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `get_foresttrust_with_powershell_filter`'
