description: The following analytic detects the execution of gpupdate.exe without
  command line arguments and with an active network connection. This behavior is identified
  using Endpoint Detection and Response (EDR) telemetry, focusing on process execution
  and network traffic data. It is significant because gpupdate.exe typically runs
  with specific arguments, and its execution without them, especially with network
  activity, is often associated with malicious software like Cobalt Strike. If confirmed
  malicious, this activity could indicate an attacker leveraging gpupdate.exe for
  lateral movement, command and control, or other nefarious purposes, potentially
  leading to system compromise.
required_fields:
- _time
- EventID
- process_name
- process_id
- parent_process_name
- dest_port
- process_path
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Processes where Processes.process_name=gpupdate.exe
  by _time span=1h  Processes.process_id Processes.process_name Processes.dest Processes.user
  Processes.process_path Processes.process Processes.parent_process_name | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | regex process="(?i)(gpupdate\.exe.{0,4}$)"| join  process_id [|
  tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Network_Traffic.All_Traffic
  where All_Traffic.dest_port != 0 by All_Traffic.process_id All_Traffic.dest All_Traffic.dest_port
  | `drop_dm_object_name(All_Traffic)` | rename dest as C2 ] | table _time user dest
  parent_process_name process_name process_path process process_id dest_port C2 |
  `gpupdate_with_no_command_line_arguments_with_network_filter`'
