description: The following analytic detects the usage of headless browsers within
  an organization. It identifies processes containing the "--headless" and "--disable-gpu"
  command line arguments, which are indicative of headless browsing. This detection
  leverages data from the Endpoint.Processes datamodel to identify such processes.
  Monitoring headless browser usage is significant as these tools can be exploited
  by adversaries for malicious activities like web scraping, automated testing, and
  undetected web interactions. If confirmed malicious, this activity could lead to
  unauthorized data extraction, automated attacks, or other covert operations on web
  applications.
required_fields:
- Processes.dest
- Processes.user
- Processes.parent_process
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_id
- sourcetype
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process="*--headless*" AND Processes.process="*--disable-gpu*")
  by Processes.dest Processes.user Processes.parent_process Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)| `headless_browser_usage_filter`'
