description: The following analytic detects a suspicious registry modification that
  hides a user account from the Windows Login screen. It leverages data from the Endpoint.Registry
  data model, specifically monitoring changes to the registry path "*\\Windows NT\\CurrentVersion\\Winlogon\\SpecialAccounts\\Userlist*"
  with a value of "0x00000000". This activity is significant as it may indicate an
  adversary attempting to create a hidden admin account to avoid detection and maintain
  persistence on the compromised machine. If confirmed malicious, this could allow
  the attacker to maintain undetected access and control over the system, posing a
  severe security risk.
required_fields:
- _time
- Registry.dest
- Registry.registry_value_name
- Registry.registry_key_name
- Registry.registry_path
- Registry.registry_value_data
- Registry.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path="*\\Windows NT\\CurrentVersion\\Winlogon\\SpecialAccounts\\Userlist*"
  AND Registry.registry_value_data = "0x00000000") BY Registry.dest Registry.user
  Registry.registry_path Registry.registry_key_name Registry.registry_value_name Registry.registry_value_data
  Registry.process_guid | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `hide_user_account_from_sign_in_screen_filter`'
