description: The following analytic detects the creation of suspicious files named
  passff.tar and cookie.tar, which are indicative of archived stolen browser information
  such as history and cookies on a machine compromised with IcedID. It leverages Sysmon
  EventCode 11 to identify these specific filenames. This activity is significant
  because it suggests that sensitive browser data has been exfiltrated, which could
  lead to further exploitation or data breaches. If confirmed malicious, this could
  allow attackers to access personal information, conduct further phishing attacks,
  or escalate their presence within the network.
required_fields:
- _time
- TargetFilename
- EventCode
- process_id
- process_name
- dest
rule: sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational OR source=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
  OR source=Syslog:Linux-Sysmon/Operational EventCode= 11  (TargetFilename = "*\\passff.tar"
  OR TargetFilename = "*\\cookie.tar") |stats count min(_time) as firstTime max(_time)
  as lastTime by TargetFilename EventCode process_id  process_name dest | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `icedid_exfiltrated_archived_file_creation_filter`
