description: The following analytic identifies suspicious command-line parameters
  associated with the use of Impacket's smbexec.py for lateral movement. It leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on specific command-line
  patterns indicative of Impacket tool usage. This activity is significant as both
  Red Teams and adversaries use Impacket for remote code execution and lateral movement.
  If confirmed malicious, this activity could allow attackers to execute commands
  on remote endpoints, potentially leading to unauthorized access, data exfiltration,
  or further compromise of the network.
required_fields:
- Processes.process_name
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_name=cmd.exe by Processes.dest
  Processes.user Processes.parent_process_name Processes.process_name Processes.process
  Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | where match(process, "(?i)cmd\.exe\s+\/Q\s+\/c") AND match(process,"(?i)echo\s+cd")
  AND match(process, "(?i)\\__output") AND  match(process, "(?i)C:\\\\Windows\\\\[a-zA-Z]{1,8}\\.bat")  AND
  match(process, "\\\\127\.0\.0\.1\\.*") | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `impacket_lateral_movement_smbexec_commandline_parameters_filter`'
