description: The following analytic detects the suspicious editing of cron jobs in
  Linux using the crontab command-line parameter (-e). It identifies this activity
  by monitoring command-line executions involving 'crontab' and the edit parameter.
  This behavior is significant for a SOC as cron job manipulations can indicate unauthorized
  persistence attempts or scheduled malicious actions. If confirmed malicious, this
  activity could lead to system compromise, unauthorized access, or broader network
  compromise.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_name = crontab Processes.process
  = "*crontab *" Processes.process = "* -e*" by Processes.dest Processes.user Processes.parent_process_name
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `linux_edit_cron_table_parameter_filter`'
