description: The following analytic detects suspicious command-line activity that
  modifies the iptables firewall settings on a Linux machine. It leverages data from
  Endpoint Detection and Response (EDR) agents, focusing on specific command patterns
  that alter firewall rules to accept traffic on certain TCP ports. This activity
  is significant as it can indicate malware, such as CyclopsBlink, modifying firewall
  settings to allow communication with a Command and Control (C2) server. If confirmed
  malicious, this could enable attackers to maintain persistent access and exfiltrate
  data, posing a severe security risk.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process = "*iptables *" AND Processes.process
  = "* --dport *" AND Processes.process = "* ACCEPT*" AND Processes.process = "*&amp;&gt;/dev/null*"
  AND Processes.process = "* tcp *" AND NOT(Processes.parent_process_path IN("/bin/*",
  "/lib/*", "/usr/bin/*", "/sbin/*")) by Processes.process_name Processes.process
  Processes.process_id Processes.parent_process_id Processes.process_guid Processes.dest
  _time span=10s Processes.user Processes.parent_process_name Processes.parent_process_path
  Processes.process_path | rex field=Processes.process "--dport (?<port>3269|636|989|994|995|8443)"
  | stats values(Processes.process) as processes_exec values(port) as ports values(Processes.process_guid)
  as guids values(Processes.process_id) as pids dc(port) as port_count count by Processes.process_name
  Processes.parent_process_name Processes.parent_process_id Processes.dest Processes.user
  Processes.parent_process_path Processes.process_path | where port_count >=3 | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `linux_iptables_firewall_modification_filter`'
