description: The following analytic detects the use of Ngrok on a Linux operating
  system. It leverages data from Endpoint Detection and Response (EDR) agents, focusing
  on process names and command-line arguments associated with Ngrok. This activity
  is significant because Ngrok can be used by adversaries to establish reverse proxies,
  potentially bypassing network defenses. If confirmed malicious, this could allow
  attackers to create persistent, unauthorized access channels, facilitating data
  exfiltration or further exploitation of the compromised system.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_name=ngrok Processes.process
  IN ("*start*", "*--config*","*http*","*authtoken*", "*http*", "*tcp*") by Processes.dest
  Processes.user Processes.parent_process_name Processes.process_name Processes.original_file_name
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `linux_ngrok_reverse_proxy_usage_filter`'
