description: The following analytic detects the use of the 'make' command with elevated
  privileges to execute system commands as root, potentially leading to a root shell.
  It leverages data from Endpoint Detection and Response (EDR) agents, focusing on
  command-line executions that include 'make', '--eval', and 'sudo'. This activity
  is significant because it indicates a possible privilege escalation attempt, allowing
  a user to gain root access. If confirmed malicious, an attacker could achieve full
  control over the system, execute arbitrary commands, and compromise the entire environment.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process="*make*-s*" AND Processes.process="*--eval*"
  AND Processes.process="*sudo*" by Processes.dest Processes.user Processes.parent_process_name
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  Processes.process_guid | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `linux_make_privilege_escalation_filter`'
