description: The following analytic detects the use of the base64 decode command on
  Linux systems, which is often used to deobfuscate files. It leverages data from
  Endpoint Detection and Response (EDR) agents, focusing on command-line executions
  that include "base64 -d" or "base64 --decode". This activity is significant as it
  may indicate an attempt to hide malicious payloads or scripts. If confirmed malicious,
  an attacker could use this technique to execute hidden code, potentially leading
  to unauthorized access, data exfiltration, or further system compromise.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_path="*/base64" Processes.process="*-d*"
  by Processes.process Processes.dest Processes.process_current_directory Processes.process_name
  Processes.process_integrity_level Processes.parent_process_name Processes.parent_process_path
  Processes.parent_process_guid Processes.parent_process_id Processes.process_guid
  Processes.process_id Processes.user | `drop_dm_object_name(Processes)` | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `linux_obfuscated_files_or_information_base64_decode_filter`'
