description: The following analytic identifies potential Linux persistence and privilege
  escalation activities. It leverages risk scores and event counts from various Linux-related
  data sources, focusing on tactics associated with persistence and privilege escalation.
  This activity is significant for a SOC because it highlights behaviors that could
  allow an attacker to maintain access or gain elevated privileges on a Linux system.
  If confirmed malicious, this activity could enable an attacker to execute code with
  higher privileges, persist in the environment, and potentially access sensitive
  information, posing a severe security risk.
required_fields:
- _time
- All_Risk.analyticstories
- All_Risk.risk_object_type
- All_Risk.risk_object
- All_Risk.annotations.mitre_attack.mitre_tactic
- source
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` min(_time) as firstTime max(_time) as lastTime
  sum(All_Risk.calculated_risk_score) as risk_score, count(All_Risk.calculated_risk_score)
  as risk_event_count, values(All_Risk.annotations.mitre_attack.mitre_tactic_id) as
  annotations.mitre_attack.mitre_tactic_id, dc(All_Risk.annotations.mitre_attack.mitre_tactic_id)
  as mitre_tactic_id_count, values(All_Risk.annotations.mitre_attack.mitre_technique_id)
  as annotations.mitre_attack.mitre_technique_id, dc(All_Risk.annotations.mitre_attack.mitre_technique_id)
  as mitre_technique_id_count, values(All_Risk.tag) as tag, values(source) as source,
  dc(source) as source_count from datamodel=Risk.All_Risk where (All_Risk.analyticstories
  IN ("Linux Privilege Escalation", "Linux Persistence Techniques") OR source = "*Linux*")
  All_Risk.annotations.mitre_attack.mitre_tactic IN ("persistence", "privilege-escalation")
  All_Risk.risk_object_type="system" by All_Risk.risk_object All_Risk.risk_object_type
  All_Risk.annotations.mitre_attack.mitre_tactic | `drop_dm_object_name(All_Risk)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | where source_count >= 4 | `linux_persistence_and_privilege_escalation_risk_behavior_filter`'
