description: The following analytic detects the use of the curl command with specific
  switches (-O, -sO, -ksO, --output) commonly used to download remote scripts or binaries.
  This detection leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process names and command-line arguments. This activity is significant
  as it may indicate an attempt to download and execute potentially malicious files,
  often used in initial stages of an attack. If confirmed malicious, this could lead
  to unauthorized code execution, enabling attackers to compromise the system further.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_name=curl by Processes.dest
  Processes.user Processes.parent_process_name Processes.process_name Processes.process
  Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | where match(process, "(?i)(-O|-sO|-ksO|--output)") | `linux_ingress_tool_transfer_with_curl_filter`'
