description: The following correlation identifies multiple risk events associated
  with the "Living Off The Land" analytic story, indicating potentially suspicious
  behavior. It leverages the Risk data model to aggregate and correlate events tagged
  under this story, focusing on systems with a high count of distinct sources. This
  activity is significant as it often involves the use of legitimate tools for malicious
  purposes, making detection challenging. If confirmed malicious, this behavior could
  allow attackers to execute code, escalate privileges, or persist within the environment
  using trusted system utilities.
required_fields:
- _time
- All_Risk.analyticstories
- All_Risk.risk_object_type
- All_Risk.risk_object
- All_Risk.annotations.mitre_attack.mitre_tactic
- source
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` min(_time) as firstTime max(_time) as lastTime
  sum(All_Risk.calculated_risk_score) as risk_score, count(All_Risk.calculated_risk_score)
  as risk_event_count, values(All_Risk.annotations.mitre_attack.mitre_tactic_id) as
  annotations.mitre_attack.mitre_tactic_id, dc(All_Risk.annotations.mitre_attack.mitre_tactic_id)
  as mitre_tactic_id_count, values(All_Risk.annotations.mitre_attack.mitre_technique_id)
  as annotations.mitre_attack.mitre_technique_id, dc(All_Risk.annotations.mitre_attack.mitre_technique_id)
  as mitre_technique_id_count, values(All_Risk.tag) as tag, values(source) as source,
  dc(source) as source_count from datamodel=Risk.All_Risk where All_Risk.analyticstories="Living
  Off The Land" All_Risk.risk_object_type="system" by All_Risk.risk_object All_Risk.risk_object_type
  All_Risk.annotations.mitre_attack.mitre_tactic | `drop_dm_object_name(All_Risk)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | where source_count >= 5 | `living_off_the_land_detection_filter`'
