description: The following analytic detects PowerShell processes launched with command-line
  arguments indicative of obfuscation techniques. It leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process names, parent processes,
  and complete command-line executions. This activity is significant because obfuscated
  PowerShell commands are often used by attackers to evade detection and execute malicious
  scripts. If confirmed malicious, this activity could lead to unauthorized code execution,
  privilege escalation, or persistent access within the environment, posing a significant
  security risk.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count values(Processes.process) as process values(Processes.parent_process)
  as parent_process min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where (Processes.process_name=pwsh.exe OR Processes.process_name=sqlps.exe OR Processes.process_name=sqltoolsps.exe
  OR Processes.process_name=powershell.exe OR Processes.process_name=powershell_ise.exe
  OR Processes.original_file_name=pwsh.dll OR Processes.original_file_name=PowerShell.EXE
  OR Processes.original_file_name=powershell_ise.EXE) by Processes.user Processes.process_name
  Processes.original_file_name Processes.parent_process_name Processes.dest Processes.process
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)|
  convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| eval num_obfuscation = (mvcount(split(process,"`"))-1)
  + (mvcount(split(process, "^"))-1) + (mvcount(split(process, "''"))-1) | `malicious_powershell_process_with_obfuscation_techniques_filter`
  | search num_obfuscation > 10'
