description: The following analytic detects the use of the EncodedCommand parameter
  in PowerShell processes. It leverages Endpoint Detection and Response (EDR) data
  to identify variations of the EncodedCommand parameter, including shortened forms
  and different command switch types. This activity is significant because adversaries
  often use encoded commands to obfuscate malicious scripts, making detection harder.
  If confirmed malicious, this behavior could allow attackers to execute hidden code,
  potentially leading to unauthorized access, privilege escalation, or persistent
  threats within the environment. Review parallel events to determine legitimacy and
  tune based on known administrative scripts.
required_fields:
- _time
- Processes.process_name
- Processes.process
- Processes.user
- Processes.parent_process_name
- Processes.dest
- Processes.process_id
rule: "| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`\
  \ fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime\
  \ from datamodel=Endpoint.Processes where (Processes.process_name=pwsh.exe OR Processes.process_name=sqlps.exe\
  \ OR Processes.process_name=sqltoolsps.exe OR Processes.process_name=powershell.exe\
  \ OR Processes.process_name=powershell_ise.exe OR Processes.original_file_name=pwsh.dll\
  \ OR Processes.original_file_name=PowerShell.EXE OR Processes.original_file_name=powershell_ise.EXE)\
  \ by Processes.user Processes.process_name Processes.process Processes.parent_process_name\
  \ Processes.original_file_name Processes.dest Processes.process_id | `drop_dm_object_name(Processes)`\
  \ | convert timeformat=\"%Y-%m-%dT%H:%M:%S\" ctime($field$) | convert timeformat=\"\
  %Y-%m-%dT%H:%M:%S\" ctime($field$) | where match(process,\"(?i)[\\-|\\/|\u2013|\u2014\
  |\u2015][Ee^]{1,2}[NnCcOoDdEeMmAa^]+\\s+[\\\"]?[A-Za-z0-9+/=]{5,}[\\\"]?\") | `malicious_powershell_process___encoded_command_filter`"
