description: The following analytic detects a process modifying the registry with
  a known malicious CLSID under InProcServer32. It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on registry modifications within the HKLM or
  HKCU Software Classes CLSID paths. This activity is significant as it may indicate
  an attempt to load a malicious DLL, potentially leading to code execution. If confirmed
  malicious, this could allow an attacker to persist in the environment, execute arbitrary
  code, or escalate privileges, posing a severe threat to system integrity and security.
required_fields:
- _time
- dest
- process_name
- registry_path
- registry_key_name
- registry_value_name
- user
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Processes by _time
  Processes.process_id Processes.process_name Processes.dest Processes.process_guid
  Processes.user | `drop_dm_object_name(Processes)` | join process_guid [| tstats
  summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config` fillnull_value=`fillnull_config`
  count FROM datamodel=Endpoint.Registry where Registry.registry_path= "*\\CLSID\\{89565275-A714-4a43-912E-978B935EDCCC}\\InProcServer32\\(Default)"
  by Registry.registry_path Registry.registry_key_name Registry.registry_value_name
  Registry.dest Registry.process_guid Registry.user | `drop_dm_object_name(Registry)`
  | fields _time dest registry_path registry_key_name registry_value_name process_name
  process_path process process_guid user] | stats count min(_time) as firstTime max(_time)
  as lastTime by dest, process_name registry_path registry_key_name registry_value_name
  user | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `malicious_inprocserver32_modification_filter`'
