description: The following analytic identifies the creation of suspicious .aspx files
  in specific directories associated with Exchange exploitation by the HAFNIUM group
  and the ProxyShell vulnerability. It detects this activity by monitoring the MSExchangeMailboxReplication.exe
  process, which typically does not write .aspx files. This behavior is significant
  as it may indicate an active exploitation attempt on Exchange servers. If confirmed
  malicious, attackers could gain unauthorized access, execute arbitrary code, or
  maintain persistence within the environment. Immediate investigation and remediation
  are crucial to prevent further compromise.
required_fields:
- _time
- Filesystem.file_path
- Filesystem.process_id
- Filesystem.file_name
- Filesystem.file_hash
- Filesystem.user
- Filesystem.process_guid
- Processes.process_name
- Processes.process_id
- Processes.process_name
- Processes.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Processes where Processes.process_name=MSExchangeMailboxReplication.exe  by
  _time span=1h Processes.process_id Processes.process_name Processes.process_guid
  Processes.dest | `drop_dm_object_name(Processes)` | join process_guid, _time [|
  tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Filesystem where Filesystem.file_path IN ("*\\HttpProxy\\owa\\auth\\*",
  "*\\inetpub\\wwwroot\\aspnet_client\\*", "*\\HttpProxy\\OAB\\*") Filesystem.file_name="*.aspx"
  by _time span=1h Filesystem.dest Filesystem.file_create_time Filesystem.file_name
  Filesystem.file_path | `drop_dm_object_name(Filesystem)` | fields _time dest file_create_time
  file_name file_path process_name process_path process process_guid] | dedup file_create_time
  | table dest file_create_time, file_name, file_path, process_name | `ms_exchange_mailbox_replication_service_writing_active_server_pages_filter`'
