description: The following analytic detects the execution of MS scripting processes
  (wscript.exe or cscript.exe) loading LDAP-related modules (Wldap32.dll, adsldp.dll,
  adsldpc.dll). It leverages Sysmon EventCode 7 to identify these specific DLL loads.
  This activity is significant as it may indicate an attempt to query LDAP for host
  information, a behavior observed in FIN7 implants. If confirmed malicious, this
  could allow attackers to gather detailed Active Directory information, potentially
  leading to further exploitation or data exfiltration.
required_fields:
- _time
- Image
- EventCode
- process_name
- ProcessId
- ProcessGuid
- dest
- ImageLoaded
rule: sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational OR source=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
  OR source=Syslog:Linux-Sysmon/Operational EventCode =7 Image IN ("*\\wscript.exe",
  "*\\cscript.exe") ImageLoaded IN ("*\\Wldap32.dll", "*\\adsldp.dll", "*\\adsldpc.dll")
  | stats min(_time) as firstTime max(_time) as lastTime count by Image EventCode
  process_name ProcessId ProcessGuid Computer ImageLoaded | rename Computer as dest
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `ms_scripting_process_loading_ldap_module_filter`
