description: The following analytic detects the loading of the mshtml.dll module into
  an Office product, which is indicative of CVE-2021-40444 exploitation. It leverages
  Sysmon EventID 7 to monitor image loads by specific Office processes. This activity
  is significant because it can indicate an attempt to exploit a vulnerability in
  the MSHTML component via a malicious document. If confirmed malicious, this could
  allow an attacker to execute arbitrary code, potentially leading to system compromise,
  data exfiltration, or further network penetration.
required_fields:
- _time
- ImageLoaded
- process_name
- OriginalFileName
- process_id
- dest
rule: sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational OR source=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
  OR source=Syslog:Linux-Sysmon/Operational EventID=7 process_name IN ("winword.exe","excel.exe","powerpnt.exe","mspub.exe","visio.exe","wordpad.exe","wordview.exe","onenote.exe","onenotem.exe","onenoteviewer.exe","onenoteim.exe",
  "msaccess.exe","Graph.exe","winproj.exe") loaded_file_path IN ("*\\mshtml.dll",
  "*\\Microsoft.mshtml.dll","*\\IE.Interop.MSHTML.dll","*\\MshtmlDac.dll","*\\MshtmlDed.dll","*\\MshtmlDer.dll")
  | stats count min(_time) as firstTime max(_time) as lastTime by user_id, dest, process_name,
  loaded_file, loaded_file_path, original_file_name, process_guid | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `mshtml_module_load_in_office_product_filter`
