description: The following analytic detects modifications to the registry aimed at
  bypassing the User Account Control (UAC) feature in Windows. It identifies changes
  to the .NET COR_PROFILER_PATH registry key, which can be exploited to load a malicious
  DLL via mmc.exe. This detection leverages data from the Endpoint.Registry datamodel,
  focusing on specific registry paths and values. Monitoring this activity is crucial
  as it can indicate an attempt to escalate privileges or persist within the environment.
  If confirmed malicious, this could allow an attacker to execute arbitrary code with
  elevated privileges, compromising system integrity.
required_fields:
- _time
- Registry.registry_path
- Registry.registry_key_name
- Registry.registry_value_name
- Registry.dest
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Registry where Registry.registry_path= "*\\Environment\\COR_PROFILER_PATH"
  Registry.registry_value_data = "*.dll" by Registry.registry_path Registry.registry_key_name
  Registry.registry_value_data Registry.dest | `drop_dm_object_name(Registry)` | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `net_profiler_uac_bypass_filter`'
