description: The following analytic identifies network traffic directed to the Active
  Directory Web Services Protocol (ADWS) on port 9389. It leverages network traffic
  logs, focusing on source and destination IP addresses, application names, and destination
  ports. This activity is significant as ADWS is used to manage Active Directory,
  and unauthorized access could indicate malicious intent. If confirmed malicious,
  an attacker could manipulate Active Directory, potentially leading to privilege
  escalation, unauthorized access, or persistent control over the environment.
required_fields:
- All_Traffic.src_ip
- All_Traffic.dest_ip
- All_Traffic.app
- All_Traffic.user
- All_Traffic.dest_port
rule: '| tstats count from datamodel=Network_Traffic where All_Traffic.dest_port=9389
  by All_Traffic.src_ip, All_Traffic.dest_ip, All_Traffic.app, All_Traffic.user, All_Traffic.dest_port
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `drop_dm_object_name("All_Traffic")` | `network_traffic_to_active_directory_web_services_protocol_filter`'
