description: The following analytic identifies instances where Notepad.exe is launched
  without any command line arguments, a behavior commonly associated with the SliverC2
  framework. This detection leverages process creation events from Endpoint Detection
  and Response (EDR) agents, focusing on processes initiated by Notepad.exe within
  a short time frame. This activity is significant as it may indicate an attempt to
  inject malicious code into Notepad.exe, a known tactic for evading detection. If
  confirmed malicious, this could allow an attacker to execute arbitrary code, potentially
  leading to system compromise and unauthorized access.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Processes where Processes.process_name=notepad.exe AND Processes.action!="blocked"
  by host _time span=1h Processes.process_id Processes.process_name Processes.dest
  Processes.process_path Processes.process Processes.parent_process_name Processes.parent_process
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | regex process="(?i)(notepad\.exe.{0,4}$)"
  | `notepad_with_no_command_line_arguments_filter`'
