description: The following analytic detects Office products writing .cab or .inf files,
  indicative of CVE-2021-40444 exploitation. It leverages the Endpoint.Processes and
  Endpoint.Filesystem data models to identify Office applications creating these file
  types. This activity is significant as it may signal an attempt to load malicious
  ActiveX controls and download remote payloads, a known attack vector. If confirmed
  malicious, this could lead to remote code execution, allowing attackers to gain
  control over the affected system and potentially compromise sensitive data.
required_fields:
- _time
- dest
- process_name
- process
- file_create_time
- file_name
- file_path
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Processes where Processes.process_name
  IN ("winword.exe","excel.exe","powerpnt.exe","mspub.exe","visio.exe","wordpad.exe","wordview.exe","onenote.exe","onenotem.exe","onenoteviewer.exe","onenoteim.exe","msaccess.exe")
  by _time span=1h Processes.process_id Processes.process_name Processes.process Processes.dest
  Processes.process_guid | `drop_dm_object_name(Processes)` |rename process_guid as
  proc_guid | join proc_guid, _time [ | tstats summariesonly=`summariesonly_config`
  allow_old_summaries=`oldsummaries_config` fillnull_value=`fillnull_config` count
  min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Filesystem
  where Filesystem.file_name IN ("*.inf","*.cab") by _time span=1h Filesystem.dest
  Filesystem.file_create_time Filesystem.file_name Filesystem.file_path Filesystem.process_guid
  | `drop_dm_object_name(Filesystem)` |rename process_guid as proc_guid | fields _time
  dest file_create_time file_name file_path process_name process_path process proc_guid]
  | dedup file_create_time | table dest, process_name, process, file_create_time,
  file_name, file_path, proc_guid | `office_product_writing_cab_or_inf_filter`'
