description: The following analytic detects an Office product spawning WScript.exe
  or CScript.exe. It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process creation events where Office applications are the parent processes.
  This activity is significant because it may indicate the execution of potentially
  malicious scripts through Office products, a common tactic in phishing attacks and
  malware delivery. If confirmed malicious, this behavior could lead to unauthorized
  code execution, data exfiltration, or further system compromise.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.parent_process_name IN ("winword.exe","excel.exe","powerpnt.exe","mspub.exe","visio.exe","onenote.exe","onenotem.exe","onenoteviewer.exe","onenoteim.exe",
  "msaccess.exe","Graph.exe","winproj.exe") Processes.process_name IN ("wscript.exe",
  "cscript.exe") by  Processes.dest Processes.user Processes.parent_process_name Processes.parent_process
  Processes.process_name Processes.original_file_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `office_product_spawning_windows_script_host_filter`'
