description: The following analytic identifies office documents executing macro code.
  It leverages Sysmon EventCode 7 to detect when processes like WINWORD.EXE or EXCEL.EXE
  load specific DLLs associated with macros (e.g., VBE7.DLL). This activity is significant
  because macros are a common attack vector for delivering malicious payloads, such
  as malware. If confirmed malicious, this could lead to unauthorized code execution,
  data exfiltration, or further compromise of the system. Disabling macros by default
  is recommended to mitigate this risk.
required_fields:
- ImageLoaded
- AllImageLoaded
- dest
- EventCode
- Image
- process_name
- ProcessId
- ProcessGuid
- _time
rule: sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational OR source=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
  OR source=Syslog:Linux-Sysmon/Operational EventCode=7 process_name IN ("WINWORD.EXE",
  "EXCEL.EXE", "POWERPNT.EXE","onenote.exe","onenotem.exe","onenoteviewer.exe","onenoteim.exe","msaccess.exe")
  loaded_file_path IN ("*\\VBE7INTL.DLL","*\\VBE7.DLL", "*\\VBEUI.DLL") | stats min(_time)
  as firstTime max(_time) as lastTime values(loaded_file) as loaded_file count by
  dest EventCode process_name process_guid | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `office_document_executing_macro_code_filter`
