description: The following analytic identifies instances where `control.exe` is spawned
  by a Microsoft Office product. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process and parent process relationships. This activity
  is significant because it can indicate exploitation attempts related to CVE-2021-40444,
  where `control.exe` is used to execute malicious .cpl or .inf files. If confirmed
  malicious, this behavior could allow an attacker to execute arbitrary code, potentially
  leading to system compromise, data exfiltration, or further lateral movement within
  the network.
required_fields:
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.parent_process_name IN ("winword.exe","excel.exe","powerpnt.exe","mspub.exe","visio.exe","wordpad.exe","wordview.exe","onenote.exe","onenotem.exe","onenoteviewer.exe","onenoteim.exe","msaccess.exe")
  Processes.process_name=control.exe by Processes.dest Processes.user Processes.parent_process_name
  Processes.parent_process Processes.process_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| `office_spawning_control_filter`'
