description: "The following analytic detects outbound network connections from Java\
  \ processes to default ports used by LDAP and RMI protocols, which may indicate\
  \ exploitation of the CVE-2021-44228-Log4j vulnerability. This detection leverages\
  \ data from Endpoint Detection and Response (EDR) agents, focusing on process and\
  \ network traffic logs. Monitoring this activity is crucial as it can signify an\
  \ attacker\u2019s attempt to perform JNDI lookups and retrieve malicious payloads.\
  \ If confirmed malicious, this activity could lead to remote code execution and\
  \ further compromise of the affected server."
required_fields:
- _time
- Processes.process_id
- Processes.process_name
- Processes.dest
- Processes.process_path
- Processes.process
- Processes.parent_process_name
- All_Traffic.process_id
- All_Traffic.dest
- All_Traffic.dest_port
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Processes where (Processes.process_name="java.exe"
  OR Processes.process_name=javaw.exe OR Processes.process_name=javaw.exe) by _time
  Processes.process_id Processes.process_name Processes.dest Processes.process_path
  Processes.process Processes.parent_process_name | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | join process_id [| tstats summariesonly=`summariesonly_config`
  allow_old_summaries=`oldsummaries_config` fillnull_value=`fillnull_config` count
  FROM datamodel=Network_Traffic.All_Traffic where (All_Traffic.dest_port= 389 OR
  All_Traffic.dest_port= 636 OR All_Traffic.dest_port = 1389 OR All_Traffic.dest_port
  = 1099 ) by All_Traffic.process_id All_Traffic.dest All_Traffic.dest_port | `drop_dm_object_name(All_Traffic)`
  | rename dest as connection_to_CNC] | table _time dest parent_process_name process_name
  process_path process connection_to_CNC dest_port| `outbound_network_connection_from_java_using_default_ports_filter`'
