description: The following analytic detects modifications to Windows accessibility
  binaries such as sethc.exe, utilman.exe, osk.exe, Magnify.exe, Narrator.exe, DisplaySwitch.exe,
  and AtBroker.exe. It leverages filesystem activity data from the Endpoint.Filesystem
  data model to identify changes to these specific files. This activity is significant
  because adversaries can exploit these binaries to gain unauthorized access or execute
  commands without logging in. If confirmed malicious, this could allow attackers
  to bypass authentication mechanisms, potentially leading to unauthorized system
  access and further compromise of the environment.
required_fields:
- _time
- Filesystem.dest
- Filesystem.file_path
- Filesystem.file_name
- Filesystem.dest
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  values(Filesystem.user) as user values(Filesystem.dest) as dest values(Filesystem.file_path)
  as file_path from datamodel=Endpoint.Filesystem where (Filesystem.file_path=*\\Windows\\System32\\sethc.exe*
  OR Filesystem.file_path=*\\Windows\\System32\\utilman.exe* OR Filesystem.file_path=*\\Windows\\System32\\osk.exe*
  OR Filesystem.file_path=*\\Windows\\System32\\Magnify.exe* OR Filesystem.file_path=*\\Windows\\System32\\Narrator.exe*
  OR Filesystem.file_path=*\\Windows\\System32\\DisplaySwitch.exe* OR Filesystem.file_path=*\\Windows\\System32\\AtBroker.exe*)
  by Filesystem.file_name Filesystem.dest | `drop_dm_object_name(Filesystem)` | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `overwriting_accessibility_binaries_filter`'
