description: The following analytic identifies the execution of ping sleep batch commands.
  It leverages data from Endpoint Detection and Response (EDR) agents, focusing on
  process and parent process command-line details. This activity is significant as
  it indicates an attempt to delay malicious code execution, potentially evading detection
  or sandbox analysis. If confirmed malicious, this technique allows attackers to
  bypass security measures, making it harder to detect and analyze their activities,
  thereby increasing the risk of prolonged unauthorized access and potential data
  exfiltration.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=ping.exe OR Processes.original_file_name=ping.exe)
  (Processes.parent_process = "*ping*" Processes.parent_process = *-n* Processes.parent_process="*
  Nul*"Processes.parent_process="*&gt;*") OR (Processes.process = "*ping*" Processes.process
  = *-n* Processes.process="* Nul*"Processes.process="*&gt;*") by Processes.parent_process_name
  Processes.parent_process Processes.process_name Processes.original_file_name Processes.process
  Processes.process_id Processes.process_guid Processes.user Processes.dest | `drop_dm_object_name("Processes")`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) |convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `ping_sleep_batch_command_filter`'
