description: The following analytic detects PowerShell commands using the WindowStyle
  parameter to hide the window while connecting to the Internet. This behavior is
  identified through Endpoint Detection and Response (EDR) telemetry, focusing on
  command-line executions that include variations of the WindowStyle parameter. This
  activity is significant because it attempts to bypass default PowerShell execution
  policies and conceal its actions, which is often indicative of malicious intent.
  If confirmed malicious, this could allow an attacker to execute commands stealthily,
  potentially leading to unauthorized data exfiltration or further compromise of the
  endpoint.
required_fields:
- _time
- Processes.process
- Processes.process_name
- Processes.user
- Processes.parent_process_name
- Processes.dest
rule: "| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`\
  \ fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime\
  \ from datamodel=Endpoint.Processes where (Processes.process_name=pwsh.exe OR Processes.process_name=sqlps.exe\
  \ OR Processes.process_name=sqltoolsps.exe OR Processes.process_name=powershell.exe\
  \ OR Processes.process_name=powershell_ise.exe OR Processes.original_file_name=pwsh.dll\
  \ OR Processes.original_file_name=PowerShell.EXE OR Processes.original_file_name=powershell_ise.EXE)\
  \ by Processes.user Processes.process_name Processes.process Processes.parent_process_name\
  \ Processes.original_file_name Processes.dest Processes.process_id | `drop_dm_object_name(Processes)`\
  \ | convert timeformat=\"%Y-%m-%dT%H:%M:%S\" ctime($field$) | convert timeformat=\"\
  %Y-%m-%dT%H:%M:%S\" ctime($field$) | where match(process,\"(?i)[\\-|\\/|\u2013 |\u2014\
  |\u2015]w(in*d*o*w*s*t*y*l*e*)*\\s+[^-]\") | `powershell___connect_to_internet_with_hidden_window_filter`"
