description: The following analytic detects the execution of the PowerShell command
  `Start-BitsTransfer`, which can be used for file transfers, including potential
  data exfiltration. It leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on process creation events and command-line arguments. This activity
  is significant because `Start-BitsTransfer` can be abused by adversaries to upload
  sensitive files to remote locations, posing a risk of data loss. If confirmed malicious,
  this could lead to unauthorized data exfiltration, compromising sensitive information
  and potentially leading to further exploitation of the network.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=pwsh.exe OR Processes.process_name=sqlps.exe
  OR Processes.process_name=sqltoolsps.exe OR Processes.process_name=powershell.exe
  OR Processes.process_name=powershell_ise.exe OR Processes.original_file_name=pwsh.dll
  OR Processes.original_file_name=PowerShell.EXE OR Processes.original_file_name=powershell_ise.EXE)
  Processes.process=*start-bitstransfer* by Processes.dest Processes.user Processes.parent_process
  Processes.process_name Processes.process Processes.process_id Processes.original_file_name
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `powershell_start_bitstransfer_filter`'
