description: The following analytic identifies the use of the `get-localgroup` command
  executed via PowerShell or cmd.exe to enumerate local groups on an endpoint. This
  detection leverages data from Endpoint Detection and Response (EDR) agents, focusing
  on process names and command-line arguments. Monitoring this activity is significant
  as it may indicate an attacker attempting to gather information about local group
  memberships, which can be a precursor to privilege escalation. If confirmed malicious,
  this activity could allow an attacker to identify and target privileged accounts,
  potentially leading to unauthorized access and control over the system.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=powershell.exe OR
  Processes.process_name=cmd.exe) (Processes.process="*get-localgroup*") by Processes.dest
  Processes.user Processes.parent_process_name Processes.process_name Processes.process
  Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `powershell_get_localgroup_discovery_filter`'
