description: The following analytic identifies a process attempting to delete its
  own file path, a behavior often associated with defense evasion techniques. This
  detection leverages Sysmon EventCode 1 logs, focusing on command lines executed
  via cmd.exe that include deletion commands. This activity is significant as it may
  indicate malware, such as Clop ransomware, trying to evade detection by removing
  its executable file if certain conditions are met. If confirmed malicious, this
  could allow the attacker to persist undetected, complicating incident response and
  remediation efforts.
required_fields:
- EventCode
- dest
- user
- ParentImage
- ParentCommandLine
- Image
- cmdline
- ProcessID
- result
- _time
rule: sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational OR source=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
  OR source=Syslog:Linux-Sysmon/Operational EventCode=1 CommandLine = "* /c *" CommandLine
  = "* del*" Image = "*\\cmd.exe" | eval result = if(like(process,"%".parent_process."%"),
  "Found", "Not Found") | stats min(_time) as firstTime max(_time) as lastTime count
  by dest user ParentImage ParentCommandLine Image CommandLine EventCode ProcessID
  result | where result = "Found" | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `process_deleting_its_process_file_path_filter`
