description: The following analytic detects a process creating a `.lnk` file in suspicious
  locations such as `C:\User*` or `*\Local\Temp\*`. It leverages filesystem and process
  activity data from the Endpoint data model to identify this behavior. This activity
  is significant because creating `.lnk` files in these directories is a common tactic
  used by spear phishing tools to establish persistence or execute malicious payloads.
  If confirmed malicious, this could allow an attacker to maintain persistence, execute
  arbitrary code, or further compromise the system.
required_fields:
- _time
- Filesystem.file_name
- Filesystem.file_path
- Filesystem.process_id
- Filesystem.file_name
- Filesystem.file_path
- Filesystem.file_hash
- Filesystem.user
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Filesystem where Filesystem.file_name="*.lnk" AND (Filesystem.file_path="C:\\Users\\*"
  OR Filesystem.file_path="*\\Temp\\*") by _time span=1h Filesystem.process_guid Filesystem.file_name
  Filesystem.file_path Filesystem.file_hash Filesystem.user | `drop_dm_object_name(Filesystem)`
  | rename process_guid as lnk_guid | join lnk_guid _time [| tstats summariesonly=`summariesonly_config`
  allow_old_summaries=`oldsummaries_config` fillnull_value=`fillnull_config` count
  FROM datamodel=Endpoint.Processes where Processes.process_name=* by _time span=1h
  Processes.parent_process_name Processes.parent_process_guid Processes.process_name
  Processes.dest Processes.process Processes.path | `drop_dm_object_name(Processes)`
  | rename parent_process_guid as lnk_guid] | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | table firstTime,
  lastTime, lnk_guid, user, dest, file_name, file_path, process_name, process, process_path,
  file_hash | `process_creating_lnk_file_in_suspicious_location_filter`'
