description: The following analytic detects the execution of a batch command designed
  to recursively delete files or directories, a technique often used by ransomware
  like Reddot to delete files in the recycle bin and prevent recovery. It leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on command-line
  executions that include specific flags for recursive and quiet deletions. This activity
  is significant as it indicates potential ransomware behavior aimed at data destruction.
  If confirmed malicious, it could lead to significant data loss and hinder recovery
  efforts, severely impacting business operations.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=cmd.exe OR Processes.original_file_name=Cmd.Exe)
  Processes.process=*/c*  Processes.process="* rd *"  Processes.process="*/s*" Processes.process="*/q*"
  by Processes.user Processes.process_name Processes.parent_process_name Processes.parent_process
  Processes.process Processes.process_id Processes.dest |`drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `recursive_delete_of_directory_in_batch_cmd_filter`'
