description: The following analytic detects the use of reg.exe to modify registry
  keys associated with Windows services and their configurations. It leverages data
  from Endpoint Detection and Response (EDR) agents, focusing on process names, parent
  processes, and command-line executions. This activity is significant because unauthorized
  changes to service registry keys can indicate an attempt to establish persistence
  or escalate privileges. If confirmed malicious, this could allow an attacker to
  control service behavior, potentially leading to unauthorized code execution or
  system compromise.
required_fields:
- _time
- Processes.process_name
- Processes.parent_process_name
- Processes.user
- Processes.process
- Processes.process_id
- Processes.dest
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  values(Processes.process_name) as process_name values(Processes.parent_process_name)
  as parent_process_name values(Processes.user) as user FROM datamodel=Endpoint.Processes
  where Processes.process_name=reg.exe Processes.process=*reg* Processes.process=*add*
  Processes.process=*Services* by Processes.process_id Processes.dest Processes.process
  | `drop_dm_object_name("Processes")` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `reg_exe_manipulating_windows_services_registry_keys_filter`'
