description: The following analytic detects the loading of a DLL using the regsvr32
  application with the silent parameter and DLLInstall execution. It leverages data
  from Endpoint Detection and Response (EDR) agents, focusing on process command-line
  arguments and parent process details. This activity is significant as it is commonly
  used by RAT malware like Remcos and njRAT to load malicious DLLs on compromised
  machines. If confirmed malicious, this technique could allow attackers to execute
  arbitrary code, maintain persistence, and further compromise the system.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=regsvr32.exe OR
  Processes.original_file_name=REGSVR32.EXE) AND Processes.process="*/i*" by Processes.dest
  Processes.parent_process Processes.process Processes.parent_process_name Processes.process_name
  Processes.original_file_name Processes.user | `drop_dm_object_name(Processes)` |
  convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | where match(process,"(?i)[\-|\/][Ss]{1}") | `regsvr32_silent_and_install_param_dll_loading_filter`'
