description: The following analytic detects the execution of Regsvr32.exe with the
  silent switch to load DLLs. This behavior is identified using Endpoint Detection
  and Response (EDR) telemetry, focusing on command-line executions containing the
  `-s` or `/s` switches. This activity is significant as it is commonly used in malware
  campaigns, such as IcedID, to stealthily load malicious DLLs. If confirmed malicious,
  this could allow an attacker to execute arbitrary code, download additional payloads,
  and potentially compromise the system further. Immediate investigation and endpoint
  isolation are recommended.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=regsvr32.exe OR
  Processes.original_file_name=REGSVR32.EXE) by Processes.user Processes.process_name
  Processes.process Processes.parent_process_name Processes.original_file_name Processes.dest
  Processes.process_id | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | where match(process,"(?i)[\-|\/][Ss]{1}")
  | `regsvr32_with_known_silent_switch_cmdline_filter`'
