description: The following analytic detects the execution of `winrs.exe` with command-line
  arguments used to start a process on a remote endpoint. It leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process names and command-line
  executions mapped to the `Processes` node of the `Endpoint` data model. This activity
  is significant as it may indicate lateral movement or remote code execution attempts
  by adversaries. If confirmed malicious, this could allow attackers to execute arbitrary
  code on remote systems, potentially leading to further compromise and lateral spread
  within the network.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=winrs.exe OR Processes.original_file_name=winrs.exe)
  (Processes.process="*-r:*" OR Processes.process="*-remote:*") by Processes.dest
  Processes.user Processes.parent_process_name Processes.process_name Processes.process
  Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `remote_process_instantiation_via_winrm_and_winrs_filter`'
