description: The following analytic detects the execution of a suspicious rundll32
  command line used to clear the shim cache. It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process execution logs and command-line arguments.
  This activity is significant because clearing the shim cache is an anti-forensic
  technique aimed at evading detection and removing forensic artifacts. If confirmed
  malicious, this action could hinder incident response efforts, allowing an attacker
  to cover their tracks and maintain persistence on the compromised machine.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where  (Processes.process_name=rundll32.exe OR
  Processes.original_file_name=RUNDLL32.EXE) AND Processes.process = "*apphelp.dll,ShimFlushCache*"
  by Processes.dest Processes.user Processes.parent_process_name Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id Processes.original_file_name
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `rundll32_shimcache_flush_filter`'
