description: The following analytic detects rundll32.exe loading a DLL export function
  by ordinal value. It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process command-line executions. This behavior is significant because
  adversaries may use rundll32.exe to execute malicious code while evading security
  tools that do not monitor this process. If confirmed malicious, this activity could
  allow attackers to execute arbitrary code, potentially leading to system compromise,
  privilege escalation, or persistent access within the environment.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` values(Processes.process) as process min(_time)
  as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where (Processes.process_name=rundll32.exe
  OR Processes.original_file_name=RUNDLL32.EXE) by Processes.dest Processes.user Processes.parent_process_name
  Processes.process_name Processes.original_file_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | where match(process,"rundll32.+\#\d+")
  | `rundll_loading_dll_by_ordinal_filter`'
