description: The following analytic detects the execution of rundll32.exe without
  command line arguments, followed by a network connection. This behavior is identified
  using Endpoint Detection and Response (EDR) telemetry and network traffic data.
  It is significant because rundll32.exe typically requires arguments to function,
  and its absence is often associated with malicious activity, such as Cobalt Strike.
  If confirmed malicious, this activity could indicate an attempt to establish unauthorized
  network connections, potentially leading to data exfiltration or further compromise
  of the system.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Processes where (Processes.process_name=rundll32.exe OR
  Processes.original_file_name=RUNDLL32.EXE) AND Processes.action!="blocked" by host
  _time span=1h Processes.process_id Processes.process_name Processes.dest Processes.process_path
  Processes.process Processes.parent_process_name Processes.parent_process | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | regex process="(?i)(rundll32\.exe.{0,4}$)" | rename dest as src
  | join host process_id [| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count latest(All_Traffic.dest) as dest latest(All_Traffic.dest_ip)
  as dest_ip latest(All_Traffic.dest_port) as dest_port FROM datamodel=Network_Traffic.All_Traffic
  where All_Traffic.dest_port != 0 by host All_Traffic.process_id | `drop_dm_object_name(All_Traffic)`]
  | `rundll32_with_no_command_line_arguments_with_network_filter`'
