description: The following analytic identifies instances of rundll32.exe executing
  with `Control_RunDLL` in the command line, which is indicative of loading a .cpl
  or other file types. This detection leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process execution logs and command-line arguments. This
  activity is significant as rundll32.exe can be exploited to execute malicious Control
  Panel Item files, potentially linked to CVE-2021-40444. If confirmed malicious,
  this could allow attackers to execute arbitrary code, escalate privileges, or maintain
  persistence within the environment.
required_fields:
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=rundll32.exe OR
  Processes.original_file_name=RUNDLL32.EXE) Processes.process=*Control_RunDLL*  by
  Processes.dest Processes.user Processes.parent_process_name Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id Processes.original_file_name
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `rundll32_control_rundll_hunt_filter`'
