description: The following analytic detects the use of 'schtasks.exe' to start a Scheduled
  Task on a remote endpoint. This detection leverages Endpoint Detection and Response
  (EDR) data, focusing on process details such as process name, parent process, and
  command-line executions. This activity is significant as adversaries often abuse
  Task Scheduler for lateral movement and remote code execution. If confirmed malicious,
  this behavior could allow attackers to execute arbitrary code remotely, potentially
  leading to further compromise of the network.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=schtasks.exe OR
  Processes.original_file_name=schtasks.exe) (Processes.process= "* /S *" AND Processes.process=*/run*)
  by Processes.dest Processes.user Processes.parent_process_name Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `scheduled_task_initiation_on_remote_endpoint_filter`'
