description: The following analytic detects the execution of sdbinst.exe with parameters
  indicative of silently creating a shim database. It leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process names, parent processes,
  and command-line arguments. This activity is significant because shim databases
  can be used to intercept and manipulate API calls, potentially allowing attackers
  to bypass security controls or achieve persistence. If confirmed malicious, this
  could enable unauthorized code execution, privilege escalation, or persistent access
  to the compromised system.
required_fields:
- _time
- Processes.process_name
- Processes.parent_process_name
- Processes.dest
- Processes.user
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` values(Processes.process) as process min(_time)
  as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name
  = sdbinst.exe NOT Processes.process IN ("\"C:\\Windows\\System32\\sdbinst.exe\"",
  "C:\\Windows\\System32\\sdbinst.exe", "*-mm", "*-?") by Processes.process_name Processes.parent_process_name
  Processes.dest Processes.user | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `shim_database_installation_with_suspicious_parameters_filter`'
