description: The following analytic detects the rapid creation and deletion of Windows
  accounts within a short time frame of 1 hour. It leverages the "Change" data model
  in Splunk, specifically monitoring events with result IDs 4720 (account creation)
  and 4726 (account deletion). This behavior is significant as it may indicate an
  attacker attempting to create and remove accounts quickly to evade detection or
  gain unauthorized access. If confirmed malicious, this activity could lead to unauthorized
  access, privilege escalation, or further malicious actions within the environment.
  Immediate investigation of flagged events is crucial to mitigate potential damage.
required_fields:
- _time
- All_Changes.result_id
- All_Changes.user
- All_Changes.dest
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` values(All_Changes.result_id) as result_id count
  min(_time) as firstTime max(_time) as lastTime from datamodel=Change where All_Changes.result_id=4720
  OR All_Changes.result_id=4726 by _time span=1h All_Changes.user All_Changes.dest
  All_Changes.Account_Management.src All_Changes.Account_Management.src_user | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `drop_dm_object_name("All_Changes")` | `drop_dm_object_name("Account_Management")`
  | transaction user connected=false maxspan=60m | eval create_result_id=mvindex(result_id,
  0) | eval delete_result_id=mvindex(result_id, 1) | search create_result_id = 4720
  delete_result_id=4726 | table firstTime lastTime count user src src_user dest create_result_id
  delete_result_id | `short_lived_windows_accounts_filter`'
