description: The following analytic detects suspicious modifications to the registry
  that may indicate a UAC (User Account Control) bypass attempt via the SilentCleanup
  task. It leverages data from Endpoint Detection and Response (EDR) agents, focusing
  on registry changes in the path "*\\Environment\\windir" with executable values.
  This activity is significant as it can allow an attacker to gain high-privilege
  execution without user consent, bypassing UAC protections. If confirmed malicious,
  this could lead to unauthorized administrative access, enabling further system compromise
  and persistence.
required_fields:
- _time
- Processes.user
- Processes.dest
- Processes.process_id
- Processes.process_name
- Processes.process
- Processes.process_path
- Processes.parent_process_name
- Processes.parent_process
- Processes.process_guid
- Registry.dest
- Registry.registry_value_name
- Registry.registry_key_name
- Registry.registry_path
- Registry.registry_value_data
- Registry.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) AS firstTime max(_time) AS lastTime
  FROM datamodel=Endpoint.Processes BY _time span=1h Processes.user Processes.process_id
  Processes.process_name Processes.process Processes.process_path Processes.dest Processes.parent_process_name
  Processes.parent_process Processes.process_guid | `drop_dm_object_name(Processes)`
  | join process_guid [ | tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path=
  "*\\Environment\\windir" Registry.registry_value_data = "*.exe*") BY _time span=1h
  Registry.registry_path Registry.registry_key_name Registry.registry_value_name Registry.registry_value_data
  Registry.process_guid | `drop_dm_object_name(Registry)`] | fields firstTime lastTime
  dest user parent_process_name parent_process process_name process_path process registry_key_name
  registry_path registry_value_name registry_value_data process_guid | where isnotnull(registry_value_data)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `silentcleanup_uac_bypass_filter`'
