description: The following analytic detects the execution of the Microsoft Software
  Licensing User Interface Tool (`slui.exe`) with elevated privileges using the `-verb
  runas` function. This activity is identified through logs from Endpoint Detection
  and Response (EDR) agents, focusing on specific registry keys and command-line parameters.
  This behavior is significant as it indicates a potential privilege escalation attempt,
  which could allow an attacker to gain elevated access and execute malicious actions
  with higher privileges. If confirmed malicious, this could lead to unauthorized
  system changes, data exfiltration, or further compromise of the affected endpoint.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_name=slui.exe (Processes.process=*-verb*
  Processes.process=*runas*) by Processes.dest Processes.user Processes.parent_process
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `slui_runas_elevated_filter`'
