description: The following analytic detects suspicious process access by spoolsv.exe,
  potentially indicating exploitation of the PrintNightmare vulnerability (CVE-2021-34527).
  It leverages Sysmon EventCode 10 to identify when spoolsv.exe accesses critical
  system files or processes like rundll32.exe with elevated privileges. This activity
  is significant as it may signal an attempt to gain unauthorized privilege escalation
  on a vulnerable machine. If confirmed malicious, an attacker could achieve elevated
  privileges, leading to further system compromise, persistent access, or unauthorized
  control over the affected environment.
required_fields:
- _time
- SourceImage
- TargetImage
- GrantedAccess
- CallTrace
- EventCode
rule: sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational OR source=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
  OR source=Syslog:Linux-Sysmon/Operational EventCode=10 SourceImage = "*\\spoolsv.exe"
  CallTrace = "*\\Windows\\system32\\spool\\DRIVERS\\x64\\*" TargetImage IN ("*\\rundll32.exe",
  "*\\spoolsv.exe") GrantedAccess = 0x1fffff | stats  count min(_time) as firstTime
  max(_time) as lastTime by dest SourceImage TargetImage GrantedAccess CallTrace  EventCode
  ProcessID| convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `spoolsv_suspicious_process_access_filter`
