description: The following analytic detects the suspicious loading of DLLs by spoolsv.exe,
  potentially indicating PrintNightmare exploitation. It leverages Sysmon EventCode
  7 to identify instances where spoolsv.exe loads multiple DLLs from the Windows System32
  spool drivers x64 directory. This activity is significant as it may signify an attacker
  exploiting the PrintNightmare vulnerability to execute arbitrary code. If confirmed
  malicious, this could lead to unauthorized code execution, privilege escalation,
  and persistent access within the environment, posing a severe security risk.
required_fields:
- _time
- Image
- dest
- EventCode
- ImageLoaded
rule: sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational OR source=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
  OR source=Syslog:Linux-Sysmon/Operational EventCode=7 Image ="*\\spoolsv.exe" ImageLoaded="*\\Windows\\System32\\spool\\drivers\\x64\\*"
  ImageLoaded = "*.dll" | stats dc(ImageLoaded) as countImgloaded values(ImageLoaded)
  as ImageLoaded count min(_time) as firstTime max(_time) as lastTime by Image Computer
  ProcessId EventCode | rename Computer as dest | where countImgloaded >= 3 | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `spoolsv_suspicious_loaded_modules_filter`
