description: The following analytic detects `spoolsv.exe` writing a `.dll` file, which
  is unusual behavior and may indicate exploitation of vulnerabilities like CVE-2021-34527
  (PrintNightmare). This detection leverages Sysmon EventID 11 to monitor file creation
  events in the `\spool\drivers\x64\` directory. This activity is significant because
  `spoolsv.exe` typically does not write DLL files, and such behavior could signify
  an ongoing attack. If confirmed malicious, this could allow an attacker to execute
  arbitrary code, escalate privileges, or maintain persistence on the compromised
  system.
required_fields:
- _time
- dest
- UserID
- process_name
- file_path
- file_name
- TargetFilename
rule: sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational OR source=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
  OR source=Syslog:Linux-Sysmon/Operational EventID=11 process_name=spoolsv.exe file_path="*\\spool\\drivers\\x64\\*"
  file_name=*.dll | stats count min(_time) as firstTime max(_time) as lastTime by
  dest, UserID, process_name, file_path, file_name, TargetFilename, process_id | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `spoolsv_writing_a_dll___sysmon_filter`
