description: The following analytic detects the use of Regsvr32.exe to register DLLs
  from suspicious paths such as AppData, ProgramData, or Windows Temp directories.
  It leverages data from Endpoint Detection and Response (EDR) agents, focusing on
  process execution logs and command-line arguments. This activity is significant
  because Regsvr32.exe can be abused to proxy execution of malicious code, bypassing
  traditional security controls. If confirmed malicious, this could allow an attacker
  to execute arbitrary code, potentially leading to system compromise, data exfiltration,
  or further lateral movement within the network.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=regsvr32.exe OR
  Processes.original_file_name=REGSVR32.EXE) Processes.process IN ("*\\appdata\\*",
  "*\\programdata\\*","*\\windows\\temp\\*") NOT (Processes.process IN ("*.dll*",
  "*.ax*", "*.ocx*")) by Processes.dest Processes.user  Processes.parent_process_name
  Processes.parent_process Processes.process_name Processes.process Processes.original_file_name
  Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `suspicious_regsvr32_register_suspicious_path_filter`'
