description: The following analytic detects the execution of renamed instances of
  msbuild.exe. It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process names and original file names within the Endpoint data model.
  This activity is significant because msbuild.exe is a legitimate tool often abused
  by attackers to execute malicious code while evading detection. If confirmed malicious,
  this behavior could allow an attacker to execute arbitrary code, potentially leading
  to system compromise, data exfiltration, or further lateral movement within the
  network.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_name!=msbuild.exe AND
  Processes.original_file_name=MSBuild.exe by Processes.dest Processes.user Processes.parent_process_name
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  Processes.original_file_name | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `suspicious_msbuild_rename_filter`'
