description: The following analytic detects the execution of msbuild.exe from a non-standard
  path. It leverages data from Endpoint Detection and Response (EDR) agents, focusing
  on process execution logs that deviate from typical msbuild.exe locations. This
  activity is significant because msbuild.exe is commonly abused by attackers to execute
  malicious code, and running it from an unusual path can indicate an attempt to evade
  detection. If confirmed malicious, this behavior could allow an attacker to execute
  arbitrary code, potentially leading to system compromise and further malicious activities.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count values(Processes.process_name) as process_name
  values(Processes.process) as process min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=msbuild.exe OR Processes.original_file_name=MSBuild.exe)
  AND (Processes.process_path!=*\\framework*\\v*\\*) by Processes.dest Processes.original_file_name
  Processes.parent_process Processes.user | `drop_dm_object_name(Processes)` | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)| `suspicious_msbuild_path_filter`'
