description: The following analytic detects a suspicious `rundll32.exe` command line
  used to execute a DLL file, a technique associated with IcedID malware. It leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on command-line
  executions containing the pattern `*/i:*`. This activity is significant as it indicates
  potential malware attempting to load an encrypted DLL payload, often named `license.dat`.
  If confirmed malicious, this could allow attackers to execute arbitrary code, leading
  to further system compromise and potential data exfiltration.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=rundll32.exe OR
  Processes.original_file_name=RUNDLL32.EXE) Processes.process=*/i:* by  Processes.process_name
  Processes.process Processes.parent_process_name Processes.parent_process Processes.process_id
  Processes.parent_process_id Processes.dest Processes.user | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `suspicious_icedid_rundll32_cmdline_filter`'
