description: The following analytic detects the usage of wevtutil.exe with parameters
  for clearing event logs such as Application, Security, Setup, Trace, or System.
  It leverages data from Endpoint Detection and Response (EDR) agents, focusing on
  process names and command-line arguments. This activity is significant because clearing
  event logs can be an attempt to cover tracks after malicious actions, hindering
  forensic investigations. If confirmed malicious, this behavior could allow an attacker
  to erase evidence of their activities, making it difficult to trace their actions
  and understand the full scope of the compromise.
required_fields:
- _time
- Processes.process
- Processes.process_name
- Processes.parent_process_name
- Processes.dest
- Processes.user
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` values(Processes.process) as process min(_time)
  as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=wevtutil.exe
  Processes.process IN ("* cl *", "*clear-log*", "* -cl *") Processes.process IN ("*System*",
  "*Security*", "*Setup*", "*Application*", "*trace*", "*powershell*") by Processes.parent_process_name
  Processes.parent_process Processes.process Processes.process_guid Processes.process_id
  Processes.dest Processes.user | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) |convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `suspicious_wevtutil_usage_filter`'
