description: The following analytic detects the creation of .wav files in the AppData
  folder, a behavior associated with Remcos RAT malware, which stores audio recordings
  in this location for data exfiltration. The detection leverages endpoint process
  and filesystem data to identify .wav file creation within the AppData\Roaming directory.
  This activity is significant as it indicates potential unauthorized data collection
  and exfiltration by malware. If confirmed malicious, this could lead to sensitive
  information being sent to an attacker's command and control server, compromising
  the affected system's confidentiality.
required_fields:
- _time
- dest
- file_create_time
- file_name
- file_path
- process_name
- process_path
- process
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Processes where Processes.process_name=*.exe
  Processes.process_path="*\\appdata\\Roaming\\*" by _time span=1h Processes.process_id
  Processes.process_name Processes.process Processes.dest Processes.process_guid |
  `drop_dm_object_name(Processes)` |rename process_guid as proc_guid | join proc_guid,
  _time [ | tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Filesystem where Filesystem.file_name IN ("*.wav") Filesystem.file_path
  = "*\\appdata\\Roaming\\*" by _time span=1h Filesystem.dest Filesystem.file_create_time
  Filesystem.file_name Filesystem.file_path Filesystem.process_guid | `drop_dm_object_name(Filesystem)`
  |rename process_guid as proc_guid | fields file_name file_path process_name process_path
  process dest file_create_time _time proc_guid] | `suspicious_wav_file_in_appdata_folder_filter`'
