description: The following analytic detects instances of DLLHost.exe executing without
  command line arguments. This behavior is unusual and often associated with malicious
  activities, such as those performed by Cobalt Strike. The detection leverages data
  from Endpoint Detection and Response (EDR) agents, focusing on process execution
  logs. This activity is significant because DLLHost.exe typically requires arguments
  to function correctly, and its absence may indicate an attempt to evade detection.
  If confirmed malicious, this could lead to unauthorized actions like credential
  dumping or file manipulation, posing a severe threat to the environment.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Processes where (Processes.process_name=dllhost.exe
  OR Processes.original_file_name=dllhost.exe) by _time span=1h  Processes.process_id
  Processes.process_name Processes.dest Processes.user Processes.process_path Processes.process
  Processes.parent_process_name | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | regex process="(?i)(dllhost\.exe.{0,4}$)"
  | `suspicious_dllhost_no_command_line_arguments_filter`'
