description: The following analytic detects instances of searchprotocolhost.exe running
  without command line arguments. This behavior is unusual and often associated with
  malicious activities, such as those performed by Cobalt Strike. The detection leverages
  Endpoint Detection and Response (EDR) telemetry, focusing on process execution data.
  This activity is significant because searchprotocolhost.exe typically runs with
  specific arguments, and its absence may indicate an attempt to evade detection.
  If confirmed malicious, this could lead to unauthorized code execution, potential
  credential dumping, or other malicious actions within the environment.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Processes where Processes.process_name=searchprotocolhost.exe
  by _time span=1h  Processes.process_id Processes.process_name Processes.dest Processes.user
  Processes.process_path Processes.process Processes.parent_process_name | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | regex process="(?i)(searchprotocolhost\.exe.{0,4}$)" | `suspicious_searchprotocolhost_no_command_line_arguments_filter`'
