description: The following analytic detects the execution of rundll32.exe with the
  DllRegisterServer command to load a DLL. It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on command-line executions and process details.
  This activity is significant as it may indicate an attempt to register a malicious
  DLL, which can be a method for code execution or persistence. If confirmed malicious,
  an attacker could gain unauthorized code execution, escalate privileges, or maintain
  persistence within the environment, posing a severe security risk.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=rundll32.exe OR
  Processes.original_file_name=RUNDLL32.EXE) Processes.process=*dllregisterserver*
  by Processes.dest Processes.user Processes.parent_process_name Processes.parent_process
  Processes.original_file_name Processes.process_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `suspicious_rundll32_dllregisterserver_filter`'
