description: The following analytic identifies system processes running from unexpected
  locations outside `C:\Windows\System32\` or `C:\Windows\SysWOW64`. It leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on process paths,
  names, and hashes. This activity is significant as it may indicate a malicious process
  attempting to masquerade as a legitimate system process. If confirmed malicious,
  this behavior could allow an attacker to execute code, escalate privileges, or maintain
  persistence within the environment, posing a significant security risk.
required_fields:
- _time
- Processes.process_path
- Processes.user
- Processes.dest
- Processes.process_name
- Processes.process_id
- Processes.parent_process_name
- Processes.process_hash
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Processes where Processes.process_path !="C:\\Windows\\System32*"
  Processes.process_path !="C:\\Windows\\SysWOW64*" by Processes.dest Processes.user
  Processes.parent_process Processes.process_path Processes.process_name Processes.process
  Processes.process_id Processes.parent_process_id Processes.process_hash | `drop_dm_object_name("Processes")`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)| lookup update=true is_windows_system_file filename as process_name
  OUTPUT systemFile | search systemFile=true | `system_processes_run_from_unexpected_locations_filter`'
