description: The following analytic identifies a non-lsass.exe process making an outbound
  connection on port 88, which is typically used by the Kerberos authentication protocol.
  This detection leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process and network traffic logs. This activity is significant because,
  under normal circumstances, only the lsass.exe process should interact with the
  Kerberos Distribution Center. If confirmed malicious, this behavior could indicate
  an adversary attempting to abuse the Kerberos protocol, potentially leading to unauthorized
  access or lateral movement within the network.
required_fields:
- _time
- All_Traffic.dest_ip
- All_Traffic.dest_port
- All_Traffic.src_ip
- Processes.process_id
- Processes.process_name
- Processes.dest
- Processes.process_path
- Processes.process
- Processes.parent_process_name
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Processes where Processes.process_name!=lsass.exe
  by _time Processes.process_id Processes.process_name Processes.dest Processes.process_path
  Processes.process Processes.parent_process_name | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | join  process_id dest [| tstats summariesonly=`summariesonly_config`
  allow_old_summaries=`oldsummaries_config` fillnull_value=`fillnull_config` count
  FROM datamodel=Network_Traffic.All_Traffic where All_Traffic.dest_port = 88 by All_Traffic.src
  All_Traffic.process_id  All_Traffic.dest_port | `drop_dm_object_name(All_Traffic)`
  | rename src as dest ] |  table _time dest parent_process_name process_name process_path
  process process_id dest_port | `unknown_process_using_the_kerberos_protocol_filter`'
