description: The following analytic detects the use of `fltMC.exe` to unload the Sysmon
  driver, which stops Sysmon from collecting data. It leverages Endpoint Detection
  and Response (EDR) logs, focusing on process names and command-line executions.
  This activity is significant because disabling Sysmon can blind security monitoring,
  allowing malicious actions to go undetected. If confirmed malicious, this could
  enable attackers to execute further attacks without being logged, leading to potential
  data breaches, privilege escalation, or persistent access within the environment.
required_fields:
- _time
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_name
- Processes.dest
- Processes.user
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime values(Processes.process)
  as process max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=fltMC.exe
  AND Processes.process=*unload* AND Processes.process=*SysmonDrv*  by Processes.process_name
  Processes.process_id Processes.parent_process_name Processes.process Processes.dest
  Processes.user | `drop_dm_object_name("Processes")` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)|convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | table firstTime
  lastTime dest user count process_name process_id parent_process_name process | `unload_sysmon_filter_driver_filter`'
