description: The following analytic detects unusually long command lines, which may
  indicate malicious activity. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on the length of command lines executed on hosts. This behavior
  is significant because attackers often use obfuscated or complex command lines to
  evade detection and execute malicious payloads. If confirmed malicious, this activity
  could lead to data theft, ransomware deployment, or further system compromise. Analysts
  should investigate the source and content of the command line, inspect relevant
  artifacts, and review concurrent processes to identify potential threats.
required_fields:
- _time
- Processes.user
- Processes.dest
- Processes.process_name
- Processes.process
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Processes by Processes.user Processes.dest Processes.process_name
  Processes.process | `drop_dm_object_name("Processes")` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)|  eval processlen=len(process)
  | eventstats stdev(processlen) as stdev, avg(processlen) as avg by dest | stats
  max(processlen) as maxlen, values(stdev) as stdevperhost, values(avg) as avgperhost
  by dest, user, process_name, process | `unusually_long_command_line_filter` |eval
  threshold = 3 | where maxlen > ((threshold*stdevperhost) + avgperhost)'
