description: The following analytic detects the deletion of the USN Journal using
  the fsutil.exe utility. It leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on process execution logs that include command-line details. This
  activity is significant because the USN Journal maintains a log of all changes made
  to files on the disk, and its deletion can be an indicator of an attempt to cover
  tracks or hinder forensic investigations. If confirmed malicious, this action could
  allow an attacker to obscure their activities, making it difficult to trace file
  modifications and potentially compromising incident response efforts.
required_fields:
- _time
- Processes.process
- Processes.parent_process
- Processes.process_name
- Processes.user
- Processes.parent_process_name
- Processes.dest
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count values(Processes.process) as process values(Processes.parent_process)
  as parent_process min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where Processes.process_name=fsutil.exe by Processes.user Processes.process_name
  Processes.parent_process_name Processes.dest  | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | search process="*deletejournal*" AND process="*usn*" | `usn_journal_deletion_filter`'
