description: The following analytic identifies instances where a shell (PowerShell.exe
  or Cmd.exe) is spawned from W3WP.exe, the IIS worker process. This detection leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on process creation
  events where the parent process is W3WP.exe. This activity is significant as it
  may indicate webshell activity, often associated with exploitation attempts like
  those by the HAFNIUM Group on Exchange servers. If confirmed malicious, this behavior
  could allow attackers to execute arbitrary commands, potentially leading to system
  compromise, data exfiltration, or further lateral movement within the network.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count values(Processes.process_name) as process_name
  values(Processes.process) as process min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.parent_process_name=w3wp.exe AND
  (Processes.process_name=cmd.exe OR Processes.original_file_name=Cmd.Exe) OR (Processes.process_name=pwsh.exe
  OR Processes.process_name=sqlps.exe OR Processes.process_name=sqltoolsps.exe OR
  Processes.process_name=powershell.exe OR Processes.process_name=powershell_ise.exe
  OR Processes.original_file_name=pwsh.dll OR Processes.original_file_name=PowerShell.EXE
  OR Processes.original_file_name=powershell_ise.EXE) by Processes.dest Processes.parent_process
  Processes.original_file_name Processes.user | `drop_dm_object_name(Processes)` |
  convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)| `w3wp_spawning_shell_filter`'
