description: The following analytic detects the wermgr.exe process creating an executable
  file. It leverages Sysmon EventCode 11 to identify instances where wermgr.exe generates
  a .exe file. This behavior is unusual because wermgr.exe is typically associated
  with error reporting, not file creation. Such activity is significant as it may
  indicate TrickBot malware, which injects code into wermgr.exe to execute malicious
  actions like downloading additional payloads. If confirmed malicious, this could
  lead to further malware infections, data exfiltration, or system compromise.
required_fields:
- _time
- Image
- TargetFilename
- process_name
- dest
- EventCode
- ProcessId
rule: sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational OR source=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
  OR source=Syslog:Linux-Sysmon/Operational EventCode=11 process_name = "wermgr.exe"
  TargetFilename = "*.exe" | stats  min(_time) as firstTime max(_time) as lastTime
  count by  Image TargetFilename process_name dest EventCode ProcessId | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `wermgr_process_create_executable_file_filter`
