description: The following analytic detects the creation of new .sys files on disk.
  It leverages the Endpoint.Filesystem data model to identify and log instances where
  .sys files are written to the filesystem. This activity is significant because .sys
  files are often used as kernel mode drivers, and their unauthorized creation can
  indicate malicious activity such as rootkit installation. If confirmed malicious,
  this could allow an attacker to gain kernel-level access, leading to full system
  compromise, persistent control, and the ability to bypass security mechanisms.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Filesystem where Filesystem.file_name="*.sys*" by _time
  span=1h Filesystem.dest Filesystem.file_create_time Filesystem.file_name Filesystem.file_path
  Filesystem.file_hash | `drop_dm_object_name(Filesystem)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| `windows_system_file_on_disk_filter`'
