description: The following analytic detects the creation of .iso.lnk files in the
  %USER%\AppData\Local\Temp\<random folder name>\ path, indicating that an ISO file
  has been mounted and accessed. This detection leverages the Endpoint.Filesystem
  data model, specifically monitoring file creation events in the Windows Recent folder.
  This activity is significant as it may indicate the delivery and execution of potentially
  malicious payloads via ISO files. If confirmed malicious, this could lead to unauthorized
  code execution, data exfiltration, or further system compromise.
required_fields:
- Filesystem.file_create_time
- Filesystem.process_id
- Filesystem.file_name
- Filesystem.file_path
- Filesystem.dest
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Filesystem where Filesystem.file_path IN ("*\\Microsoft\\Windows\\Recent\\*")
  Filesystem.file_name IN ("*.iso.lnk", "*.img.lnk", "*.vhd.lnk", "*vhdx.lnk") by
  Filesystem.file_create_time Filesystem.process_id Filesystem.file_name Filesystem.file_path
  Filesystem.dest | `drop_dm_object_name(Filesystem)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_iso_lnk_file_creation_filter`'
