description: The following analytic detects the deletion of the Windows Defender context
  menu entry from the registry. It leverages data from the Endpoint datamodel, specifically
  monitoring registry actions where the path includes "*\\shellex\\ContextMenuHandlers\\EPP"
  and the action is 'deleted'. This activity is significant as it is commonly associated
  with Remote Access Trojan (RAT) malware attempting to disable security features.
  If confirmed malicious, this could allow an attacker to impair defenses, facilitating
  further malicious activities such as unauthorized access, persistence, and data
  exfiltration.
required_fields:
- _time
- Registry.registry_key_name
- Registry.registry_value_name
- Registry.dest
- Registry.user
- Registry.registry_path
- Registry.action
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Registry where Registry.registry_path = "*\\shellex\\ContextMenuHandlers\\EPP"
  Registry.action = deleted by  Registry.registry_path Registry.registry_value_name
  Registry.registry_value_data Registry.process_guid Registry.action Registry.dest
  Registry.user | `drop_dm_object_name(Registry)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_impair_defense_delete_win_defender_context_menu_filter`'
