description: The following analytic detects modifications to the Windows registry
  aimed at disabling Windows Security Center notifications. It leverages data from
  the Endpoint.Registry datamodel, specifically monitoring changes to the registry
  path "*\\Windows\\CurrentVersion\\ImmersiveShell\\UseActionCenterExperience*" with
  a value of "0x00000000". This activity is significant as it can indicate an attempt
  by adversaries or malware, such as Azorult, to evade defenses by suppressing critical
  update notifications. If confirmed malicious, this could allow attackers to persist
  undetected, potentially leading to further exploitation and compromise of the host
  system.
required_fields:
- _time
- Registry.registry_key_name
- Registry.registry_path
- Registry.user
- Registry.dest
- Registry.registry_value_name
- Registry.action
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry where Registry.registry_path= "*\\Windows\\CurrentVersion\\ImmersiveShell\\UseActionCenterExperience*"
  Registry.registry_value_data="0x00000000" by Registry.registry_key_name Registry.user
  Registry.registry_path Registry.registry_value_data Registry.action Registry.dest
  | `drop_dm_object_name(Registry)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_modify_registry_disable_windows_security_center_notif_filter`'
