description: The following analytic detects modifications to the Windows registry
  that disable toast notifications. It leverages data from the Endpoint.Registry datamodel,
  specifically monitoring changes to the registry path "*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\PushNotifications\\ToastEnabled*"
  with a value set to "0x00000000". This activity is significant because disabling
  toast notifications can prevent users from receiving critical system and application
  updates, which adversaries like Azorult exploit for defense evasion. If confirmed
  malicious, this action could allow attackers to operate undetected, leading to prolonged
  persistence and potential further compromise of the system.
required_fields:
- _time
- Registry.registry_key_name
- Registry.registry_path
- Registry.user
- Registry.dest
- Registry.registry_value_name
- Registry.action
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry where Registry.registry_path= "*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\PushNotifications\\ToastEnabled*"
  Registry.registry_value_data="0x00000000" by Registry.registry_key_name Registry.user
  Registry.registry_path Registry.registry_value_data Registry.action Registry.dest
  | `drop_dm_object_name(Registry)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_modify_registry_disable_toast_notifications_filter`'
