description: The following analytic identifies the unusual behavior of MSIExec spawning
  WinDBG. It detects this activity by analyzing endpoint telemetry data, specifically
  looking for instances where 'msiexec.exe' is the parent process of 'windbg.exe'.
  This behavior is significant as it may indicate an attempt to debug or tamper with
  system processes, which is uncommon in typical user activity and could signify malicious
  intent. If confirmed malicious, this activity could allow an attacker to manipulate
  or inspect running processes, potentially leading to privilege escalation or persistence
  within the environment.
required_fields:
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process_path
- Processes.parent_process
- Processes.process_name
- Processes.process_path
- Processes.process
- Processes.process_id
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.parent_process_name=msiexec.exe
  Processes.process_name=windbg.exe by Processes.dest Processes.user Processes.parent_process_name
  Processes.parent_process_path Processes.parent_process Processes.process_name Processes.process_path
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)| `windows_msiexec_spawn_windbg_filter`'
