description: The following analytic detects a Microsoft Office product spawning the
  Windows msdt.exe process. This detection leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process creation events where Office applications
  are the parent process. This activity is significant as it may indicate an attempt
  to exploit protocol handlers to bypass security controls, even if macros are disabled.
  If confirmed malicious, this behavior could allow an attacker to execute arbitrary
  code, potentially leading to system compromise, data exfiltration, or further lateral
  movement within the network.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.parent_process_name IN ("winword.exe","excel.exe","powerpnt.exe","outlook.exe","mspub.exe","visio.exe","onenote.exe","onenotem.exe","onenoteviewer.exe","onenoteim.exe","msaccess.exe")
  Processes.process_name=msdt.exe by Processes.dest Processes.user Processes.parent_process_name
  Processes.parent_process Processes.process_name Processes.original_file_name Processes.process
  Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `windows_office_product_spawning_msdt_filter`'
