description: The following analytic detects the execution of the SOAPHound binary
  (`soaphound.exe`) with specific command-line arguments. It leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process names, command-line arguments,
  and other process-related metadata. This activity is significant because SOAPHound
  is a known tool used for credential dumping and other malicious activities. If confirmed
  malicious, this behavior could allow an attacker to extract sensitive information,
  escalate privileges, or persist within the environment, posing a severe threat to
  organizational security.
required_fields:
- Processes.process
- Processes.dest
- Processes.process_current_directory
- Processes.process_path
- Processes.process_integrity_level
- Processes.parent_process
- Processes.parent_process_path
- Processes.parent_process_guid
- Processes.parent_process_id
- Processes.process_guid
- Processes.process_id
- Processes.user
- Processes.original_file_nam
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_name="soaphound.exe" OR
  Processes.original_file_name="soaphound.exe" AND Processes.process IN ("*--buildcache
  *", "*--bhdump *", "*--certdump *", "*--dnsdump *", "*-c *", "*--cachefilename *",
  "*-o *", "*--outputdirectory *") by Processes.process Processes.dest Processes.process_current_directory
  Processes.process_name Processes.process_path Processes.process_integrity_level
  Processes.parent_process Processes.parent_process_path Processes.parent_process_guid
  Processes.parent_process_id Processes.process_guid Processes.process_id Processes.user
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| `windows_soaphound_binary_execution_filter`'
