description: The following analytic detects modifications to the Windows registry
  related to the Local Security Authority (LSA) NoLMHash setting. It identifies when
  the registry value is set to 0, indicating that the system will store passwords
  in the weaker Lan Manager (LM) hash format. This detection leverages registry activity
  logs from endpoint data sources like Sysmon or EDR tools. Monitoring this activity
  is crucial as it can indicate attempts to weaken password storage security. If confirmed
  malicious, this could allow attackers to exploit weaker LM hashes, potentially leading
  to unauthorized access and credential theft.
required_fields:
- _time
- Registry.registry_path
- Registry.registry_key_name
- Registry.registry_value_name
- Registry.registry_key_name
- Registry.user
- Registry.dest
- Registry.action
- Registry.registry_value_data
- Registry.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path= "*\\System\\CurrentControlSet\\Control\\Lsa\\NoLMHash"
  Registry.registry_value_data = 0x00000000) BY Registry.dest Registry.user Registry.registry_path
  Registry.registry_key_name Registry.registry_value_name Registry.registry_value_data
  Registry.process_guid | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `windows_lsa_secrets_nolmhash_registry_filter`'
