description: The following analytic identifies non-SYSTEM accounts requesting access
  to lsass.exe. This detection leverages Sysmon EventCode 10 logs to monitor access
  attempts to the Local Security Authority Subsystem Service (lsass.exe) by non-SYSTEM
  users. This activity is significant as it may indicate credential dumping attempts
  or unauthorized access to sensitive credentials. If confirmed malicious, an attacker
  could potentially extract credentials from memory, leading to privilege escalation
  or lateral movement within the network. Immediate investigation is required to determine
  the legitimacy of the access request and to mitigate any potential threats.
required_fields:
- _time
- dest
- TargetImage
- GrantedAccess
- SourceImage
- SourceProcessId
- SourceUser
- TargetUser
rule: sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational OR source=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
  OR source=Syslog:Linux-Sysmon/Operational EventCode=10 TargetImage=*lsass.exe NOT
  (SourceUser="NT AUTHORITY\\*") | stats count min(_time) as firstTime max(_time)
  as lastTime by dest, parent_process_name, parent_process_path ,parent_process_id,
  TargetImage, GrantedAccess, SourceUser, TargetUser | rename TargetUser as user |
  convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `windows_non_system_account_targeting_lsass_filter`
