description: The following analytic detects a suspicious registry modification that
  disables the logoff feature on a Windows host. It leverages data from the Endpoint.Registry
  data model to identify changes to specific registry values associated with logoff
  functionality. This activity is significant because it can indicate ransomware attempting
  to make the compromised host unusable and hinder remediation efforts. If confirmed
  malicious, this action could prevent users from logging off, complicate incident
  response, and allow attackers to maintain persistence and control over the affected
  system.
required_fields:
- _time
- Registry.dest
- Registry.registry_value_name
- Registry.registry_key_name
- Registry.registry_path
- Registry.registry_value_data
- Registry.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path= "*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\*"
  Registry.registry_value_name IN ("NoLogOff", "StartMenuLogOff") Registry.registry_value_data
  = "0x00000001") BY Registry.dest Registry.user Registry.registry_path Registry.registry_key_name
  Registry.registry_value_name Registry.registry_value_data Registry.process_guid
  | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data) | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `windows_disable_logoff_button_through_registry_filter`'
