description: The following analytic detects a suspicious modification to the Windows
  registry setting for EnableLinkedConnections. It leverages data from the Endpoint.Registry
  datamodel to identify changes where the registry path is "*\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\EnableLinkedConnections"
  and the value is set to "0x00000001". This activity is significant because enabling
  linked connections can allow network shares to be accessed with both standard and
  administrator-level privileges, a technique often abused by malware like BlackByte
  ransomware. If confirmed malicious, this could lead to unauthorized access to sensitive
  network resources, escalating the attacker's privileges.
required_fields:
- _time
- Registry.registry_key_name
- Registry.registry_path
- Registry.user
- Registry.dest
- Registry.registry_value_name
- Registry.action
- Registry.registry_value_data
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path= "*\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\EnableLinkedConnections"
  Registry.registry_value_data = "0x00000001") BY _time span=1h Registry.registry_path
  Registry.registry_key_name Registry.registry_value_name Registry.registry_value_data
  Registry.process_guid Registry.dest | `drop_dm_object_name(Registry)` | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `windows_modify_registry_enablelinkedconnections_filter`'
