description: The following analytic detects instances where the PaperCut NG application
  (pc-app.exe) spawns a Windows shell, such as cmd.exe or PowerShell. This behavior
  is identified using Endpoint Detection and Response (EDR) telemetry, focusing on
  process creation events where the parent process is pc-app.exe. This activity is
  significant as it may indicate an attacker attempting to gain unauthorized access
  or execute malicious commands on the system. If confirmed malicious, this could
  lead to unauthorized code execution, privilege escalation, or further compromise
  of the affected environment.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.parent_process_name=pc-app.exe
  (Processes.process_name=cmd.exe OR Processes.original_file_name=Cmd.Exe) OR (Processes.process_name=pwsh.exe
  OR Processes.process_name=sqlps.exe OR Processes.process_name=sqltoolsps.exe OR
  Processes.process_name=powershell.exe OR Processes.process_name=powershell_ise.exe
  OR Processes.original_file_name=pwsh.dll OR Processes.original_file_name=PowerShell.EXE
  OR Processes.original_file_name=powershell_ise.EXE) OR Processes.process_name=java.exe
  by Processes.dest Processes.user Processes.parent_process_name Processes.process_name
  Processes.original_file_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_papercut_ng_spawn_shell_filter`'
