description: The following analytic detects the modification of the Windows registry
  to disable the Notification Center on a host machine. It leverages data from the
  Endpoint.Registry data model, specifically looking for changes to the "DisableNotificationCenter"
  registry value set to "0x00000001." This activity is significant because disabling
  the Notification Center can be a tactic used by RAT malware to hide its presence
  and subsequent actions. If confirmed malicious, this could allow an attacker to
  operate stealthily, potentially leading to further system compromise and data exfiltration.
required_fields:
- Registry.dest
- Registry.registry_value_name
- Registry.registry_key_name
- Registry.registry_path
- Registry.registry_value_data
- Registry.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE (Registry.registry_value_name= "DisableNotificationCenter"
  Registry.registry_value_data = "0x00000001") BY Registry.dest Registry.user Registry.registry_path
  Registry.registry_key_name Registry.registry_value_name Registry.registry_value_data
  Registry.process_guid | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `windows_disable_notification_center_filter`'
