description: The following analytic detects the creation of files containing passwords,
  cookies, and saved login account information by the Braodo stealer malware in temporary
  folders. Braodo often collects these credentials from browsers and applications,
  storing them in temp directories before exfiltration. This detection focuses on
  monitoring for the creation of files with patterns or formats commonly associated
  with stolen credentials. By identifying these activities, security teams can take
  needed action to prevent sensitive login data from being leaked, reducing the risk
  of unauthorized access to user accounts and systems.
required_fields:
- _time
- Filesystem.dest
- Filesystem.file_create_time
- Filesystem.file_name
- Filesystem.user
- Filesystem.file_path
rule: '|tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Filesystem where Filesystem.file_name IN ("login*", "pass*","cookie*","master_key*")
  Filesystem.file_path = "*\\temp\\*" by _time Filesystem.file_name Filesystem.file_path
  Filesystem.dest Filesystem.file_create_time | `drop_dm_object_name(Filesystem)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `windows_credentials_from_web_browsers_saved_in_temp_folder_filter`'
