description: The following analytic detects the execution of the 'rmdir' command with
  '/s' and '/q' options to delete files and directory trees. This detection leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on command-line
  executions and process metadata. This activity is significant as it may indicate
  malware attempting to remove traces or components during cleanup operations. If
  confirmed malicious, this behavior could allow attackers to eliminate forensic evidence,
  hinder incident response efforts, and maintain persistence by removing indicators
  of compromise.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
- Processes.parent_process_guid
- Processes.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process = "*rmdir*" Processes.process
  = "* /s *" Processes.process = "* /q *" by Processes.process_name Processes.original_file_name
  Processes.process Processes.process_id Processes.process_guid Processes.parent_process_name
  Processes.parent_process Processes.parent_process_guid Processes.dest Processes.user
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_indicator_removal_via_rmdir_filter`'
