description: The following analytic detects when a process with low, medium, or high
  integrity spawns a system integrity process from a user-controlled location. This
  behavior is indicative of privilege escalation attempts where attackers elevate
  their privileges to SYSTEM level from a user-controlled process or service. The
  detection leverages Sysmon data, specifically Event ID 15, to identify such transitions.
  Monitoring this activity is crucial as it can signify an attacker gaining SYSTEM-level
  access, potentially leading to full control over the affected system, unauthorized
  access to sensitive data, and further malicious activities.
required_fields:
- _time
- dest
- user
- ParentUser
- parent_process_name
- parent_process_guid
- IntegrityLevel
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime from datamodel=Endpoint.Processes
  where Processes.process_integrity_level IN ("low","medium","high") NOT Processes.user
  IN ("*SYSTEM","*LOCAL SERVICE","*NETWORK SERVICE","DWM-*","*$") AND Processes.process_path
  IN ("*\\\\*","*\\Users\\*","*\\Temp\\*","*\\ProgramData\\*") by Processes.dest,
  Processes.user, Processes.parent_process_guid, Processes.parent_process, Processes.parent_process_name
  Processes.process_name Processes.process, Processes.process_path, Processes.process_guid,
  Processes.process_integrity_level, Processes.process_current_directory | `drop_dm_object_name(Processes)`
  | eval join_guid = process_guid | join max=0 dest join_guid  [| tstats summariesonly=`summariesonly_config`
  allow_old_summaries=`oldsummaries_config` fillnull_value=`fillnull_config` count
  max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_integrity_level
  IN ("system") AND Processes.parent_process_path IN ("*\\\\*","*\\Users\\*","*\\Temp\\*","*\\ProgramData\\*")
  by Processes.dest, Processes.user, Processes.parent_process_guid, Processes.process_name,
  Processes.process, Processes.process_path, Processes.process_integrity_level, Processes.process_current_directory
  | `drop_dm_object_name(Processes)` | rename parent_process_guid as join_guid, process*
  as system_process*, user as system_user ] | fields dest, user, parent_process, parent_process_name,
  parent_process_guid, process, process_name, process_guid, process_integrity_level,process_path,
  process_current_directory, system_process_name, system_process, system_process_path,
  system_process_integrity_level, system_process_current_directory, system_user, firstTime,
  lastTime, count | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)  | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_privilege_escalation_user_process_spawn_system_process_filter`'
