description: The following analytic detects MSIExec making network connections over
  ports 443 or 80. This behavior is identified by correlating process creation events
  from Endpoint Detection and Response (EDR) agents with network traffic logs. Typically,
  MSIExec does not perform network communication to the internet, making this activity
  unusual and potentially indicative of malicious behavior. If confirmed malicious,
  an attacker could be using MSIExec to download or communicate with external servers,
  potentially leading to data exfiltration, command and control (C2) communication,
  or further malware deployment.
required_fields:
- _time
- Processes.process_id
- Processes.process_name
- Processes.dest
- Processes.process_path
- Processes.process
- Processes.parent_process_name
- All_Traffic.process_id
- All_Traffic.dest
- All_Traffic.dest_port
- All_Traffic.dest_ip
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Processes where (Processes.process_name=msiexec.exe
  OR Processes.original_file_name=msiexec.exe) by _time Processes.user Processes.process_id
  Processes.process_name Processes.dest Processes.process_path Processes.process Processes.parent_process_name
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | join  process_id [| tstats
  summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config` fillnull_value=`fillnull_config`
  count FROM datamodel=Network_Traffic.All_Traffic where All_Traffic.dest_port IN
  ("80","443") by All_Traffic.process_id All_Traffic.dest All_Traffic.dest_port All_Traffic.dest_ip
  | `drop_dm_object_name(All_Traffic)` ] | table _time user dest parent_process_name
  process_name process_path process process_id dest_port dest_ip | `windows_msiexec_with_network_connections_filter`'
