description: The following analytic detects the execution of "qwinsta.exe" on a Windows
  operating system. This detection leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process execution logs. The "qwinsta.exe" tool is significant
  because it can display detailed session information on a remote desktop session
  host server. This behavior is noteworthy as it is commonly abused by Qakbot malware
  to gather system information and send it back to its Command and Control (C2) server.
  If confirmed malicious, this activity could lead to unauthorized data exfiltration
  and further compromise of the host.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_name = "qwinsta.exe" OR
  Processes.original_file_name = "qwinsta.exe" by Processes.parent_process Processes.parent_process_name
  Processes.process_name Processes.process_id Processes.process_guid Processes.process
  Processes.user Processes.dest Processes.parent_process_id Processes.original_file_name
  | `drop_dm_object_name("Processes")` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  |convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_system_discovery_using_qwinsta_filter`'
