description: The following analytic detects suspicious modifications to the Windows
  registry keys related to file compression color and information tips. It leverages
  data from the Endpoint.Registry data model, specifically monitoring changes to the
  "ShowCompColor" and "ShowInfoTip" values under the "Microsoft\\Windows\\CurrentVersion\\Explorer\\Advanced"
  path. This activity is significant as it was observed in the Hermetic Wiper malware,
  indicating potential malicious intent to alter file attributes and user interface
  elements. If confirmed malicious, this could signify an attempt to manipulate file
  visibility and deceive users, potentially aiding in further malicious activities.
required_fields:
- _time
- Registry.dest
- Registry.registry_value_name
- Registry.registry_key_name
- Registry.registry_path
- Registry.registry_value_data
- Registry.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path = "*\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Advanced*"
  AND Registry.registry_value_name  IN("ShowCompColor", "ShowInfoTip")) BY Registry.dest
  Registry.user Registry.registry_path Registry.registry_key_name Registry.registry_value_name
  Registry.registry_value_data Registry.process_guid | `drop_dm_object_name(Registry)`
  | where isnotnull(registry_value_data) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_modify_show_compress_color_and_info_tip_registry_filter`'
