description: The following analytic detects the disabling of Windows Defender logging
  by identifying changes to the Registry keys DefenderApiLogger or DefenderAuditLogger
  set to disable. It leverages data from the Endpoint.Registry datamodel to monitor
  specific registry paths and values. This activity is significant as it is commonly
  associated with Remote Access Trojan (RAT) malware attempting to evade detection.
  If confirmed malicious, this action could allow an attacker to conceal their activities,
  making it harder to detect further malicious actions and maintain persistence on
  the compromised endpoint.
required_fields:
- _time
- Registry.registry_key_name
- Registry.registry_value_name
- Registry.dest
- Registry.user
- Registry.registry_path
- Registry.action
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Registry where (Registry.registry_path = "*WMI\\Autologger\\DefenderApiLogger\\Start"
  OR Registry.registry_path = "*WMI\\Autologger\\DefenderAuditLogger\\Start")  Registry.registry_value_data
  ="0x00000000" by  Registry.registry_path Registry.registry_value_name Registry.registry_value_data
  Registry.process_guid Registry.action Registry.dest Registry.user | `drop_dm_object_name(Registry)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `windows_impair_defenses_disable_win_defender_auto_logging_filter`'
