description: The following analytic detects the modification of the InProcServer32
  registry key by reg.exe, indicative of potential COM hijacking. This detection leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on process and
  command-line execution logs. COM hijacking is significant as it allows adversaries
  to insert malicious code that executes in place of legitimate software, providing
  a means for persistence. If confirmed malicious, this activity could enable attackers
  to execute arbitrary code, disrupt legitimate system components, and maintain long-term
  access to the compromised environment.
required_fields:
- UPDATE
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=reg.exe OR Processes.original_file_name=reg.exe)
  Processes.process=*inprocserver32* by Processes.dest Processes.user Processes.parent_process_name
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_com_hijacking_inprocserver32_modification_filter`'
