description: The following analytic identifies the use of protocol handlers executed
  via the command line. It leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on process and command-line telemetry. This activity is significant
  because protocol handlers can be exploited to execute arbitrary commands or launch
  applications, potentially leading to unauthorized actions. If confirmed malicious,
  an attacker could use this technique to gain code execution, escalate privileges,
  or maintain persistence within the environment, posing a significant security risk.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  values(Processes.process) as process values(Processes.parent_process) as parent_process
  from datamodel=Endpoint.Processes  by Processes.dest Processes.parent_process_name
  Processes.user Processes.process_name Processes.process | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `drop_dm_object_name(Processes)`
  | lookup windows_protocol_handlers handler AS process OUTPUT handler ishandler |
  where ishandler="TRUE" | `windows_identify_protocol_handlers_filter`'
