description: The following analytic detects suspicious raw access reads to the drive
  containing the Master Boot Record (MBR). It leverages Sysmon EventCode 9 to identify
  processes attempting to read or write to the MBR sector, excluding legitimate system
  processes. This activity is significant because adversaries often target the MBR
  to wipe, encrypt, or overwrite it as part of their impact payload. If confirmed
  malicious, this could lead to system instability, data loss, or a complete system
  compromise, severely impacting the organization's operations.
required_fields:
- _time
- dest
- Image
- Device
- ProcessGuid
- ProcessId
- EventDescription
- EventCode
rule: sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational OR source=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
  OR source=Syslog:Linux-Sysmon/Operational EventCode=9 Device = \\Device\\Harddisk0\\DR0
  NOT (Image IN("*\\Windows\\System32\\*", "*\\Windows\\SysWOW64\\*")) | stats count
  min(_time) as firstTime max(_time) as lastTime by Computer Image Device ProcessGuid
  ProcessId EventDescription EventCode | rename Computer as dest | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_raw_access_to_master_boot_record_drive_filter`
