description: The following analytic identifies instances of the WinDBG process spawning
  AutoIt3. This behavior is detected by monitoring endpoint telemetry for processes
  where 'windbg.exe' is the parent process and 'autoit3.exe' or similar is the child
  process. This activity is significant because AutoIt3 is frequently used by threat
  actors for scripting malicious automation, potentially indicating an ongoing attack.
  If confirmed malicious, this could allow attackers to automate tasks, execute arbitrary
  code, and further compromise the system, leading to data exfiltration or additional
  malware deployment.
required_fields:
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.process_name
- Processes.original_file_name
- Processes.process
- Processes.process_id
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes  where Processes.parent_process_name=windbg.exe  AND
  (Processes.process_name IN ("autoit3.exe", "autoit*.exe") OR Processes.original_file_name
  IN ("autoit3.exe", "autoit*.exe")) by Processes.dest, Processes.user, Processes.parent_process_name,
  Processes.process_name, Processes.original_file_name, Processes.process, Processes.process_id,
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | eval matches_extension=if(match(process,
  "\\.(au3|a3x|exe|aut|aup)$"), "Yes", "No") | search matches_extension="Yes" | `windows_windbg_spawning_autoit3_filter`'
