description: The following analytic detects the execution of rundll32.exe with command-line
  arguments loading davclnt.dll and the davsetcookie function to access a remote WebDav
  instance. It uses data from Endpoint Detection and Response (EDR) agents, correlating
  process execution and network traffic data. This activity is significant as it may
  indicate exploitation of CVE-2023-23397, a known vulnerability. If confirmed malicious,
  this could allow an attacker to establish unauthorized remote connections, potentially
  leading to data exfiltration or further network compromise.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
- All_Traffic.dest_port
- All_Traffic.dest_ip
- All_Traffic.dest
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Processes where Processes.parent_process_name=svchost.exe
  (Processes.process_name=rundll32.exe OR Processes.original_file_name=RUNDLL32.EXE)
  Processes.process IN ("*\\windows\\system32\\davclnt.dll,*davsetcookie*", "*\\windows\\syswow64\\davclnt.dll,*davsetcookie*")
  by host _time span=1h Processes.process_id Processes.process_name Processes.dest
  Processes.process_path Processes.process Processes.parent_process_name Processes.parent_process
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | rename dest as src | join
  host process_id [ | tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count latest(All_Traffic.dest) as dest latest(All_Traffic.dest_ip)
  as dest_ip latest(All_Traffic.dest_port) as dest_port FROM datamodel=Network_Traffic.All_Traffic
  where All_Traffic.dest_port!=0 NOT (All_Traffic.dest_ip IN (10.0.0.0/8, 172.16.0.0/12,
  192.168.0.0/16))  by host All_Traffic.process_id | `drop_dm_object_name(All_Traffic)`]
  | `windows_rundll32_webdav_with_network_connection_filter`'
