description: The following analytic detects a suspicious process making DNS queries
  to known, abused web services such as text-paste sites, VoIP, secure tunneling,
  instant messaging, and digital distribution platforms. This detection leverages
  Sysmon logs with Event ID 22, focusing on specific query names. This activity is
  significant as it may indicate an adversary attempting to download malicious files,
  a common initial access technique. If confirmed malicious, this could lead to unauthorized
  code execution, data exfiltration, or further compromise of the target host.
required_fields:
- _time
- Image
- QueryName
- QueryStatus
- process_name
- QueryResults
- Computer
rule: sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational OR source=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
  OR source=Syslog:Linux-Sysmon/Operational EventCode=22 QueryName IN ("*pastebin*",""*textbin*"",
  "*ngrok.io*", "*discord*", "*duckdns.org*", "*pasteio.com*") | stats count min(_time)
  as firstTime max(_time) as lastTime by Image QueryName QueryStatus process_name
  QueryResults Computer | rename Computer as dest | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_abused_web_services_filter`
