description: The following analytic detects suspicious modifications to the Windows
  registry's default icon settings, a technique associated with Lockbit ransomware.
  It leverages data from the Endpoint Registry data model, focusing on changes to
  registry paths under "*HKCR\\*\\defaultIcon\\(Default)*". This activity is significant
  as it is uncommon for normal users to modify these settings, and such changes can
  indicate ransomware infection or other malware. If confirmed malicious, this could
  lead to system defacement and signal a broader ransomware attack, potentially compromising
  sensitive data and system integrity.
required_fields:
- _time
- Registry.dest
- Registry.user
- Registry.registry_path
- Registry.registry_key_name
- Registry.registry_value_name
- Registry.action
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count  min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry where Registry.registry_path ="*\\defaultIcon\\(Default)*"
  Registry.registry_path = "*HKCR\\*" by Registry.registry_path Registry.registry_key_name
  Registry.registry_value_name Registry.action Registry.dest  Registry.user | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `drop_dm_object_name(Registry)` | `windows_modify_registry_default_icon_setting_filter`'
