description: The following analytic identifies the execution of rundll32.exe with
  command-line arguments loading davclnt.dll and the davsetcookie function to access
  a remote WebDAV instance. This detection leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process names and command-line executions.
  This activity is significant as it may indicate an attempt to exploit CVE-2023-23397,
  a known vulnerability. If confirmed malicious, this could allow an attacker to execute
  remote code or exfiltrate data, posing a severe threat to the environment.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_name=rundll32.exe Processes.process
  IN ("*\\windows\\system32\\davclnt.dll,*davsetcookie*","*\\windows\\syswow64\\davclnt.dll,*davsetcookie*")
  by Processes.dest Processes.user Processes.parent_process_name Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `windows_rundll32_webdav_request_filter`'
