description: The following analytic detects modifications to the Windows registry
  that disable Windows Defender's infection reporting. It leverages data from the
  Endpoint.Registry datamodel, specifically monitoring changes to the "DontReportInfectionInformation"
  registry key. This activity is significant because it can prevent Windows Defender
  from reporting detailed threat information to Microsoft, potentially allowing malware
  to evade detection. If confirmed malicious, this action could enable attackers to
  bypass security measures, maintain persistence, and avoid detection, leading to
  prolonged unauthorized access and potential data breaches.
required_fields:
- _time
- Registry.registry_key_name
- Registry.registry_value_name
- Registry.dest
- Registry.user
- Registry.registry_path
- Registry.action
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry where Registry.registry_path= "*\\Microsoft\\MRT\\DontReportInfectionInformation"
  Registry.registry_value_data="0x00000001" by Registry.registry_key_name Registry.user
  Registry.registry_path Registry.registry_value_data Registry.action Registry.dest
  | `drop_dm_object_name(Registry)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_impair_defense_disable_win_defender_report_infection_filter`'
