description: The following analytic detects modifications to the Windows registry
  that disable Windows Defender Application Guard auditing. It leverages data from
  the Endpoint.Registry data model, focusing on specific registry paths and values.
  This activity is significant because disabling auditing can hinder security monitoring
  and threat detection within the isolated environment, making it easier for malicious
  activities to go unnoticed. If confirmed malicious, this action could allow attackers
  to bypass Windows Defender protections, potentially leading to unauthorized access,
  data exfiltration, or further system compromise.
required_fields:
- _time
- Registry.registry_key_name
- Registry.registry_value_name
- Registry.dest
- Registry.user
- Registry.registry_path
- Registry.action
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry where Registry.registry_path= "*\\Policies\\Microsoft\\AppHVSI\\AuditApplicationGuard"
  Registry.registry_value_data="0x00000000" by Registry.registry_key_name Registry.user
  Registry.registry_path Registry.registry_value_data Registry.action Registry.dest
  | `drop_dm_object_name(Registry)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_impair_defense_disable_win_defender_app_guard_filter`'
