description: The following analytic detects instances of Winlogon.exe, a critical
  Windows process, connecting to public IP addresses. This behavior is identified
  using Endpoint Detection and Response (EDR) telemetry, focusing on network connections
  made by Winlogon.exe. Under normal circumstances, Winlogon.exe should not connect
  to public IPs, and such activity may indicate a compromise, such as the BlackLotus
  bootkit attack. This detection is significant as it highlights potential system
  integrity breaches. If confirmed malicious, attackers could maintain persistence,
  bypass security measures, and compromise the system at a fundamental level.
required_fields:
- dest
- parent_process_name
- process_name
- process_path
- process
- process_id
- dest_port
- publicIp
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_name IN (winlogon.exe)  Processes.process!=unknown
  by Processes.dest Processes.user Processes.parent_process_name Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | join  process_id [| tstats summariesonly=`summariesonly_config`
  allow_old_summaries=`oldsummaries_config` fillnull_value=`fillnull_config` count
  FROM datamodel=Network_Traffic.All_Traffic where All_Traffic.dest_port != 0 NOT
  (All_Traffic.dest IN (127.0.0.1,10.0.0.0/8,172.16.0.0/12, 192.168.0.0/16, 0:0:0:0:0:0:0:1))
  by All_Traffic.process_id All_Traffic.dest All_Traffic.dest_port | `drop_dm_object_name(All_Traffic)`
  | rename dest as publicIp ] | table dest parent_process_name process_name process_path
  process process_id dest_port publicIp | `windows_winlogon_with_public_network_connection_filter`'
