description: The following analytic detects modifications to the Windows registry
  that change the health check interval of Windows Defender. It leverages data from
  the Endpoint datamodel, specifically monitoring changes to the "ServiceKeepAlive"
  registry path with a value of "0x00000001". This activity is significant because
  altering Windows Defender settings can impair its ability to perform timely health
  checks, potentially leaving the system vulnerable. If confirmed malicious, this
  could allow an attacker to disable or delay security scans, increasing the risk
  of undetected malware or other malicious activities.
required_fields:
- _time
- Registry.registry_key_name
- Registry.registry_value_name
- Registry.dest
- Registry.user
- Registry.registry_path
- Registry.action
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry where Registry.registry_path= "*\\Windows Defender\\ServiceKeepAlive"
  Registry.registry_value_data="0x00000001" by Registry.registry_key_name Registry.user
  Registry.registry_path Registry.registry_value_data Registry.action Registry.dest
  | `drop_dm_object_name(Registry)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_impair_defense_change_win_defender_health_check_intervals_filter`'
