description: The following analytic detects the use of Windows Management Instrumentation
  Command-line (WMIC) to retrieve information about running processes, specifically
  targeting the command lines used to launch those processes. This detection leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on logs containing
  process details and command-line executions. This activity is significant as it
  may indicate suspicious behavior, such as a user or process gathering detailed process
  information, which is uncommon for non-technical users. If confirmed malicious,
  this could allow an attacker to gain insights into running processes, aiding in
  further exploitation or lateral movement.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=wmic.exe OR Processes.original_file_name=wmic.exe)
  Processes.process= "* process *" Processes.process= "* get commandline *" by Processes.dest
  Processes.user Processes.parent_process Processes.process_name Processes.process
  Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `windows_process_commandline_discovery_filter`'
