description: The following analytic detects the use of the findstr command to search
  for unsecured credentials in Group Policy Preferences (GPP). It leverages data from
  Endpoint Detection and Response (EDR) agents, focusing on command-line executions
  involving findstr.exe with references to SYSVOL and cpassword. This activity is
  significant because it indicates an attempt to locate and potentially decrypt embedded
  credentials in GPP, which could lead to unauthorized access. If confirmed malicious,
  this could allow an attacker to escalate privileges or gain access to sensitive
  systems and data within the domain.
required_fields:
- _time
- Processes.user
- Processes.dest
- Processes.process_name
- Processes.process
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.process_name
- Processes.process_id
- Processes.parent_process_id
- Processes.original_file_name
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=findstr.exe AND
  Processes.process=*sysvol* AND Processes.process=*cpassword*) by Processes.dest
  Processes.user Processes.parent_process_name Processes.process_name Processes.process
  Processes.process_id Processes.parent_process_id Processes.original_file_name |
  `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_findstr_gpp_discovery_filter`'
