description: The following analytic detects modifications to the Windows registry
  that override the Windows Defender SmartScreen prompt. It leverages data from the
  Endpoint.Registry data model, specifically monitoring changes to the "PreventSmartScreenPromptOverride"
  registry setting. This activity is significant because it indicates an attempt to
  disable the prevention of user overrides for SmartScreen prompts, potentially allowing
  users to bypass security warnings. If confirmed malicious, this could lead to users
  inadvertently executing or accessing harmful content, increasing the risk of security
  incidents or system compromises.
required_fields:
- _time
- Registry.registry_key_name
- Registry.registry_value_name
- Registry.dest
- Registry.user
- Registry.registry_path
- Registry.action
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE Registry.registry_path= "*\\Microsoft\\Edge\\PreventSmartScreenPromptOverride"
  Registry.registry_value_data= "0x00000000" BY Registry.dest Registry.user Registry.registry_path
  Registry.registry_key_name Registry.registry_value_name Registry.registry_value_data
  Registry.process_guid | `drop_dm_object_name(Registry)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_impair_defense_override_smartscreen_prompt_filter`'
