description: The following analytic detects FTP connections initiated by processes
  located in non-standard installation paths on Windows systems. It leverages Sysmon
  EventCode 3 to identify network connections where the process image path does not
  match common directories like "Program Files" or "Windows\System32". This activity
  is significant as FTP is often used by adversaries and malware, such as AgentTesla,
  for Command and Control (C2) communications to exfiltrate stolen data. If confirmed
  malicious, this could lead to unauthorized data transfer, exposing sensitive information
  and compromising the integrity of the affected host.
required_fields:
- _time
- Image
- DestinationPort
- DestinationPortName
- DestinationHostname
- SourceHostname
- SourcePort
- SourcePortName
- Protocol
- DestinationIp
- dest
- user
rule: sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational OR source=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
  OR source=Syslog:Linux-Sysmon/Operational EventCode=3 NOT(Image IN("*\\program files*",
  "*\\windows\\system32\\*","*\\windows\\SysWOW64\\*")) (DestinationPortName="ftp"
  OR DestinationPort=21) | stats count min(_time) as firstTime max(_time) as lastTime
  by Image DestinationPort DestinationPortName DestinationHostname DestinationIp SourcePort
  SourcePortName Protocol SourceHostname dest user | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_file_transfer_protocol_in_non_common_process_path_filter`
