description: The following analytic detects modifications to the Windows registry
  that disable Windows Defender's file hash computation by setting the EnableFileHashComputation
  value to 0. This detection leverages data from the Endpoint.Registry data model,
  focusing on changes to the specific registry path associated with Windows Defender.
  Disabling file hash computation can significantly impair Windows Defender's ability
  to detect and scan for malware, making it a critical behavior to monitor. If confirmed
  malicious, this activity could allow attackers to bypass Windows Defender, facilitating
  undetected malware execution and persistence in the environment.
required_fields:
- _time
- Registry.registry_key_name
- Registry.registry_value_name
- Registry.dest
- Registry.user
- Registry.registry_path
- Registry.action
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry where Registry.registry_path= "*\\Windows Defender\\MpEngine\\EnableFileHashComputation"
  Registry.registry_value_data="0x00000000" by Registry.registry_key_name Registry.user
  Registry.registry_path Registry.registry_value_data Registry.action Registry.dest
  | `drop_dm_object_name(Registry)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_impair_defense_disable_win_defender_compute_file_hashes_filter`'
