description: The following analytic detects potentially abnormal interactions with
  VaultCLI.dll, particularly those initiated by processes located in publicly writable
  Windows folder paths. The VaultCLI.dll module allows processes to extract credentials
  from the Windows Credential Vault. It was seen being abused by information stealers
  such as Meduza. The analytic monitors suspicious API calls, unauthorized credential
  access patterns, and anomalous process behaviors indicative of malicious activity.
  By leveraging a combination of signature-based detection and behavioral analysis,
  it effectively flags attempts to misuse the vault for credential theft, enabling
  swift response to protect sensitive user data and ensure system security.
required_fields:
- _time
- dest
- process_path
- ImageLoaded
- Signed
- ProcessId
rule: sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational OR source=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
  OR source=Syslog:Linux-Sysmon/Operational EventCode=7  ImageLoaded ="*\\vaultcli.dll"
  process_path IN("*\\windows\\fonts\\*", "*\\windows\\temp\\*", "*\\users\\public\\*",
  "*\\windows\\debug\\*", "*\\Users\\Administrator\\Music\\*", "*\\Windows\\servicing\\*",
  "*\\Users\\Default\\*", "*Recycle.bin*", "*\\Windows\\Media\\*", "\\Windows\\repair\\*",
  "*\\appdata\\local\\temp\\*", "*\\PerfLogs\\*", "*:\\temp\\*") | stats count min(_time)
  as firstTime max(_time) as lastTime by dest Image ImageLoaded process_name EventCode
  Signed ProcessId | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_credentials_access_via_vaultcli_module_filter`
