description: The following analytic detects modifications to the Windows registry
  that disable Windows Defender Signature Retirement. It leverages data from the Endpoint.Registry
  data model, specifically monitoring changes to the DisableSignatureRetirement registry
  setting. This activity is significant because disabling signature retirement can
  prevent Windows Defender from removing outdated antivirus signatures, potentially
  reducing its effectiveness in detecting threats. If confirmed malicious, this action
  could allow an attacker to evade detection by using older, less relevant signatures,
  thereby compromising the system's security posture.
required_fields:
- _time
- Registry.registry_key_name
- Registry.registry_value_name
- Registry.dest
- Registry.user
- Registry.registry_path
- Registry.action
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry where Registry.registry_path= "*\\Windows Defender\\NIS\\Consumers\\IPS\\DisableSignatureRetirement"
  Registry.registry_value_data="0x00000001" by Registry.registry_key_name Registry.user
  Registry.registry_path Registry.registry_value_data Registry.action Registry.dest
  | `drop_dm_object_name(Registry)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_impair_defense_disable_win_defender_signature_retirement_filter`'
