description: The following analytic detects the creation of a DLL file by an outlook.exe
  process in the AppData\Local\Microsoft\FORMS directory. This detection leverages
  data from the Endpoint.Processes and Endpoint.Filesystem datamodels, focusing on
  process and file creation events. This activity is significant as it may indicate
  an attempt to exploit CVE-2024-21378, where a custom MAPI form loads a potentially
  malicious DLL. If confirmed malicious, this could allow an attacker to execute arbitrary
  code, leading to further system compromise or data exfiltration.
required_fields:
- _time
- dest
- file_create_time
- file_name
- file_path
- process_name
- process_path
- process
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Processes where Processes.process_name=outlook.exe
  by _time span=1h Processes.process_id Processes.process_name Processes.process Processes.dest
  Processes.process_guid | `drop_dm_object_name(Processes)` | join process_guid, _time
  [ | tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Filesystem where Filesystem.file_name ="*.dll" Filesystem.file_path
  = "*\\AppData\\Local\\Microsoft\\FORMS\\IPM*" by _time span=1h Filesystem.dest Filesystem.file_create_time
  Filesystem.file_name Filesystem.file_path Filesystem.process_guid | `drop_dm_object_name(Filesystem)`
  | fields file_name file_path process_name process_path process dest file_create_time
  _time process_guid] | `windows_phishing_outlook_drop_dll_in_form_dir_filter`'
