description: The following analytic detects the use of CreateDump.exe to perform a
  process dump. This binary is not native to Windows and is often introduced by third-party
  applications, including PowerShell 7. The detection leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process names, GUIDs, and complete
  command-line executions. This activity is significant as it may indicate an attempt
  to dump LSASS memory, which can be used to extract credentials. If confirmed malicious,
  this could lead to unauthorized access and lateral movement within the network.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_name=createdump.exe OR
  Processes.original_file_name="FX_VER_INTERNALNAME_STR" Processes.process="*-u *"
  AND Processes.process="*-f *" by Processes.dest Processes.user Processes.parent_process_name
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_credential_dumping_lsass_memory_createdump_filter`'
