description: The following analytic identifies a high frequency of file deletions
  by monitoring Sysmon EventCodes 23 and 26 for specific file extensions. This detection
  leverages Sysmon logs to track deleted target filenames, process names, and process
  IDs. Such activity is significant as it often indicates ransomware behavior, where
  files are encrypted and the originals are deleted. If confirmed malicious, this
  activity could lead to extensive data loss and operational disruption, as ransomware
  can render critical files inaccessible, demanding a ransom for their recovery.
required_fields:
- EventCode
- TargetFilename
- dest
- user
- Image
- ProcessID
- _time
rule: sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational OR source=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
  OR source=Syslog:Linux-Sysmon/Operational EventCode IN ("23","26") TargetFilename
  IN ("*.cmd", "*.ini","*.gif", "*.jpg", "*.jpeg", "*.db", "*.ps1", "*.doc", "*.docx",
  "*.xls", "*.xlsx", "*.ppt", "*.pptx", "*.bmp","*.zip", "*.rar", "*.7z", "*.chm",
  "*.png", "*.log", "*.vbs", "*.js", "*.vhd", "*.bak", "*.wbcat", "*.bkf" , "*.backup*",
  "*.dsk", "*.win") NOT TargetFilename IN ("*\\INetCache\\Content.Outlook\\*") | stats
  count, values(TargetFilename) as deleted_files, min(_time) as firstTime, max(_time)
  as lastTime by user, dest, signature, signature_id, Image, process_name, process_guid
  | rename Image as process | where count >=100 | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_high_file_deletion_frequency_filter`
