description: The following analytic detects the use of net.exe to update user account
  policies to set passwords as non-expiring. It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on command-line executions involving "/maxpwage:unlimited".
  This activity is significant as it can indicate an attempt to maintain persistence,
  escalate privileges, evade defenses, or facilitate lateral movement. If confirmed
  malicious, this behavior could allow an attacker to maintain long-term access to
  compromised accounts, potentially leading to further exploitation and unauthorized
  access to sensitive information.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` values(Processes.process) as process min(_time)
  as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where (Processes.process_name="net.exe"
  OR Processes.original_file_name="net.exe" OR Processes.process_name="net1.exe" OR
  Processes.original_file_name="net1.exe") AND Processes.process="* accounts *" AND
  Processes.process="* /maxpwage:unlimited" by Processes.dest Processes.user Processes.parent_process_name
  Processes.process_name Processes.original_file_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_valid_account_with_never_expires_password_filter`'
