description: The following analytic detects when the Task Scheduler service ("svchost.exe
  -k netsvcs -p -s Schedule") spawns common command line, scripting, or shell execution
  binaries such as "powershell.exe" or "cmd.exe". This detection leverages data from
  Endpoint Detection and Response (EDR) agents, focusing on process and parent process
  relationships. This activity is significant as attackers often abuse the Task Scheduler
  for execution and persistence, blending in with legitimate Windows operations. If
  confirmed malicious, this could allow attackers to execute arbitrary code, maintain
  persistence, or escalate privileges within the environment.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_id
- Processes.parent_process_name
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.parent_process="*\\system32\\svchost.exe*"
  AND Processes.parent_process="*-k*" AND Processes.parent_process= "*netsvcs*" AND
  Processes.parent_process="*-p*" AND Processes.parent_process="*-s*" AND Processes.parent_process="*Schedule*"
  Processes.process_name IN("powershell.exe", "wscript.exe", "cscript.exe", "cmd.exe",
  "sh.exe", "ksh.exe", "zsh.exe", "bash.exe", "scrcons.exe","pwsh.exe") by Processes.dest
  Processes.user Processes.parent_process Processes.process_name Processes.process
  Processes.process_id Processes.parent_process_id Processes.parent_process_name |
  `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_scheduled_task_service_spawned_shell_filter`'
