description: The following analytic identifies instances of the searchindexer.exe
  process that are not spawned by services.exe, indicating potential process injection.
  This detection leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process names and parent processes. This activity is significant because
  QakBot malware often uses a fake searchindexer.exe to evade detection and perform
  malicious actions such as data exfiltration and keystroke logging. If confirmed
  malicious, this activity could allow attackers to maintain persistence, steal sensitive
  information, and communicate with command and control servers.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
- Processes.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.parent_process_name != services.exe
  Processes.process_name=searchindexer.exe by Processes.dest Processes.user Processes.parent_process_name
  Processes.parent_process Processes.process_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_process_injection_in_non_service_searchindexer_filter`'
