description: The following analytic identifies 'netsh' processes that delete or modify
  firewall configurations. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on command-line executions containing specific keywords.
  This activity is significant because it can indicate malware, such as NJRAT, attempting
  to alter firewall settings to evade detection or remove traces. If confirmed malicious,
  this behavior could allow an attacker to disable security measures, facilitating
  further compromise and persistence within the network.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=netsh.exe OR Processes.original_file_name=netsh.exe)
  Processes.process = "* firewall *" Processes.process = "* del*" by Processes.parent_process
  Processes.parent_process_name Processes.process_name Processes.process_id Processes.process_guid
  Processes.process Processes.user Processes.dest | `drop_dm_object_name("Processes")`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `windows_delete_or_modify_system_firewall_filter`'
