description: The following analytic detects when a process spawns an executable known
  for User Account Control (UAC) bypass exploitation and subsequently monitors for
  any child processes with a higher integrity level than the original process. This
  detection leverages Sysmon EventID 1 data, focusing on process integrity levels
  and known UAC bypass executables. This activity is significant as it may indicate
  an attacker has successfully used a UAC bypass exploit to escalate privileges. If
  confirmed malicious, the attacker could gain elevated privileges, potentially leading
  to further system compromise and persistent access.
required_fields:
- Processes.dest
- Processes.user
- Processes.parent_process_guid
- Processes.parent_process
- Processes.parent_process_name
- Processes.process_name Processes.process
- Processes.process_path
- Processes.process_integrity_level
- Processes.process_current_directory
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count max(_time) as lastTime from datamodel=Endpoint.Processes
  where Processes.process_integrity_level IN ("low","medium") by Processes.dest, Processes.user,
  Processes.process_name, Processes.process, Processes.process_guid, Processes.process_path,
  Processes.process_integrity_level, Processes.process_current_directory | `drop_dm_object_name(Processes)`
  | eval original_integrity_level = CASE(match(process_integrity_level,"low"),1,match(process_integrity_level,"medium"),2,match(process_integrity_level,"high"),3,match(process_integrity_level,"system"),4,true(),0)
  | rename process_guid as join_guid_1, process* as parent_process* | join max=0 dest
  join_guid_1 [| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime from datamodel=Endpoint.Processes
  where Processes.process_integrity_level IN ("high","system") AND Processes.process_name
  IN (BitlockerWizardElev.exe,cliconfg.exe,clipup.exe,cmstp.exe,CompMgmtLauncher.exe,consent.exe,control.exe,credwiz.exe,dccw.exe,dismhost.exe,EventVwr.exe,fodhelper.exe,GWXUXWorker.exe,inetmgr.exe,iscsicli.exe,mcx2prov.exe,migwiz.exe,mmc.exe,msconfig.exe,oobe.exe,osk.exe,pkgmgr.exe,recdisc.exe,rstrui.exe,sdclt.exe,setupsqm.exe,slui.exe,sysprep.exe,SystemPropertiesAdvanced.exe,taskhost.exe,TpmInit.exe,tzsync.exe,w32tm.exe,WerFault.exe,WSReset.exe,wusa.exe)
  by Processes.dest, Processes.parent_process_guid, Processes.process_name, Processes.process_guid
  | `drop_dm_object_name(Processes)` | rename parent_process_guid as join_guid_1,
  process_guid as join_guid_2, process_name as uac_process_name ] | join max=0 dest
  join_guid_2 [| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime from datamodel=Endpoint.Processes
  where Processes.parent_process_name IN (BitlockerWizardElev.exe,cliconfg.exe,clipup.exe,cmstp.exe,CompMgmtLauncher.exe,consent.exe,control.exe,credwiz.exe,dccw.exe,dismhost.exe,EventVwr.exe,fodhelper.exe,GWXUXWorker.exe,inetmgr.exe,iscsicli.exe,mcx2prov.exe,migwiz.exe,mmc.exe,msconfig.exe,oobe.exe,osk.exe,pkgmgr.exe,recdisc.exe,rstrui.exe,sdclt.exe,setupsqm.exe,slui.exe,sysprep.exe,SystemPropertiesAdvanced.exe,taskhost.exe,TpmInit.exe,tzsync.exe,w32tm.exe,WerFault.exe,WSReset.exe,wusa.exe)
  AND Processes.process_integrity_level IN ("high","system") by Processes.dest, Processes.parent_process_guid,
  Processes.process_name, Processes.process, Processes.process_guid, Processes.process_path,
  Processes.process_integrity_level, Processes.process_current_directory | `drop_dm_object_name(Processes)`
  | rename parent_process_guid as join_guid_2 | eval elevated_integrity_level = CASE(match(process_integrity_level,"low"),1,match(process_integrity_level,"medium"),2,match(process_integrity_level,"high"),3,match(process_integrity_level,"system"),4,true(),0)]
  | where elevated_integrity_level > original_integrity_level | table dest user parent_process
  parent_process_name parent_process_integrity_level process_integrity_level process
  process_name uac_process_name count firstTime lastTime | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_uac_bypass_suspicious_escalation_behavior_filter`'
