description: The following analytic detects the Windows InstallUtil.exe binary making
  a remote network connection. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process and network telemetry. This activity is significant
  because InstallUtil.exe can be exploited to download and execute malicious code,
  bypassing application control mechanisms. If confirmed malicious, an attacker could
  achieve code execution, potentially leading to further system compromise, data exfiltration,
  or lateral movement within the network. Analysts should review the parent process,
  network connections, and any associated file modifications to determine the legitimacy
  of this activity.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
- Ports.process_guid
- Ports.dest
- Ports.dest_port
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Processes where (Processes.process_name=installutil.exe
  OR Processes.original_file_name=InstallUtil.exe) by _time span=1h  Processes.process_id
  Processes.process_name Processes.dest Processes.user Processes.process_path Processes.process
  Processes.parent_process_name Processes.original_file_name | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | join  process_id [| tstats summariesonly=`summariesonly_config`
  allow_old_summaries=`oldsummaries_config` fillnull_value=`fillnull_config` count
  FROM datamodel=Network_Traffic.All_Traffic where All_Traffic.dest_port != 0 by All_Traffic.process_id
  All_Traffic.dest All_Traffic.dest_port | `drop_dm_object_name(All_Traffic)` | rename
  dest as C2 ] | table _time user dest parent_process_name process_name process_path
  process process_id dest_port C2 | `windows_installutil_remote_network_connection_filter`'
