description: The following analytic detects the creation of a suspicious registry
  entry by Qakbot malware, characterized by 8 random registry value names with encrypted
  binary data. This detection leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on registry modifications under the "SOFTWARE\\Microsoft\\"
  path by processes like explorer.exe. This activity is significant as it indicates
  potential Qakbot infection, which uses the registry to store malicious code or configuration
  data. If confirmed malicious, this could allow attackers to maintain persistence
  and execute arbitrary code on the compromised system.
required_fields:
- _time
- dest
- user
- parent_process_name
- parent_process
- process_name
- process_path
- process
- proc_guid
- registry_path
- registry_value_name
- registry_value_data
- process_id
- registry_key_name
- registry_key_name_len
- registry_value_name_len
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count dc(registry_value_name) as registry_value_name_count
  FROM datamodel=Endpoint.Registry where Registry.registry_path="*\\SOFTWARE\\Microsoft\\*"
  AND Registry.registry_value_data = "Binary Data" by _time span=1m Registry.dest
  Registry.user Registry.registry_path Registry.registry_value_name Registry.registry_value_data
  Registry.process_guid Registry.process_id Registry.registry_key_name | `drop_dm_object_name(Registry)`
  | eval registry_key_name_len = len(registry_key_name) | eval registry_value_name_len
  = len(registry_value_name) | regex registry_value_name="^[0-9a-fA-F]{8}" | where
  registry_key_name_len < 80 AND registry_value_name_len == 8 | join process_guid,
  _time [| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Processes where Processes.process_name
  IN ("explorer.exe", "wermgr.exe","dxdiag.exe", "OneDriveSetup.exe", "mobsync.exe",
  "msra.exe", "xwizard.exe") by _time span=1m Processes.process_id Processes.process_name
  Processes.process Processes.dest Processes.parent_process_name Processes.parent_process
  Processes.process_guid Processes.process_path | `drop_dm_object_name(Processes)`
  ] | stats min(_time) as firstTime max(_time) as lastTime values(registry_value_name)
  as registry_value_name dc(registry_value_name) as registry_value_name_count values(registry_key_name)
  by dest process_guid process_name parent_process_name | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | where registry_value_name_count
  >= 5 | `windows_modify_registry_qakbot_binary_data_registry_filter`'
