description: The following analytic detects attempts to reset the Directory Services
  Restore Mode (DSRM) administrator password on a Domain Controller. It leverages
  event code 4794 from the Windows Security Event Log, specifically looking for events
  where the DSRM password reset is attempted. This activity is significant because
  the DSRM account can be used similarly to a local administrator account, providing
  potential persistence for an attacker. If confirmed malicious, this could allow
  an attacker to maintain administrative access to the Domain Controller, posing a
  severe risk to the domain's security.
required_fields:
- _time
- All_Changes.result_id
- All_Changes.result
- All_Changes.action
- All_Changes.dest
- All_Changes.src
- All_Changes.user
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` min(_time) as _time from datamodel=Change where
  All_Changes.result_id="4794" AND All_Changes.result="set the Directory Services
  Restore Mode administrator password" by All_Changes.action, All_Changes.dest, All_Changes.src,
  All_Changes.user | `drop_dm_object_name(All_Changes)` | `windows_ad_dsrm_password_reset_filter`'
