description: The following analytic detects CertUtil.exe performing a backup of the
  Certificate Store. It leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on specific command-line executions involving CertUtil with backup
  parameters. This activity is significant because it may indicate an attempt to steal
  authentication certificates, which are critical for secure communications. If confirmed
  malicious, an attacker could use the stolen certificates to impersonate users, decrypt
  sensitive data, or gain unauthorized access to systems, leading to severe security
  breaches.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=certutil.exe OR
  Processes.original_file_name=CertUtil.exe) Processes.process IN ("*-backupdb *",
  "*-backup *") by Processes.dest Processes.user Processes.parent_process_name Processes.process_name
  Processes.original_file_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_steal_authentication_certificates_certutil_backup_filter`'
