description: The following analytic detects the use of a PowerShell commandlet to
  import an AppLocker XML policy. This behavior is identified by monitoring processes
  that execute the "Import-Module Applocker" and "Set-AppLockerPolicy" commands with
  the "-XMLPolicy" parameter. This activity is significant because it can indicate
  an attempt to disable or bypass security controls, as seen in the Azorult malware.
  If confirmed malicious, this could allow an attacker to disable antivirus products,
  leading to further compromise and persistence within the environment.
required_fields:
- _time
- Registry.registry_key_name
- Registry.registry_path
- Registry.user
- Registry.dest
- Registry.registry_value_name
- Registry.action
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` values(Processes.process) as process min(_time)
  as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where (Processes.process_name=pwsh.exe
  OR Processes.process_name=sqlps.exe OR Processes.process_name=sqltoolsps.exe OR
  Processes.process_name=powershell.exe OR Processes.process_name=powershell_ise.exe
  OR Processes.original_file_name=pwsh.dll OR Processes.original_file_name=PowerShell.EXE
  OR Processes.original_file_name=powershell_ise.EXE) AND Processes.process="*Import-Module
  Applocker*" AND Processes.process="*Set-AppLockerPolicy *"  AND Processes.process="*
  -XMLPolicy *" by Processes.dest Processes.user Processes.parent_process Processes.process_name
  Processes.original_file_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_impair_defense_add_xml_applocker_rules_filter`'
