description: The following analytic detects the modification of the Windows registry
  using the regedit.exe application with the silent mode parameter. It leverages data
  from Endpoint Detection and Response (EDR) agents, focusing on process names and
  command-line executions. This activity is significant because the silent mode allows
  registry changes without user confirmation, which can be exploited by adversaries
  to import malicious registry settings. If confirmed malicious, this could enable
  attackers to persist in the environment, escalate privileges, or manipulate system
  configurations, leading to potential system compromise.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` values(Processes.process) as process min(_time)
  as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where (Processes.process_name="regedit.exe"
  OR Processes.original_file_name="regedit.exe") AND Processes.process="* /s *" AND
  Processes.process="*.reg*" by Processes.dest Processes.user Processes.parent_process
  Processes.process_name Processes.original_file_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_modify_registry_regedit_silent_reg_import_filter`'
