description: The following analytic detects the creation or modification of registry
  keys associated with new Outlook form installations, potentially indicating exploitation
  of CVE-2024-21378. It leverages data from the Endpoint.Registry datamodel, focusing
  on registry paths involving InProcServer32 keys linked to Outlook forms. This activity
  is significant as it may signify an attempt to achieve authenticated remote code
  execution via malicious form objects. If confirmed malicious, this could allow an
  attacker to create arbitrary files and registry keys, leading to remote code execution
  and potential full system compromise.
required_fields:
- Registry.registry_path
- Registry.registry_key_name
- Registry.registry_value_name
- Registry.registry_value_data
- Registry.dest
- Registry.process_guid
- Registry.user
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Registry where Registry.registry_path="*\\InProcServer32\\*"
  Registry.registry_value_data=*\\FORMS\\* by Registry.registry_path Registry.registry_key_name
  Registry.registry_value_name Registry.registry_value_data Registry.dest Registry.process_guid
  Registry.user | `drop_dm_object_name(Registry)` |convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_inprocserver32_new_outlook_form_filter`'
