description: The following analytic detects modifications in the Windows registry
  to disable firewall and network protection settings within Windows Defender Security
  Center. It leverages data from the Endpoint.Registry data model, specifically monitoring
  changes to the UILockdown registry value. This activity is significant as it may
  indicate an attempt to impair system defenses, potentially restricting users from
  modifying firewall or network protection settings. If confirmed malicious, this
  could allow an attacker to weaken the system's security posture, making it more
  vulnerable to further attacks and unauthorized access.
required_fields:
- _time
- Registry.registry_key_name
- Registry.registry_value_name
- Registry.dest
- Registry.user
- Registry.registry_path
- Registry.action
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry where Registry.registry_path= "*\\Windows Defender
  Security Center\\Firewall and network protection\\UILockdown" Registry.registry_value_data="0x00000001"
  by Registry.registry_key_name Registry.user Registry.registry_path Registry.registry_value_data
  Registry.action Registry.dest | `drop_dm_object_name(Registry)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_impair_defense_disable_defender_firewall_and_network_filter`'
