description: The following analytic identifies the execution of RemCom.exe, an open-source
  alternative to PsExec, used for lateral movement and remote command execution. It
  leverages data from Endpoint Detection and Response (EDR) agents, focusing on process
  names, original file names, and command-line arguments. This activity is significant
  as it indicates potential lateral movement within the network. If confirmed malicious,
  this could allow an attacker to execute commands remotely, potentially leading to
  further compromise and control over additional systems within the network.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=remcom.exe OR Processes.original_file_name=RemCom.exe)
  Processes.process="*\\*" Processes.process IN ("*/user:*", "*/pwd:*") by Processes.dest
  Processes.user Processes.parent_process_name Processes.process_name Processes.original_file_name
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `windows_lateral_tool_transfer_remcom_filter`'
