description: The following analytic detects modifications to the Windows registry
  entry "DisableRestrictedAdmin," which controls the Restricted Admin mode behavior.
  This detection leverages registry activity logs from endpoint data sources like
  Sysmon or Carbon Black. Monitoring this activity is crucial as changes to this setting
  can disable a security feature that limits credential exposure during remote connections.
  If confirmed malicious, an attacker could weaken security controls, increasing the
  risk of credential theft and unauthorized access to sensitive systems.
required_fields:
- _time
- Registry.registry_path
- Registry.registry_key_name
- Registry.registry_value_name
- Registry.registry_key_name
- Registry.user
- Registry.dest
- Registry.action
- Registry.registry_value_data
- Registry.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path= "*\\System\\CurrentControlSet\\Control\\Lsa\\DisableRestrictedAdmin"
  Registry.registry_value_data = 0x00000000) BY Registry.dest Registry.user Registry.registry_path
  Registry.registry_key_name Registry.registry_value_name Registry.registry_value_data
  Registry.process_guid | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `windows_modify_registry_disable_restricted_admin_filter`'
