description: The following analytic detects the use of mavinject.exe for DLL injection
  into running processes, identified by specific command-line parameters such as /INJECTRUNNING
  and /HMODULE. This detection leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process names and command-line executions. This activity
  is significant because it indicates potential arbitrary code execution, a common
  tactic for malware deployment and persistence. If confirmed malicious, this could
  allow attackers to execute unauthorized code, escalate privileges, and maintain
  persistence within the environment, posing a severe security risk.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_name=mavinject.exe Processes.process
  IN ("*injectrunning*", "*hmodule=0x*") by Processes.dest Processes.user Processes.parent_process_name
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_binary_proxy_execution_mavinject_dll_injection_filter`'
