description: The following analytic detects the creation or dropping of executable
  or script files in the root directory of a removable drive. It leverages data from
  the Endpoint.Filesystem datamodel, focusing on specific file types and their creation
  paths. This activity is significant as it may indicate an attempt to spread malware,
  such as ransomware, via removable media. If confirmed malicious, this behavior could
  lead to unauthorized code execution, lateral movement, or persistence within the
  network, potentially compromising sensitive data and systems.
required_fields:
- _time
- Filesystem.file_path
- Filesystem.file_create_time
- Filesystem.process_id
- Filesystem.file_name
- Filesystem.user
rule: '|tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Filesystem where (Filesystem.file_name = *.exe OR Filesystem.file_name
  = *.dll OR Filesystem.file_name = *.sys OR Filesystem.file_name = *.com OR Filesystem.file_name
  = *.vbs OR Filesystem.file_name = *.vbe OR Filesystem.file_name = *.js  OR Filesystem.file_name=
  *.bat OR Filesystem.file_name = *.cmd OR Filesystem.file_name = *.pif) by Filesystem.file_create_time
  Filesystem.process_id  Filesystem.file_name Filesystem.file_path Filesystem.user
  Filesystem.dest | `drop_dm_object_name(Filesystem)` | eval dropped_file_path = split(file_path,
  "\\") | eval dropped_file_path_split_count = mvcount(dropped_file_path) | eval root_drive
  = mvindex(dropped_file_path,0) | where LIKE(root_drive, "%:") AND dropped_file_path_split_count
  = 2  AND root_drive!= "C:" | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_replication_through_removable_media_filter`'
