description: The following analytic identifies the execution of the native mimikatz.exe
  binary on Windows systems, including instances where the binary is renamed. It leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on process names
  and original file names. This activity is significant because Mimikatz is a widely
  used tool for extracting authentication credentials, posing a severe security risk.
  If confirmed malicious, this activity could allow attackers to obtain sensitive
  credentials, escalate privileges, and move laterally within the network, leading
  to potential data breaches and system compromise.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=mimikatz.exe OR
  Processes.original_file_name=mimikatz.exe) by Processes.dest Processes.user Processes.parent_process_name
  Processes.process_name Processes.original_file_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_mimikatz_binary_execution_filter`'
