description: The following analytic detects the execution of WMI command lines used
  to create or execute processes. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on command-line events that include specific keywords like
  "process," "call," and "create." This activity is significant because adversaries
  often use WMI to execute malicious payloads on local or remote hosts, potentially
  bypassing traditional security controls. If confirmed malicious, this behavior could
  allow attackers to execute arbitrary code, escalate privileges, or maintain persistence
  within the environment, posing a severe threat to organizational security.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
- Processes.process_guid
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=wmic.exe OR Processes.original_file_name=wmic.exe)
  Processes.process = "* process *" Processes.process = "* call *" Processes.process
  = "* create *" by Processes.parent_process_name Processes.parent_process Processes.process_name
  Processes.process Processes.original_file_name Processes.process_id Processes.parent_process_path
  Processes.process_guid Processes.parent_process_id Processes.dest Processes.user
  Processes.process_path | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_wmi_process_call_create_filter`'
