description: The following analytic detects the creation of a new scheduled task using
  Schtasks.exe to run as the SYSTEM user. This detection leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on command-line executions and process
  details. This activity is significant as it often indicates an attempt to gain elevated
  privileges or maintain persistence within the environment. If confirmed malicious,
  an attacker could execute code with SYSTEM-level privileges, potentially leading
  to data theft, ransomware deployment, or further system compromise. Immediate investigation
  and mitigation are crucial to prevent further damage.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=schtasks.exe OR
  Processes.original_file_name=schtasks.exe) Processes.process="*/create *" AND Processes.process="*/ru
  *" AND Processes.process="*system*" by Processes.dest Processes.user Processes.parent_process_name
  Processes.process_name Processes.original_file_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_schtasks_create_run_as_system_filter`'
