description: The following analytic detects modifications to the Windows registry
  that set the Windows Defender SmartScreen level to "warn." This detection leverages
  data from the Endpoint.Registry data model, specifically monitoring changes to the
  ShellSmartScreenLevel registry value. This activity is significant because altering
  SmartScreen settings to "warn" can reduce immediate suspicion from users, allowing
  potentially malicious executables to run with just a warning prompt. If confirmed
  malicious, this could enable attackers to execute harmful files, increasing the
  risk of successful malware deployment and subsequent system compromise.
required_fields:
- _time
- Registry.registry_key_name
- Registry.registry_value_name
- Registry.dest
- Registry.user
- Registry.registry_path
- Registry.action
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry where Registry.registry_path= "*\\Microsoft\\Windows\\System\\ShellSmartScreenLevel"
  Registry.registry_value_data="Warn" by Registry.registry_key_name Registry.user
  Registry.registry_path Registry.registry_value_data Registry.action Registry.dest
  | `drop_dm_object_name(Registry)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_impair_defense_set_win_defender_smart_screen_level_to_warn_filter`'
