description: The following analytic detects the creation of files without extensions
  in critical folders like "System32\Drivers." It leverages data from the Endpoint.Filesystem
  datamodel, focusing on file paths and creation times. This activity is significant
  as it may indicate the presence of destructive malware, such as HermeticWiper, which
  drops driver components in these directories. If confirmed malicious, this behavior
  could lead to severe system compromise, including boot sector wiping, resulting
  in potential data loss and system inoperability.
required_fields:
- _time
- Filesystem.file_create_time
- Filesystem.process_id
- Filesystem.file_name
- Filesystem.user
- Filesystem.file_path
- Filesystem.dest
- Processes.process_name
- Processes.dest
- Processes.process_guid
- Processes.user
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Filesystem where
  Filesystem.file_path IN ("*\\System32\\drivers\\*", "*\\syswow64\\drivers\\*") by
  _time span=5m Filesystem.dest Filesystem.user Filesystem.file_name Filesystem.file_path
  Filesystem.process_guid Filesystem.file_create_time | `drop_dm_object_name(Filesystem)`
  | rex field="file_name" "\.(?<extension>[^\.]*$)" | where isnull(extension) | join
  process_guid [| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Processes by _time
  span=5m Processes.process_name Processes.dest Processes.process_guid Processes.user
  | `drop_dm_object_name(Processes)`] | stats count min(_time) as firstTime max(_time)
  as lastTime by dest process_name process_guid file_name file_path file_create_time
  user | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `windows_file_without_extension_in_critical_folder_filter`'
