description: The following analytic detects suspicious modifications to system firewall
  rules, specifically allowing execution of applications from notable and potentially
  malicious file paths. This detection leverages data from Endpoint Detection and
  Response (EDR) agents, focusing on command-line executions involving firewall rule
  changes. This activity is significant as it may indicate an adversary attempting
  to bypass firewall restrictions to execute malicious files. If confirmed malicious,
  this could allow attackers to execute unauthorized code, potentially leading to
  further system compromise, data exfiltration, or persistence within the environment.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process = "*firewall*" Processes.process
  = "*allow*" Processes.process = "*add*" Processes.process = "*ENABLE*" Processes.process
  IN ("*\\windows\\fonts\\*", "*\\windows\\temp\\*", "*\\users\\public\\*", "*\\windows\\debug\\*",
  "*\\Users\\Administrator\\Music\\*", "*\\Windows\\servicing\\*", "*\\Users\\Default\\*","*Recycle.bin*",
  "*\\Windows\\Media\\*", "\\Windows\\repair\\*", "*\\temp\\*", "*\\PerfLogs\\*")
  by Processes.dest Processes.user Processes.parent_process_name Processes.parent_process
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_modify_system_firewall_with_notable_process_path_filter`'
