description: The following analytic detects modifications in the Windows registry
  to disable Windows Defender generic reports. It leverages data from the Endpoint.Registry
  data model, specifically monitoring changes to the "DisableGenericRePorts" registry
  value. This activity is significant as it can prevent the transmission of error
  reports to Microsoft's Windows Error Reporting service, potentially hiding malicious
  activities. If confirmed malicious, this action could allow attackers to bypass
  Windows Defender detections, reducing the visibility of their activities and increasing
  the risk of undetected system compromise.
required_fields:
- _time
- Registry.registry_key_name
- Registry.registry_value_name
- Registry.dest
- Registry.user
- Registry.registry_path
- Registry.action
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry where Registry.registry_path= "*\\Windows Defender\\Reporting\\DisableGenericRePorts"
  Registry.registry_value_data="0x00000001" by Registry.registry_key_name Registry.user
  Registry.registry_path Registry.registry_value_data Registry.action Registry.dest
  | `drop_dm_object_name(Registry)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_impair_defense_disable_win_defender_gen_reports_filter`'
