description: The following analytic detects the creation of new ASPX files in the
  MOVEit Transfer application's "wwwroot" directory. It leverages endpoint data on
  process and filesystem activity to identify processes responsible for creating these
  files. This activity is significant as it may indicate exploitation of a critical
  zero-day vulnerability in MOVEit Transfer, used by threat actors to install malicious
  ASPX files. If confirmed malicious, this could lead to exfiltration of sensitive
  data, including user credentials and file metadata, posing a severe risk to the
  organization's security.
required_fields:
- _time
- Filesystem.file_path
- Filesystem.process_id
- Filesystem.file_name
- Filesystem.file_hash
- Filesystem.user
- Filesystem.file_create_time
- Processes.process_id
- Processes.process_name
- Processes.dest
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count FROM datamodel=Endpoint.Processes where Processes.process_name=System  by
  _time span=1h Processes.process_id Processes.process_name Processes.dest | `drop_dm_object_name(Processes)`
  | join process_guid, _time [| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Filesystem where Filesystem.file_path IN ("*\\MOVEitTransfer\\wwwroot\\*")
  Filesystem.file_name IN("*.aspx", "*.ashx", "*.asp*") OR Filesystem.file_name IN
  ("human2.aspx","_human2.aspx") by _time span=1h Filesystem.dest Filesystem.file_create_time
  Filesystem.file_name Filesystem.file_path | `drop_dm_object_name(Filesystem)` |
  fields _time dest file_create_time file_name file_path process_name process_path
  process] | dedup file_create_time | table dest file_create_time, file_name, file_path,
  process_name | `windows_moveit_transfer_writing_aspx_filter`'
