description: The following analytic detects modifications to the BootExecute registry
  key, which manages applications and services executed during system boot. It leverages
  data from the Endpoint.Registry data model, focusing on changes to the registry
  path "HKLM\\System\\CurrentControlSet\\Control\\Session Manager\\BootExecute". This
  activity is significant because unauthorized changes to this key can indicate attempts
  to achieve persistence, load malicious code, or tamper with the boot process. If
  confirmed malicious, this could allow an attacker to maintain persistence, execute
  arbitrary code at boot, or disrupt system operations.
required_fields:
- _time
- Registry.dest
- Registry.registry_path
- Registry.registry_key_name
- Registry.registry_value_name
- Registry.registry_value_data
- Registry.process_guid
- Registry.action
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry WHERE Registry.registry_path="HKLM\\System\\CurrentControlSet\\Control\\Session
  Manager\\BootExecute" BY Registry.dest Registry.registry_path Registry.registry_key_name
  Registry.registry_value_name Registry.registry_value_data Registry.process_guid,
  Registry.action | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$)| `windows_registry_bootexecute_modification_filter`'
