description: The following analytic identifies instances where three or more distinct
  registry modification events associated with MITRE ATT&CK Technique T1112 are detected.
  It leverages data from the Risk data model in Splunk, focusing on registry-related
  sources and MITRE technique annotations. This activity is significant because multiple
  registry modifications can indicate an attempt to persist, hide malicious configurations,
  or erase forensic evidence. If confirmed malicious, this behavior could allow attackers
  to maintain persistent access, execute malicious code, and evade detection, posing
  a severe threat to the integrity and security of the affected host.
required_fields:
- _time
- All_Risk.analyticstories
- All_Risk.risk_object_type
- All_Risk.risk_object
- All_Risk.annotations.mitre_attack.mitre_tactic
- source
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` min(_time) as firstTime max(_time) as lastTime
  sum(All_Risk.calculated_risk_score) as risk_score, count(All_Risk.calculated_risk_score)
  as risk_event_count, values(All_Risk.annotations.mitre_attack.mitre_tactic_id) as
  annotations.mitre_attack.mitre_tactic_id, dc(All_Risk.annotations.mitre_attack.mitre_tactic_id)
  as mitre_tactic_id_count, values(All_Risk.annotations.mitre_attack.mitre_technique_id)
  as annotations.mitre_attack.mitre_technique_id, dc(All_Risk.annotations.mitre_attack.mitre_technique_id)
  as mitre_technique_id_count, values(All_Risk.tag) as tag, values(source) as source,
  dc(source) as source_count from datamodel=Risk.All_Risk where source IN ("*registry*")
  All_Risk.annotations.mitre_attack.mitre_technique_id IN ("*T1112*") by All_Risk.risk_object
  All_Risk.risk_object_type All_Risk.annotations.mitre_attack.mitre_tactic | `drop_dm_object_name(All_Risk)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | where source_count >= 3 | `windows_modify_registry_risk_behavior_filter`'
