description: The following analytic detects the creation of a new scheduled task with
  the highest execution privileges via Schtasks.exe. It leverages Endpoint Detection
  and Response (EDR) logs to monitor for specific command-line parameters ('/rl' and
  'highest') in schtasks.exe executions. This activity is significant as it is commonly
  used in AsyncRAT attacks for persistence and privilege escalation. If confirmed
  malicious, this could allow an attacker to maintain persistent access and execute
  tasks with elevated privileges, potentially leading to unauthorized system access
  and data breaches.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime  from
  datamodel=Endpoint.Processes where Processes.process_name = "schtasks.exe" Processes.process
  = "*/rl *" Processes.process = "* highest *" by Processes.process_name Processes.parent_process_name
  Processes.parent_process Processes.process Processes.process_guid Processes.dest
  Processes.user | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_scheduled_task_with_highest_privileges_filter`'
