description: The following analytic identifies attempts to stop services on a system
  using `net.exe` or `sc.exe`. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process names, GUIDs, and command-line executions. This
  activity is significant as adversaries often terminate security or critical services
  to evade detection and further their objectives. If confirmed malicious, this behavior
  could allow attackers to disable security defenses, facilitate ransomware encryption,
  or disrupt essential services, leading to potential data loss or system compromise.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime  from
  datamodel=Endpoint.Processes where (Processes.process_name="net.exe" OR Processes.original_file_name="net.exe"
  OR Processes.process_name="net1.exe" OR Processes.original_file_name="net1.exe")
  OR  Processes.process_name = "sc.exe" OR Processes.original_file_name= "sc.exe"
  AND Processes.process="*stop*" by  Processes.process_name Processes.original_file_name
  Processes.process Processes.process_id Processes.process_guid Processes.parent_process_name
  Processes.parent_process Processes.parent_process_guid Processes.dest Processes.user
  | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_service_stop_via_net__and_sc_application_filter`'
