description: The following analytic detects modifications to the Windows registry
  specifically targeting the "WppTracingLevel" setting within Windows Defender. This
  detection leverages data from the Endpoint.Registry data model to identify changes
  in the registry path associated with Windows Defender tracing levels. Such modifications
  are significant as they can impair the diagnostic capabilities of Windows Defender,
  potentially hiding malicious activities. If confirmed malicious, this activity could
  allow an attacker to evade detection and maintain persistence within the environment,
  leading to further compromise and data exfiltration.
required_fields:
- _time
- Registry.registry_key_name
- Registry.registry_value_name
- Registry.dest
- Registry.user
- Registry.registry_path
- Registry.action
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  FROM datamodel=Endpoint.Registry where Registry.registry_path= "*\\Windows Defender\\Reporting\\WppTracingLevel"
  Registry.registry_value_data="0x00000001" by Registry.registry_key_name Registry.user
  Registry.registry_path Registry.registry_value_data Registry.action Registry.dest
  | `drop_dm_object_name(Registry)` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `windows_impair_defense_change_win_defender_tracing_level_filter`'
