description: The following analytic identifies instances where java.exe or w3wp.exe
  spawns a Windows shell, such as cmd.exe or powershell.exe. This detection leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on process and
  parent process relationships. This activity is significant as it may indicate exploitation
  attempts, such as those related to CVE-2021-44228 (Log4Shell). If confirmed malicious,
  attackers could execute arbitrary commands, potentially leading to system compromise,
  data exfiltration, or further lateral movement within the network.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.parent_process_name=java.exe OR
  Processes.parent_process_name=w3wp.exe (Processes.process_name=cmd.exe OR Processes.process_name=powershell.exe
  OR Processes.process_name=pwsh.exe OR Processes.process_name=sh.exe OR Processes.process_name=bash.exe
  OR Processes.process_name=wscript.exe OR Processes.process_name=cscript.exe) by
  Processes.dest Processes.user Processes.parent_process_name Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `windows_java_spawning_shells_filter`'
