description: The following analytic detects the creation of permanent event subscriptions
  using Windows Management Instrumentation (WMI). It leverages Sysmon EventID 5 data
  to identify instances where the event consumers are not the expected "NTEventLogEventConsumer."
  This activity is significant because it suggests an attacker is attempting to achieve
  persistence by running malicious scripts or binaries in response to specific system
  events. If confirmed malicious, this could lead to severe impacts such as data theft,
  ransomware deployment, or other damaging outcomes. Investigate the associated scripts
  or binaries to identify the source of the attack.
required_fields:
- _time
- EventCode
- Message
- consumer
- ComputerName
rule: sourcetype="wineventlog:microsoft-windows-wmi-activity/operational" EventCode=5861
  Binding | rex field=Message "Consumer =\s+(?<consumer>[^;|^$]+)" | search consumer!="NTEventLogEventConsumer=\"SCM
  Event Log Consumer\"" | stats count min(_time) as firstTime max(_time) as lastTime
  by ComputerName, consumer, Message | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)|
  convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | rename ComputerName as dest
  | `wmi_permanent_event_subscription_filter`
