description: The following analytic detects the creation of WMI temporary event subscriptions.
  It leverages Windows Event Logs, specifically EventCode 5860, to identify these
  activities. This detection is significant because attackers often use WMI to execute
  commands, gather information, or maintain persistence within a compromised system.
  If confirmed malicious, this activity could allow an attacker to execute arbitrary
  code, escalate privileges, or persist in the environment. Analysts should review
  the specific WMI queries and assess their intent, considering potential false positives
  from legitimate administrative tasks.
required_fields:
- _time
- EventCode
- Message
- query
rule: sourcetype="wineventlog:microsoft-windows-wmi-activity/operational" EventCode=5860
  Temporary | rex field=Message "NotificationQuery =\s+(?<query>[^;|^$]+)" | search
  query!="SELECT * FROM Win32_ProcessStartTrace WHERE ProcessName = 'wsmprovhost.exe'"
  AND query!="SELECT * FROM __InstanceOperationEvent WHERE TargetInstance ISA 'AntiVirusProduct'
  OR TargetInstance ISA 'FirewallProduct' OR TargetInstance ISA 'AntiSpywareProduct'"
  | stats count min(_time) as firstTime max(_time) as lastTime by ComputerName, query  |
  convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `wmi_temporary_event_subscription_filter`
