description: The following analytic identifies the use of the WMIC command-line tool
  attempting to uninstall applications non-interactively. It leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on specific command-line patterns
  associated with WMIC. This activity is significant because it is uncommon and may
  indicate an attempt to evade detection by uninstalling security software, as seen
  in IcedID malware campaigns. If confirmed malicious, this behavior could allow an
  attacker to disable security defenses, facilitating further compromise and persistence
  within the environment.
required_fields:
- _time
- Processes.dest
- Processes.user
- Processes.parent_process_name
- Processes.parent_process
- Processes.original_file_name
- Processes.process_name
- Processes.process
- Processes.process_id
- Processes.parent_process_path
- Processes.process_path
- Processes.parent_process_id
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where Processes.process_name=wmic.exe Processes.process="*
  product *" Processes.process="*where name*" Processes.process="*call uninstall*"
  Processes.process="*/nointeractive*" by Processes.dest Processes.user Processes.parent_process_name
  Processes.process_name Processes.process Processes.original_file_name Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `wmic_noninteractive_app_uninstallation_filter`'
