description: The following analytic detects the execution of an XSL script using the
  WMIC process, which is often indicative of malicious activity. It leverages data
  from Endpoint Detection and Response (EDR) agents, focusing on command-line executions
  involving WMIC and XSL files. This behavior is significant as it has been associated
  with the FIN7 group, known for using this technique to execute malicious scripts.
  If confirmed malicious, this activity could allow attackers to execute arbitrary
  code, potentially leading to system compromise and further malicious actions within
  the environment.
required_fields:
- _time
- Processes.parent_process_name
- Processes.parent_process
- Processes.process_name
- Processes.process_id
- Processes.process
- Processes.dest
- Processes.user
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=wmic.exe OR Processes.original_file_name=wmic.exe)
  Processes.process = "*os get*" Processes.process="*/format:*" Processes.process
  = "*.xsl*" by Processes.parent_process_name Processes.parent_process Processes.process_name
  Processes.process_id Processes.process Processes.dest Processes.user | `drop_dm_object_name(Processes)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `xsl_script_execution_with_wmic_filter`'
