description: The following analytic detects potential exploitation of the Adobe ColdFusion
  vulnerability, CVE-2023-26360, which allows unauthenticated arbitrary file read.
  It monitors web requests to the "/cf_scripts/scripts/ajax/ckeditor/*" path using
  the Web datamodel, focusing on specific ColdFusion paths to differentiate malicious
  activity from normal traffic. This activity is significant due to the vulnerability's
  high CVSS score of 9.8, indicating severe risk. If confirmed malicious, it could
  lead to unauthorized data access, further attacks, or severe operational disruptions,
  necessitating immediate investigation.
required_fields:
- _time
- Web.http_method
- Web.url
- Web.url_length
- Web.src
- Web.dest
- Web.http_user_agent
- Web.status
- sourcetype
rule: '| tstats count min(_time) as firstTime max(_time) as lastTime from datamodel=Web
  where Web.url IN ("/cf_scripts/scripts/ajax/ckeditor/*") Web.status=200 by Web.http_user_agent,
  Web.status Web.http_method, Web.url, Web.url_length, Web.src, Web.dest, sourcetype
  | `drop_dm_object_name("Web")` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `adobe_coldfusion_unauthenticated_arbitrary_file_read_filter`'
