description: The following analytic detects potential exploitation attempts against
  Adobe ColdFusion vulnerabilities CVE-2023-29298 and CVE-2023-26360. It monitors
  requests to specific ColdFusion Administrator endpoints, especially those with an
  unexpected additional forward slash, using the Web datamodel. This activity is significant
  for a SOC as it indicates attempts to bypass access controls, which can lead to
  unauthorized access to ColdFusion administration endpoints. If confirmed malicious,
  this could result in data theft, brute force attacks, or further exploitation of
  other vulnerabilities, posing a serious security risk to the environment.
required_fields:
- _time
- Web.http_method
- Web.url
- Web.url_length
- Web.src
- Web.dest
- Web.http_user_agent
- Web.status
- sourcetype
rule: '| tstats count min(_time) as firstTime max(_time) as lastTime from datamodel=Web
  where Web.url IN ("//restplay*", "//CFIDE/restplay*", "//CFIDE/administrator*",
  "//CFIDE/adminapi*", "//CFIDE/main*", "//CFIDE/componentutils*", "//CFIDE/wizards*",
  "//CFIDE/servermanager*","/restplay*", "/CFIDE/restplay*", "/CFIDE/administrator*",
  "/CFIDE/adminapi*", "/CFIDE/main*", "/CFIDE/componentutils*", "/CFIDE/wizards*",
  "/CFIDE/servermanager*") Web.status=200 by Web.http_user_agent, Web.status, Web.http_method,
  Web.url, Web.url_length, Web.src, Web.dest, sourcetype | `drop_dm_object_name("Web")`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `adobe_coldfusion_access_control_bypass_filter`'
