description: The following analytic detects attempts to exploit CVE-2022-26134, an
  unauthenticated remote code execution vulnerability in Confluence. It leverages
  the Web datamodel to analyze network and CIM-compliant web logs, identifying suspicious
  URL patterns and parameters indicative of exploitation attempts. This activity is
  significant as it allows attackers to execute arbitrary code on the Confluence server
  without authentication, potentially leading to full system compromise. If confirmed
  malicious, this could result in unauthorized access, data exfiltration, and further
  lateral movement within the network. Immediate investigation and remediation are
  crucial to prevent extensive damage.
required_fields:
- _time
- Web.http_method
- Web.url
- Web.url_length
- Web.src
- Web.dest
- Web.http_user_agent
rule: '| tstats count min(_time) as firstTime max(_time) as lastTime from datamodel=Web
  where Web.url IN ("*${*", "*%2F%7B*") (Web.url="*org.apache.commons.io.IOUtils*"
  Web.url="*java.lang.Runtime@getRuntime().exec*") OR (Web.url="*java.lang.Runtime%40getRuntime%28%29.exec*")
  OR (Web.url="*getEngineByName*" AND Web.url="*nashorn*" AND Web.url="*ProcessBuilder*")
  by Web.http_user_agent Web.http_method, Web.url,Web.url_length Web.src, Web.dest
  sourcetype | `drop_dm_object_name("Web")` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `confluence_unauthenticated_remote_code_execution_cve_2022_26134_filter`'
