description: The following analytic identifies potential exploitation attempts on
  a known vulnerability in Atlassian Confluence, specifically targeting the /setup/*.action*
  URL pattern. It leverages web logs within the Splunk 'Web' Data Model, filtering
  for successful accesses (HTTP status 200) to these endpoints. This activity is significant
  as it suggests attackers might be exploiting a privilege escalation flaw in Confluence.
  If confirmed malicious, it could result in unauthorized access or account creation
  with escalated privileges, leading to potential data breaches or further exploitation
  within the environment.
required_fields:
- _time
- Web.http_method
- Web.url
- Web.url_length
- Web.src
- Web.dest
- Web.http_user_agent
rule: '| tstats count min(_time) as firstTime max(_time) as lastTime from datamodel=Web
  where Web.url IN ("*/setup/setupadministrator.action*", "*/setup/finishsetup.action*",
  "*/json/setup-restore-local.action*", "*/json/setup-restore-progress.action*", "*/json/setup-restore.action*",
  "*/bootstrap/selectsetupstep.action*") Web.status=200 by Web.http_user_agent, Web.status
  Web.http_method, Web.url, Web.url_length, Web.src, Web.dest, sourcetype | `drop_dm_object_name("Web")`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `confluence_data_center_and_server_privilege_escalation_filter`'
