description: The following analytic detects the execution of known remote access software
  within the environment. It leverages network logs mapped to the Web data model,
  identifying specific URLs and user agents associated with remote access tools like
  AnyDesk, GoToMyPC, LogMeIn, and TeamViewer. This activity is significant as adversaries
  often use these utilities to maintain unauthorized remote access. If confirmed malicious,
  this could allow attackers to control systems remotely, exfiltrate data, or further
  compromise the network, posing a severe security risk.
required_fields:
- _time
- Web.action
- Web.src
- Web.category
- Web.url_domain
rule: '| tstats count min(_time) as firstTime max(_time) as lastTime latest(Web.http_method)
  as http_method latest(Web.http_user_agent) as http_user_agent latest(Web.url) as
  url latest(Web.user) as user latest(Web.dest) as dest from datamodel=Web by Web.action
  Web.src Web.category Web.url_domain | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `drop_dm_object_name("Web")`
  | lookup remote_access_software remote_domain AS url_domain OUTPUT isutility, description
  as signature, comment_reference as desc, category | search isutility = True | eval
  exception_asset = CASE(isnotnull(src),src,isnotnull(dest),dest) | lookup update=true
  asset_lookup_by_str asset as exception_asset OUTPUTNEW asset as asset_temp_field
  | eval asset_temp_field = CASE(isnull(asset_temp_field),exception_asset,true(),asset_temp_field
  ) | lookup remote_access_software_exceptions asset as asset_temp_field software
  as signature OUTPUT exception as rmm_exception, exception_date as rmm_exception_date,
  exception_ttl_days as rmm_exception_ttl_days, comment as rmm_exception_comment |
  eval rmm_exception = mvdedup(mvfilter(NOT match(rmm_exception,"false"))), rmm_exception_date
  = mvdedup(mvfilter(NOT match(rmm_exception_date,"false"))), rmm_exception_ttl_days
  = mvdedup(mvfilter(NOT match(rmm_exception_ttl_days,"false"))), rmm_exception_comment
  = mvdedup(mvfilter(NOT match(rmm_exception_comment,"false"))), rmm_exception_end_date
  = relative_time(strptime(rmm_exception_date, "%Y-%m-%d"), "+"+rmm_exception_ttl_days+"d"),
  rmm_exception_end = CASE((now() >= rmm_exception_end_date),"TRUE",(now() < rmm_exception_end_date),"FALSE",(match(rmm_exception,"(?i)true")
  AND isnull(rmm_exception_ttl_days)),"UNLIMITED") | search NOT (rmm_exception = TRUE
  AND rmm_exception_end IN ("FALSE","UNLIMITED")) | fields - asset_temp_field,exception_asset
  | `detect_remote_access_software_usage_url_filter`'
