description: The following analytic detects a high volume of outbound web traffic,
  specifically over 1GB of data sent to a URL within a 2-minute window. It leverages
  the Web data model to identify significant uploads by analyzing the sum of bytes
  out. This activity is significant as it may indicate potential data exfiltration
  by malware or malicious insiders. If confirmed as malicious, this behavior could
  lead to unauthorized data transfer, resulting in data breaches and loss of sensitive
  information. Immediate investigation is required to determine the legitimacy of
  the transfer and mitigate any potential threats.
required_fields:
- _time
- Web.http_method
- Web.url
- Web.url_length
- Web.src
- Web.dest
- Web.http_user_agent
rule: '| tstats  summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count sum(Web.bytes_out) as sum_bytes_out values(Web.user)
  as user values(Web.app) as app values(Web.dest) as dest from datamodel=Web by _time
  span=2m Web.url Web.src sourcetype | search sum_bytes_out > 1070000000 | `drop_dm_object_name("Web")`|
  `high_volume_of_bytes_out_to_url_filter`'
