description: The following analytic identifies attempts to exploit the CVE-2023-46805
  and CVE-2024-21887 vulnerabilities in Ivanti Connect Secure. It detects POST requests
  to specific URIs that leverage command injection to execute arbitrary commands.
  The detection uses the Web datamodel to monitor for these requests and checks for
  a 200 OK response, indicating a successful exploit attempt. This activity is significant
  as it can lead to unauthorized command execution on the server. If confirmed malicious,
  attackers could gain control over the system, leading to potential data breaches
  or further network compromise.
required_fields:
- Web.src
- Web.dest
- Web.http_user_agent
- Web.url
rule: '| tstats count min(_time) as firstTime max(_time) as lastTime from datamodel=Web
  where Web.url IN("*/api/v1/totp/user-backup-code/../../system/maintenance/archiving/cloud-server-test-connection*","*/api/v1/totp/user-backup-code/../../license/keys-status/*")
  Web.http_method IN ("POST", "GET") Web.status=200 by Web.src, Web.dest, Web.http_user_agent,
  Web.url, Web.http_method, Web.status | `drop_dm_object_name("Web")` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `ivanti_connect_secure_command_injection_attempts_filter`'
