description: The following analytic detects attempts to exploit CVE-2023-35078, a
  vulnerability in Ivanti Endpoint Manager Mobile (EPMM) versions up to 11.4. It identifies
  HTTP requests to the endpoint "/mifs/aad/api/v2/authorized/users?*" with a status
  code of 200 in web logs. This activity is significant as it indicates unauthorized
  remote access to restricted functionalities or resources. If confirmed malicious,
  this could lead to data theft, unauthorized modifications, or further system compromise,
  necessitating immediate action to mitigate potential severe impacts.
required_fields:
- _time
- Web.http_method
- Web.url
- Web.url_length
- Web.src
- Web.dest
rule: '| tstats count min(_time) as firstTime max(_time) as lastTime from datamodel=Web
  where Web.url IN ("/mifs/aad/api/v2/authorized/users?*") Web.status=200 by Web.http_user_agent,
  Web.status Web.http_method, Web.url, Web.url_length, Web.src, Web.dest, sourcetype
  | `drop_dm_object_name("Web")` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `ivanti_epmm_remote_unauthenticated_api_access_cve_2023_35078_filter`'
