description: The following analytic identifies POST requests targeting endpoints vulnerable
  to the SSRF issue (CVE-2024-21893) in Ivanti's products. It leverages the Web data
  model, focusing on endpoints such as /dana-ws/saml20.ws, /dana-ws/saml.ws, /dana-ws/samlecp.ws,
  and /dana-na/auth/saml-logout.cgi. The detection filters for POST requests that
  received an HTTP 200 OK response, indicating successful execution. This activity
  is significant as it may indicate an attempt to exploit SSRF vulnerabilities, potentially
  allowing attackers to access internal services or sensitive data. If confirmed malicious,
  this could lead to unauthorized access and data exfiltration.
required_fields:
- Web.src
- Web.dest
- Web.http_user_agent
- Web.url
- Web.status
- Web.http_method
rule: '| tstats count min(_time) as firstTime max(_time) as lastTime from datamodel=Web
  where Web.url IN ("*/dana-ws/saml20.ws*","*/dana-ws/saml.ws*","*/dana-ws/samlecp.ws*","*/dana-na/auth/saml-logout.cgi/*")
  Web.http_method=POST Web.status=200 by Web.src, Web.dest, Web.http_user_agent, Web.url,
  Web.status, Web.http_method | `drop_dm_object_name("Web")` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `ivanti_connect_secure_ssrf_in_saml_component_filter`'
