description: This detection identifies potential exploitation of a critical SQL injection
  vulnerability in Ivanti Endpoint Manager (EPM), identified as CVE-2024-29824. The
  vulnerability, which has a CVSS score of 9.8, allows for remote code execution through
  the `RecordGoodApp` function in the `PatchBiz.dll` file. An attacker can exploit
  this vulnerability by manipulating the `goodApp.md5` value in an HTTP POST request
  to the `/WSStatusEvents/EventHandler.asmx` endpoint, leading to unauthorized command
  execution on the server. Monitoring for unusual SQL commands and HTTP requests to
  this endpoint can help identify exploitation attempts. Note that, the detection
  is focused on the URI path, HTTP method and status code of 200, indicating potential
  exploitation. To properly identify if this was successful, TLS inspection and additional
  network traffic analysis is required as the xp_cmdshell comes in via the request
  body.
required_fields:
- Web.http_user_agent
- Web.status
- Web.http_method
- Web.url
- Web.url_length
- Web.src
- Web.dest
- sourcetype
rule: '| tstats count min(_time) as firstTime max(_time) as lastTime from datamodel=Web
  where Web.url IN ("/WSStatusEvents/EventHandler.asmx") Web.http_method=POST Web.status=200
  by Web.http_user_agent, Web.status Web.http_method, Web.url, Web.url_length, Web.src,
  Web.dest, sourcetype | `drop_dm_object_name("Web")` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `ivanti_epm_sql_injection_remote_code_execution_filter`'
