description: The following analytic detects potential unauthorized access attempts
  exploiting CVE-2023-35082 within Ivanti's software products. It identifies access
  to the specific URI path /mifs/asfV3/api/v2/ with an HTTP 200 response code in web
  access logs, indicating successful unauthorized access. This activity is significant
  for a SOC as it highlights potential security breaches that could lead to unauthorized
  data access or system modifications. If confirmed malicious, an attacker could gain
  unbridled access to sensitive organizational data or modify systems maliciously,
  posing severe security risks.
required_fields:
- _time
- Web.http_method
- Web.url
- Web.url_length
- Web.src
- Web.dest
rule: '| tstats count min(_time) as firstTime max(_time) as lastTime from datamodel=Web
  where Web.url IN ("/mifs/asfV3/api/v2/*") Web.status=200 by Web.http_user_agent,
  Web.status Web.http_method, Web.url, Web.url_length, Web.src, Web.dest, sourcetype
  | `drop_dm_object_name("Web")` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `ivanti_epmm_remote_unauthenticated_api_access_cve_2023_35082_filter`'
