description: The following analytic identifies attempts to exploit the CVE-2023-46805
  and CVE-2024-21887 vulnerabilities in Ivanti Connect Secure. It detects GET requests
  to the /api/v1/totp/user-backup-code/../../system/system-information URI, which
  leverage an authentication bypass to access system information. The detection uses
  the Web datamodel to identify requests with a 200 OK response, indicating a successful
  exploit attempt. This activity is significant as it reveals potential unauthorized
  access to sensitive system information. If confirmed malicious, attackers could
  gain critical insights into the system, facilitating further exploitation and compromise.
required_fields:
- Web.src
- Web.dest
- Web.http_user_agent
- Web.url
rule: '| tstats count min(_time) as firstTime max(_time) as lastTime from datamodel=Web
  where Web.url="*/api/v1/totp/user-backup-code/../../system/system-information*"
  Web.http_method=GET Web.status=200 by Web.src, Web.dest, Web.http_user_agent, Web.url
  | `drop_dm_object_name("Web")` | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `ivanti_connect_secure_system_information_access_via_auth_bypass_filter`'
