description: The following analytic detects Log4Shell JNDI payload injections via
  outbound connections. It identifies suspicious LDAP lookup functions in web logs,
  such as `${jndi:ldap://PAYLOAD_INJECTED}`, and correlates them with network traffic
  to known malicious IP addresses. This detection leverages the Web and Network_Traffic
  data models in Splunk. Monitoring this activity is crucial as it targets vulnerabilities
  in Java web applications using log4j, potentially leading to remote code execution.
  If confirmed malicious, attackers could gain unauthorized access, execute arbitrary
  code, and compromise sensitive data within the affected environment.
required_fields:
- action
- category
- dest
- dest_port
- http_content_type
- http_method
- http_referrer
- http_user_agent
- site
- src
- url
- url_domain
- user
rule: '| from datamodel Web.Web | rex field=_raw max_match=0 "[jJnNdDiI]{4}(\:|\%3A|\/|\%2F)(?<proto>\w+)(\:\/\/|\%3A\%2F\%2F)(\$\{.*?\}(\.)?)?(?<affected_host>[a-zA-Z0-9\.\-\_\$]+)"
  | join affected_host type=inner [| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Network_Traffic.All_Traffic by All_Traffic.dest | `drop_dm_object_name(All_Traffic)`
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | rename dest AS affected_host] | fillnull | stats count by action,
  category, dest, dest_port, http_content_type, http_method, http_referrer, http_user_agent,
  site, src, url, url_domain, user | `log4shell_jndi_payload_injection_with_outbound_connection_filter`'
