description: The following analytic detects potential exploitation attempts against
  Microsoft SharePoint Server vulnerability CVE-2023-29357. It leverages the Web datamodel
  to monitor for specific API calls and HTTP methods indicative of privilege escalation
  attempts. This activity is significant as it may indicate an attacker is trying
  to gain unauthorized privileged access to the SharePoint environment. If confirmed
  malicious, the impact could include unauthorized access to sensitive data, potential
  data theft, and further compromise of the SharePoint server, leading to a broader
  security breach.
required_fields:
- _time
- Web.http_method
- Web.url
- Web.url_length
- Web.src
- Web.dest
- Web.http_user_agent
- Web.status
- sourcetype
rule: '| tstats count min(_time) as firstTime max(_time) as lastTime from datamodel=Web
  where Web.url IN ("/_api/web/siteusers*","/_api/web/currentuser*") Web.status=200
  Web.http_method=GET by Web.http_user_agent, Web.status Web.http_method, Web.url,
  Web.url_length, Web.src, Web.dest, sourcetype | `drop_dm_object_name("Web")` | convert
  timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | `microsoft_sharepoint_server_elevation_of_privilege_filter`'
