description: The following analytic identifies web requests to domains that closely
  resemble your monitored brand's domain, indicating potential brand abuse. It leverages
  data from web traffic sources, such as web proxies or network traffic analysis tools,
  and cross-references these with known domain permutations generated by the "ESCU
  - DNSTwist Domain Names" search. This activity is significant as it can indicate
  phishing attempts or other malicious activities targeting your brand. If confirmed
  malicious, attackers could deceive users, steal credentials, or distribute malware,
  leading to significant reputational and financial damage.
required_fields:
- _time
- Web.url
- Web.src
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` values(Web.url) as urls min(_time) as firstTime
  from datamodel=Web by Web.src | `drop_dm_object_name("Web")` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | lookup update=true brandMonitoring_lookup domain as urls OUTPUT
  domain_abuse | search domain_abuse=true | `monitor_web_traffic_for_brand_abuse_filter`'
