description: The following analytic detects potential exploitation attempts on publicly
  accessible PaperCut NG servers. It identifies connections from public IP addresses
  to the server, specifically monitoring URI paths commonly used in proof-of-concept
  scripts for exploiting PaperCut NG vulnerabilities. This detection leverages web
  traffic data from the `Web` datamodel, focusing on specific URI paths and excluding
  internal IP ranges. This activity is significant as it may indicate an attempt to
  exploit known vulnerabilities in PaperCut NG, potentially leading to unauthorized
  access or control of the server. If confirmed malicious, attackers could gain administrative
  access, leading to data breaches or further network compromise.
required_fields:
- _time
- Web.http_user_agent
- Web.http_method
- Web.url
- Web.url_length
- Web.src
- Web.dest
- sourcetype
rule: '| tstats count from datamodel=Web where Web.url IN ("/app?service=page/SetupCompleted",
  "/app", "/app?service=page/PrinterList", "/app?service=direct/1/PrinterList/selectPrinter&sp=*",
  "/app?service=direct/1/PrinterDetails/printerOptionsTab.tab") NOT (src IN ("10.*.*.*","172.16.*.*",
  "192.168.*.*", "169.254.*.*", "127.*.*.*", "fc00::*", "fd00::*", "fe80::*")) by
  Web.http_user_agent Web.http_method, Web.url,Web.url_length Web.src, Web.dest Web.dest_port
  sourcetype | `drop_dm_object_name("Web")` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `papercut_ng_remote_web_access_attempt_filter`'
