description: The following analytic identifies potential exploitation of Windows Exchange
  servers via ProxyShell or ProxyNotShell vulnerabilities, followed by post-exploitation
  activities such as running nltest, Cobalt Strike, Mimikatz, and adding new users.
  It leverages data from multiple analytic stories, requiring at least five distinct
  sources to trigger, thus reducing noise. This activity is significant as it indicates
  a high likelihood of an active compromise, potentially leading to unauthorized access,
  privilege escalation, and persistent threats within the environment. If confirmed
  malicious, attackers could gain control over the Exchange server, exfiltrate data,
  and maintain long-term access.
required_fields:
- All_Risk.analyticstories
- All_Risk.risk_object_type
- All_Risk.risk_object
- All_Risk.annotations.mitre_attack.mitre_tactic
- source
rule: '| tstats summariesonly=`summariesonly_config` allow_old_summaries=`oldsummaries_config`
  fillnull_value=`fillnull_config` min(_time) as firstTime max(_time) as lastTime
  sum(All_Risk.calculated_risk_score) as risk_score, count(All_Risk.calculated_risk_score)
  as risk_event_count, values(All_Risk.annotations.mitre_attack.mitre_tactic_id) as
  annotations.mitre_attack.mitre_tactic_id, dc(All_Risk.annotations.mitre_attack.mitre_tactic_id)
  as mitre_tactic_id_count, values(All_Risk.analyticstories) as analyticstories values(All_Risk.annotations.mitre_attack.mitre_technique_id)
  as annotations.mitre_attack.mitre_technique_id, dc(All_Risk.annotations.mitre_attack.mitre_technique_id)
  as mitre_technique_id_count, values(All_Risk.tag) as tag, values(source) as source,
  dc(source) as source_count dc(All_Risk.analyticstories) as dc_analyticstories from
  datamodel=Risk.All_Risk where All_Risk.analyticstories IN ("ProxyNotShell","ProxyShell")
  OR (All_Risk.analyticstories IN ("ProxyNotShell","ProxyShell") AND All_Risk.analyticstories="Cobalt
  Strike") All_Risk.risk_object_type="system" by _time span=1h All_Risk.risk_object
  All_Risk.risk_object_type | `drop_dm_object_name(All_Risk)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)| where source_count
  >=5 | `proxyshell_proxynotshell_behavior_detected_filter`'
