description: The following analytic identifies potential server-side template injection
  attempts related to CVE-2022-22954. It detects suspicious URL patterns containing
  "deviceudid" and keywords like "java.lang.ProcessBuilder" or "freemarker.template.utility.ObjectConstructor"
  using web or proxy logs within the Web Datamodel. This activity is significant as
  it may indicate an attempt to exploit a known vulnerability in VMware, potentially
  leading to remote code execution. If confirmed malicious, attackers could gain unauthorized
  access, execute arbitrary code, and compromise the affected system, posing a severe
  security risk.
required_fields:
- Web.http_method
- Web.url
- Web.url_length
- Web.src
- Web.dest
- Web.http_user_agent
rule: '| tstats count from datamodel=Web where Web.http_method IN ("GET") Web.url="*deviceudid=*"
  AND Web.url IN ("*java.lang.ProcessBuilder*","*freemarker.template.utility.ObjectConstructor*")
  by Web.http_user_agent Web.http_method, Web.url,Web.url_length Web.src, Web.dest
  sourcetype | `drop_dm_object_name("Web")` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `vmware_server_side_template_injection_hunt_filter`'
