description: The following analytic detects potential Remote Code Execution (RCE)
  attempts exploiting CVE-2023-40044 in WS_FTP software. It identifies HTTP POST requests
  to the "/AHT/AhtApiService.asmx/AuthUser" URL with a status code of 200. This detection
  leverages the Web datamodel to monitor specific URL patterns and HTTP status codes.
  This activity is significant as it may indicate an exploitation attempt, potentially
  allowing an attacker to execute arbitrary code on the server. If confirmed malicious,
  this could lead to unauthorized access, data exfiltration, or further compromise
  of the affected system.
required_fields:
- Web.http_user_agent
- Web.status
- Web.http_method
- Web.url
- Web.url_length
- Web.src
- Web.dest
- sourcetype
rule: '| tstats count min(_time) as firstTime max(_time) as lastTime from datamodel=Web
  where Web.url IN ("/AHT/AhtApiService.asmx/AuthUser") Web.status=200 Web.http_method=POST
  by Web.http_user_agent, Web.status Web.http_method, Web.url, Web.url_length, Web.src,
  Web.dest, sourcetype | `drop_dm_object_name("Web")` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime($field$) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `ws_ftp_remote_code_execution_filter`'
