description: The following analytic identifies potential adware activity blocked by
  Zscaler. It leverages web proxy logs to detect blocked actions associated with adware
  threats. Key data points such as device owner, user, URL category, destination URL,
  and IP are analyzed. This activity is significant as adware can degrade system performance,
  lead to unwanted advertisements, and potentially expose users to further malicious
  content. If confirmed malicious, it could indicate an attempt to compromise user
  systems, necessitating further investigation and remediation to prevent potential
  data breaches or system exploitation.
required_fields:
- action
- threatname
- deviceowner
- user
- urlcategory
- url
- dest
- dest_ip
- action
rule: source=zscaler sourcetype=zscalernss-web action=blocked threatname=*adware*
  | stats count min(_time) as firstTime max(_time) as lastTime  by action deviceowner
  user urlcategory url src dest | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$)
  | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime($field$) | `zscaler_adware_activities_threat_blocked_filter`
